import bCrypt from "bcryptjs";
import "dotenv/config";
// NPM Modules
import knex from "knex";
import knexConfigs from "../knex.configs";
import config from "../src/config/variables.config";

const { ADMIN_PASSWORD } = config;
const URL_IMAGES = process.env.SERVER_HOST_IMAGES;
const URL_GIF = process.env.SERVER_HOST_GIF;

const URL_VIDEOS = process.env.SERVER_HOST_VIDEOS;
const URL_SLIDES = process.env.SERVER_HOST_SLIDES;

async function seed(pg) {
  // Inserts seed entries
  await pg("admin").insert([
    {
      login: "superadmin",
      password: bCrypt.hashSync(ADMIN_PASSWORD, bCrypt.genSaltSync(10), null),
      role: "superadmin",
      created_at: new Date().toISOString(),
    },
  ]);
  await pg("header").insert([
    {
      title: "Գլխավոր էջ",
      created_at: new Date().toISOString(),
    },
    {
      title: "Մեր մասին",
      created_at: new Date().toISOString(),
    },
    {
      title: "Գործընկերներ",
      created_at: new Date().toISOString(),
    },
    {
      title: "Կապ մեզ հետ",
      created_at: new Date().toISOString(),
    },
    // {
    //   title: "Մուտք",
    //   created_at: new Date().toISOString(),
    // },
  ]);

  await pg("home_page").insert([
    {
      information: [
        {
          logo: `${URL_IMAGES}/message-icon.png`,
          title: "Էլ. հասցե",
          text: "info@arenmehrabyan.com",
        },
        {
          logo: `${URL_IMAGES}/call-icon.png`,
          title: "Հեռախոսահամար",
          text: "+37441407148",
        },
        {
          logo: `${URL_IMAGES}/location-icon.png`,
          title: "Գտնվելու վայր",
          text: "Նոր Նորքի 5-րդ զանգված, Ա. Միկոյան 15, Երևան, Հայաստան",
          link:"https://www.google.com/maps?q=40.21131005573589,44.710965156555176",
        },
      ],
      different: "contact",
      created_at: new Date().toISOString(),
    },
    {
      information: [
        {
          logo: `${URL_IMAGES}/video.png`,
          title: "Դասնթացներ",
          color: "#77aad9",

        },
        {
          logo: `${URL_IMAGES}/topic.png`,
          title: "Օգտակար նյութեր",
          color: "#4c7397",

        },
        {
          logo: `${URL_IMAGES}/game.png`,
          title: "Արբանյակ",
          color: "#425465",

        },
        {
          logo: `${URL_IMAGES}/cube.png`,
          title: "Արբանյակի կառավարում",
          color: "#2b393f",

        },
      ],
      different: "lessonBox",

      created_at: new Date().toISOString(),
    },
    {
      information: [
        {
          logo: `${URL_IMAGES}/partner.jpg`,
          title: "Մեր գործընկերները",
          readmore: "Կարդալ ավելին",
        },
        {
          logo: `${URL_IMAGES}/our-team.jpg`,
          title: "Մեր թիմը",
          readmore: "Կարդալ ավելին",
        },
        {
          logo: `${URL_IMAGES}/connect.png`,
          title: "Միացիր մեզ",
          readmore: "Կարդալ ավելին",

        },

      ],
      different: "downBox",

      created_at: new Date().toISOString(),
    },
    {
      information: [
        {
          logo: [`${URL_IMAGES}/sl1.jpg`,`${URL_IMAGES}/sl2.jpg`,`${URL_IMAGES}/sl3.jpg`,`${URL_IMAGES}/sl4.jpg`],
          title: "ԱՐԻ ԳՆԱ​​ՆՔ ՏԻԵԶԵՐՔ",
        },
      ],
      different: "text",

      created_at: new Date().toISOString(),
    },
    {
      information: [
        {
          logo: `${URL_IMAGES}/giphy.gif`,
          image:`${URL_IMAGES}/Tumanyan.png`,
          title:
            "Հոգիս տանը հաստատվել, Տիեզերքն է ողջ պատել, Տիեզերքի տերն եմ ես, Ո՞վ է արդյոք նկատել:",
          text: "Հովհաննես Թումանյան",
        },
      ],
      different: "Box",

      created_at: new Date().toISOString(),
    },

    {
      information: [
        {
          logo: `${URL_IMAGES}/logo.png`,
          title: "logo",
        },
      ],
      different: "logo",

      created_at: new Date().toISOString(),
    },
    {
      information: [
        {
          title: "ԿԱՊ ՄԵԶ ՀԵՏ",
          text: "Ազատորեն կապվեք մեզ հետ հեռախոսով կամ էլ-փոստով: Խնդրում եմ լրացնել կոնտակտային ձևը՝ մեզ հաղորդագրություն ուղարկելու համար: Մենք ձգտում ենք արագ արձագանքել բոլոր հարցումներին և տրամադրել ձեզ անհրաժեշտ տեղեկատվություն կամ օգնություն:",
          logo: `${URL_IMAGES}/giphy.gif`,
        },
      ],
      different: "contactUs",
      created_at: new Date().toISOString(),
    },
    {
      information: [
        {
          title: "Կապ մեզ հետ",
          text: "Ունե՞ք հարցեր, գրեք մեզ",
        },
        {
          title: "Էլ․ Հասցե",
          text: "Գրեք ձեր էլ․հասցեն",
        },
        {
          title: "Անուն",
          text: "Գրեք ձեր անունը",
        },
        {
          title: "Մեկնաբանություն",
          text: "Գրեք ձեր մեկնաբանությունը",
        },

        {
          title: "Ուղարկել",
        },
        {
          title: "Ձեր Նամակը հաջողությամբ ուղարկվել է",
          text: "Համակարգում խնդիր կա խնդրում ենք փորցել կրկին",
        },
      ],
      different: "sendMail",

      created_at: new Date().toISOString(),
    },
  ]);
  await pg("footer").insert([
    {
      title: "footer",
      text: "Բոլոր իրավունքները պաշտպանված են",
      logo: `${URL_IMAGES}/logo.png`,
      created_at: new Date().toISOString(),
    },
    {
      title: "facebook",
      logo: `${URL_IMAGES}/facebook.png`,
      text: "https://www.facebook.com/arenmehrabyanfoundation1/",
      created_at: new Date().toISOString(),
    },
    {
      title: "twitter",
      logo: `${URL_IMAGES}/twitter.png`,
      text: "https://twitter.com/",
      created_at: new Date().toISOString(),
    },
    {
      title: "instagram",
      logo: `${URL_IMAGES}/instagram.png`,
      text: "https://www.instagram.com/",
      created_at: new Date().toISOString(),
    },
    {
      title: "linkdn",
      logo: `${URL_IMAGES}/linkediN.png`,
      text: "https://www.linkedin.com/",
      created_at: new Date().toISOString(),
    },
  ]);
  await pg("contact").insert([
    {
      title: "Կապ մեզ հետ",
      text: "Ունե՞ք հարցեր, գրեք մեզ",
      nametext: "Անուն",
      emailtext: "Էլ. հասցե",
      messagetext: "Մեկնաբանություն",
      sendtext: "ՈՒՂԱՐԿԵԼ",
      nameplaceholder: "Գրեք ձեր անունը",
      emailplaceholder: "Գրեք ձեր էլ․ հասցեն",
      created_at: new Date().toISOString(),
    },
  ]);
  // L E S S O N S
  await pg("lessons").insert([
    {
      icon: `${URL_IMAGES}/Les1.png`,
      background: `${URL_IMAGES}/giphy.gif`,
      ikonka: `${URL_IMAGES}/propeller.jpg`,
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      color: "#adcce9",
      button:"Հետ",
      lectures: JSON.stringify([
        {
          color: "#adcce9",
          text: " Տիեզերքի հետազոտման կարևորագույն իրադարձությունների պատմական ակնարկ",
        
        },
        {
          color: "#77aad9",
          text: " Տիեզերական մրցավազքը և դրա ազդեցությունը",
        },
        {
          color: "#4c7397",
          text: " Տիեզերական հետազոտության ներկայիս միտումները և ապագա հեռանկարները",
        },
        {
          color: "#4c7397",
          text: " Տիեզերական գործակալությունները և նրանց առաքելությունները",
        },
        {
          color: "#425465",
          text: "Հարցաշար",
        },
      ]),
      created_at: new Date().toISOString(),
    },
    {
      icon: `${URL_IMAGES}/Les2.png`,
      ikonka: `${URL_IMAGES}/propeller.jpg`,
      background: `${URL_IMAGES}/giphy.gif`,
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      color: "#adcce9",
      button:"Հետ",
      lectures: JSON.stringify([
        {
          color: "#adcce9",
          text: " Մոլորակների, նրանց արբանյակների և հիմնական հատկանիշների ակնարկ",
        },
        {
          color: "#77aad9",
          text: " Գաճաճ մոլորակներ, աստերոիդներ և գիսաստղեր",
        },
        {
          color: "#4c7397",
          text: " Էկզոմոլորակներ և բնակելի աշխարհների որոնում",
        },
        {
          color: "#4c7397",
          text: " Վերջին հայտնագործություններն ու առաքելությունները մեր արեգակնային համակարգում",
        },
        {
          color: "#425465",
          text: "Հարցաշար",
        },
      ]),
      created_at: new Date().toISOString(),
    },
    {
      icon: `${URL_IMAGES}/Les3.png`,
      ikonka: `${URL_IMAGES}/propeller.jpg`,
      background: `${URL_IMAGES}/giphy.gif`,
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      color: "#adcce9",
      button:"Հետ",
      lectures: JSON.stringify([
        {
          color: "#adcce9",
          text: " Հրթիռային շարժման սկզբունքները",
        },
        {
          color: "#77aad9",
          text: " Հրթիռային շարժիչների տեսակները և դրանց կիրառությունները",
        },
        {
          color: "#4c7397",
          text: " Հրթիռների նախագծում և օպտիմալացում",
        },
        {
          color: "#4c7397",
          text: " Հրթիռային տեխնոլոգիայի ապագա զարգացումները",
        },
        {
          color: "#425465",
          text: "Հարցաշար",
        },
      ]),
      created_at: new Date().toISOString(),
    },
    {
      icon: `${URL_IMAGES}/Les4.png`,
      ikonka: `${URL_IMAGES}/propeller.jpg`,
      background: `${URL_IMAGES}/giphy.gif`,
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      color: "#adcce9",
      button:"Հետ",
      lectures: JSON.stringify([
        {
          color: "#adcce9",
          text: "Տիեզերանավերի տեսակները և դրանց գործառույթները",
        },
        {
          color: "#4c7397",
          text: "Ուղեծրի մեխանիկա և հետագծի հաշվարկներ",
        },
        {
          color: "#4c7397",
          text: " Միջմոլորակային առաքելություններ և տիեզերական զոնդեր",
        },
        {
          color: "#4c7397",
          text: " Առաքելության ուսումնասիրություն. Մարսագնացները և նրանց գիտական բացահայտումները",
        },
        {
          color: "#425465",
          text: "Հարցաշար",
        },
      ]),
      created_at: new Date().toISOString(),
    },

    // Continue

    // {
    //   icon: `${URL_IMAGES}/Les5.png`,
    //   ikonka: `${URL_IMAGES}/propeller.jpg`,
    //   background: `${URL_IMAGES}/giphy.gif`,
    //   title: "Դաս 5. Ապրել և աշխատել տիեզերքում",
    //   color: "#adcce9",
    //   // lectures:["Մարդկային տիեզերական թռիչքներ՝ անցյալ, ներկա և ապագա","Երկարատև տիեզերական ճանապարհորդության մարտահրավերները","Կենսապահովման համակարգեր և տիեզերագնացների բարեկեցություն","Տիեզերական բնակավայրեր և գաղութացման հայեցակարգեր","Հարցաշար"],
    //   lectures: JSON.stringify([
    //     {
    //       color: "#adcce9",
    //       text: "● Մարդկային տիեզերական թռիչքներ՝ անցյալ, ներկա և ապագա",
    //     },
    //     {
    //       color: "#77aad9",
    //       text: "● Երկարատև տիեզերական ճանապարհորդության մարտահրավերները",
    //     },
    //     {
    //       color: "#4c7397",
    //       text: "● Կենսապահովման համակարգեր և տիեզերագնացների բարեկեցություն",
    //     },
    //     {
    //       color: "#4c7397",
    //       text: "● Տիեզերական բնակավայրեր և գաղութացման հայեցակարգեր",
    //     },
    //     {
    //       color: "#425465",
    //       text: "Հարցաշար",
    //     },
    //   ]),
    //   created_at: new Date().toISOString(),
    // },
    // {
    //   icon: `${URL_IMAGES}/Les6.png`,
    //   ikonka: `${URL_IMAGES}/propeller.jpg`,
    //   background: `${URL_IMAGES}/giphy.gif`,
    //   title: "Դաս 6. Տիեզերական տեխնոլոգիաներ և հետազոտություններ",
    //   color: "#adcce9",
    //   // lectures:["Արբանյակային համակարգեր և հավելվածներ","Հեռավոր զոնդավորում և Երկրի դիտարկում","Տիեզերական աստղադիտակներ և աստղագիտական հայտնագործություններ","Տիեզերքի հետազոտության առաջադեմ տեխնոլոգիաներ","Հարցաշար"],
    //   lectures: JSON.stringify([
    //     {
    //       color: "#adcce9",
    //       text: "● Արբանյակային համակարգեր և հավելվածներ",
    //     },
    //     {
    //       color: "#77aad9",
    //       text: "● Հեռավոր զոնդավորում և Երկրի դիտարկում",
    //     },
    //     {
    //       color: "#4c7397",
    //       text: "● Տիեզերական աստղադիտակներ և աստղագիտական հայտնագործություններ",
    //     },
    //     {
    //       color: "#4c7397",
    //       text: "● Տիեզերքի հետազոտության առաջադեմ տեխնոլոգիաներ",
    //     },
    //     {
    //       color: "#425465",
    //       text: "Հարցաշար",
    //     },
    //   ]),
    //   created_at: new Date().toISOString(),
    // },
    // {
    //   icon: `${URL_IMAGES}/Les7.png`,
    //   ikonka: `${URL_IMAGES}/propeller.jpg`,
    //   background: `${URL_IMAGES}/giphy.gif`,

    //   title: "Դաս 7. Տիեզերագիտություն և աստղագիտություն",
    //   color: "#77aad9",
    //   // lectures:["Աստղային էվոլյուցիան և աստղերի կյանքի ցիկլը","Գալակտիկաներ, սև խոռոչներ և տիեզերագիտություն","Գրավիտացիոն ալիքներ և մութ նյութի որոնում","Քաղաքացիական գիտական նախագծեր աստղագիտության մեջ","Հարցաշար"],
    //   lectures: JSON.stringify([
    //     {
    //       color: "#adcce9",
    //       text: "● Աստղային էվոլյուցիան և աստղերի կյանքի ցիկլը",
    //     },
    //     {
    //       color: "#77aad9",
    //       text: "● Գալակտիկաներ, սև խոռոչներ և տիեզերագիտություն",
    //     },
    //     {
    //       color: "#4c7397",
    //       text: "● Գրավիտացիոն ալիքներ և մութ նյութի որոնում",
    //     },
    //     {
    //       color: "#4c7397",
    //       text: "● Քաղաքացիական գիտական նախագծեր աստղագիտության մեջ",
    //     },
    //     {
    //       color: "#425465",
    //       text: "Հարցաշար",
    //     },
    //   ]),
    //   created_at: new Date().toISOString(),
    // },
    // {
    //   icon: `${URL_IMAGES}/Les8.png`,
    //   ikonka: `${URL_IMAGES}/propeller.jpg`,
    //   background: `${URL_IMAGES}/giphy.gif`,
    //   title: "Դաս 8. Կարիերա տիեզերական արդյունաբերության մեջ",
    //   color: "#adcce9",
    //   // lectures:["Կարիերա տիեզերքին առնչվող ոլորտներում","Ինժեներություն, աստղաֆիզիկա և մոլորակագիտություն","Տիեզերական արդյունաբերության ստարտափներ և ձեռներեցություն","Ցանցի և մենթորության հնարավորություններ","Հարցաշար"],
    //   lectures: JSON.stringify([
    //     {
    //       color: "#adcce9",
    //       text: "● Կարիերա տիեզերքին առնչվող ոլորտներում",
    //     },
    //     {
    //       color: "#77aad9",
    //       text: "● Ինժեներություն, աստղաֆիզիկա և մոլորակագիտություն",
    //     },
    //     {
    //       color: "#4c7397",
    //       text: "● Տիեզերական արդյունաբերության ստարտափներ և ձեռներեցություն",
    //     },
    //     {
    //       color: "#4c7397",
    //       text: "● Ցանցի և մենթորության հնարավորություններ",
    //     },
    //     {
    //       color: "#425465",
    //       text: "Հարցաշար",
    //     },
    //   ]),
    //   created_at: new Date().toISOString(),
    // },
  ]);

  await pg("topics").insert([

    // LESSON 1

    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      lectures: `Տիեզերքի հետազոտման պատմական ակնարկ կարևորագույն իրադարձությունների պատմական ակնարկ`,
      text1: `Տիեզերքի հետազոտման նշանակալի իրադարձությունները՝ առաջին արբանյակից մինչև
      լուսնի վայրէջք և դրանից դուրս:`,
      image: `${URL_IMAGES}/lesson1_1.jpg`,
      text_arr: [`1957 թվականի հոկտեմբերի 4. Sputnik 1 - Խորհրդային Միությունը տիեզերք արձակեց
      առաջին արհեստական արբանյակը՝ Sputnik 1: Այն նշանավորում է Տիեզերական
      դարաշրջանի սկիզբը և սկսում է Տիեզերական մրցավազքը Միացյալ Նահանգների և
      Խորհրդային Միության միջև:`,
      `   1961 թվականի ապրիլի 12. Յուրի Գագարինի տիեզերական թռիչքը
      - Յուրի Գագարինը դառնում է առաջին մարդը, ով պտտվում է Երկրի շուրջը Վոստոկ 1 խորհրդային
      տիեզերանավով: Այս պատմական նշաձողը ցույց է տալիս մարդու տիեզերական
      ճանապարհորդության իրագործելիությունը:`,
      `   1961թ. մայիսի 5. Ալան Շեպարդի ենթաօրբիտալ թռիչքը. Ալան Շեպարդը դառնում է
      առաջին ամերիկացին, ով ճանապարհորդում է տիեզերք Freedom 7-ով:`,
      `     Փետրվարի 20, 1962. Ջոն Գլենի ուղեծրային թռիչքը. Ջոն Գլենը դառնում է առաջին
      ամերիկացին, ով պտտվում է Երկրի շուրջ Friendship 7 տիեզերական պարկուճով: Նրաթռիչքը տևում է մոտ հինգ ժամ, ինչը հետագայում նպաստում է մարդու տիեզերքի
      հետազոտմանը:`,
      `    1969 թվականի հուլիսի 20. Apollo 11 Լուսնի վայրէջք
      - Նիլ Արմսթրոնգը և Բազ Օլդրինը
      դառնում են առաջին մարդիկ, ովքեր ոտք են դնում Լուսնի վրա Apollo 11 առաքելության
      ընթացքում: Արմսթրոնգի հայտնի խոսքերը՝ «Դա մեկ փոքր քայլ է մարդու համար, մեկ
      հսկա թռիչք մարդկության համար», նշանավորվում է մարդկային նվաճումների զգալի
      իրադարձություն:`,
      `1970 թվականի նոյեմբերի 17. Luna 17 և Lunokhod 1 - Խորհրդային Միությունը
      հաջողությամբ վայրէջք է կատարում Լունա 17-ը Լուսնի վրա՝ կրելով Lunokhod 1 ռոբոտը:
      Այն դառնում է ռովերի առաջին հաջող տեղակայումը մեկ այլ երկնային մարմնի վրա:`,
      `1981 թվականի ապրիլի 12. Տիեզերական Շաթլ Կոլումբիա - Միացյալ Նահանգները
      գործարկում է առաջին տրանսպորտային տիեզերանավը՝ Կոլումբիա: Space Shuttle
      ծրագիրը հեղափոխում է տիեզերական ճանապարհորդությունը բազմակի օգտագործման
      տիեզերանավերով:`,
      `Նոյեմբերի 20, 1998. Միջազգային տիեզերական կայանը (ՄՏԿ) - ISS-ի առաջին
      բաղադրիչը՝ Զարյա, տիեզերք է ուղարկվել: Տարիների ընթացքում բազմաթիվ երկրներ
      համագործակցեցին ISS-ի հավաքման համար՝ ապահովելով երկարաժամկետ բնակելի
      տիեզերական միջավայր հետազոտությունների և միջազգային համագործակցության
      համար:`,
      `Հունվարի 14, 2005. Հյուգենսի զոնդ Տիտանի վրա. Եվրոպական տիեզերական
      գործակալության «Հյուգենս» զոնդը հաջողությամբ վայրէջք է կատարում Սատուրնի
      արբանյակի՝ Տիտանի վրա՝ տրամադրելով արժեքավոր տվյալներ նրա մթնոլորտի և
      մակերեսի մասին:`,
      `Օգոստոսի 6, 2012. Curiosity Rover-ը Մարսի վրա. ՆԱՍԱ-ի Curiosity մարսագնացը վայրէջք
      է կատարում Մարսի վրա՝ ձեռնամուխ լինելով մոլորակի երկրաբանությունը
      ուսումնասիրելու և անցյալ կամ ներկա մանրէաբանական կյանքի նշաններ փնտրելու
      առաքելությանը:`,

      `Փետրվարի 18, 2021. Mars Perseverance Rover - NASA-ի Perseverance մարսագնացը
      վայրէջք է կատարում Մարսի վրա՝ հագեցած առաջադեմ սարքերով՝ մոլորակի
      երկրաբանությունն ուսումնասիրելու, հնագույն կյանքի նշաններ որոնելու և ապագա
      մարդկային հետազոտմանը նախապատրաստվելու համար:`],
      button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
      slides: [
        `${URL_SLIDES}/lesson1_1.jpg`,
        `${URL_SLIDES}/lesson1_2.jpg`,
        `${URL_SLIDES}/lesson1_3.jpg`,
        `${URL_SLIDES}/lesson1_4.jpg`,
        `${URL_SLIDES}/lesson1_5.jpg`,
        `${URL_SLIDES}/lesson1_6.jpg`,
        `${URL_SLIDES}/lesson1_7.jpg`,
        `${URL_SLIDES}/lesson1_8.jpg`,
        `${URL_SLIDES}/lesson1_9.jpg`,
        `${URL_SLIDES}/lesson1_10.jpg`,
        `${URL_SLIDES}/lesson1_11.jpg`,
        `${URL_SLIDES}/lesson1_12.jpg`,
      ],
     
      created_at: new Date().toISOString(),
    },

    {
      lesson: `Դաս 1. Տիեզերական հետազոտության ներածություն`,
      lectures: `Տիեզերական մրցավազքը և դրա ազդեցությունը`,
      text1: `Տիեզերական մրցավազքը վերաբերում է Սառը պատերազմի ժամանակաշրջանում
      Միացյալ Նահանգների և Խորհրդային Միության միջև մրցակցությանը տիեզերքի
      հետազոտման մեջ նշանակալի նվաճումների հասնելու համար: Այն մեծ ազդեցություն
      ունեցավ տեխնոլոգիայի, քաղաքականության և հասարակության վրա:`,
      image: `${URL_IMAGES}/lesson2_2.png`,
      text2:`Ահա Տիեզերական մրցավազքի մի քանի հիմնական ասպեկտներ և դրա ազդեցությունը.`,
      text_arr_margin:[`
      1. Տեխնոլոգիական առաջընթացներ. Միացյալ Նահանգների և Խորհրդային
      Միության միջև ինտենսիվ մրցակցությունը արագացրեց առաջընթացը հրթիռային,
      տիեզերանավերի և տիեզերական այլ տեխնոլոգիաների ոլորտում: Երկու երկրներն
      էլ զգալի առաջընթաց գրանցեցին ավելի հզոր հրթիռների ստեղծման,
      նավիգացիոն համակարգերի կատարելագործման և առաջադեմ տիեզերանավերի
      ստեղծման գործում:
      Այս տեխնոլոգիական մղումը հանգեցրեց
      նորարարությունների, որոնք լայնածավալ կիրառություն են ունեցել տարբեր
      ոլորտներում, ներառյալ հեռահաղորդակցությունը, արբանյակային
      տեխնոլոգիաները և նյութերի գիտությունը:`,

      `2. Լուսնի վայրէջք. Լուսինը դարձավ Տիեզերական մրցավազքի հիմնական կենտրոնը:
      Միացյալ Նահանգները մեծ հաղթանակի հասավ, երբ 1969 թվականին Ապոլոն 11-ը
      հաջողությամբ վայրէջք կատարեց տիեզերագնացներ Նիլ Արմսթրոնգին և Բազ
      Օլդրինին լուսնի մակերևույթի վրա:`,
      `3. Ազգային հպարտություն և հեղինակություն. Տիեզերական մրցավազքը սնվում էր
      ազգային հպարտության զգացումով և համաշխարհային գերակայության
      ձգտումով: Ե՛վ Միացյալ Նահանգները, և՛ Խորհրդային Միությունը տիեզերքի
      հետախուզումը համարում էին իրենց տեխնոլոգիական և գաղափարական
      գերազանցությունը ցուցադրելու միջոց: Յուրաքանչյուր հաջող առաքելություն
      դիտվում էր որպես ազգային հեղինակության խորհրդանիշ, որը տանում էր դեպի
      հանրային տոնակատարություններ և ամրապնդում ազգային բարոյականությունը:`,
     ` 4. Քաղաքական հետևանքներ. Տիեզերական մրցավազքը զգալի քաղաքական
      հետևանքներ ուներ, քանի որ այն միահյուսված էր Միացյալ Նահանգների և
      Խորհրդային Միության միջև սառը պատերազմի ավելի մեծ մրցակցության հետ:
      Տիեզերական գերակայության համար մրցակցությունը արտացոլում էր ժամանակի
      ավելի լայն գաղափարական և աշխարհաքաղաքական լարվածությունը: Միացյալ
      Նահանգները տիեզերքի հետախուզումը դիտում էր որպես կապիտալիզմի և
      ժողովրդավարության գերազանցությունը ցույց տալու միջոց, մինչդեռ
      Խորհրդային Միությունը դա համարում էր սոցիալիզմի և կոմունիզմի ուժի
      ցուցադրություն:`,
      `5. Գիտական հայտնագործություններ. Տիեզերական մրցավազքի ընթացքում
      իրականացված առաքելությունները հանգեցրին նշանակալի գիտական
      հայտնագործությունների: Լուսնի առաքելությունները արժեքավոր տվյալներ
      տվեցին Լուսնի երկրաբանության մասին, մինչդեռ ռոբոտային առաքելությունները
      դեպի այլ մոլորակներ ընդլայնեցին Արեգակնային համակարգի մասին մեր
      պատկերացումները:
      Այս ժամանակահատվածում կատարված
      հետազոտությունները հիմք դրեցին հետագա գիտական հետախուզման համար և
      խորացրին տիեզերքի և երկնային մարմինների մասին մեր գիտելիքները:`,
      `6. Խաղաղ համագործակցություն. Թեև տիեզերական մրցավազքը նշանավորվեց
      ինտենսիվ մրցակցությամբ, այն նաև նպաստեց միջազգային
      համագործակցության որոշ դեպքերի: Ապոլոն-Սոյուզ փորձարկման նախագիծը
      1975թ.-ին, օրինակ, տեսավ, որ Միացյալ Նահանգները և Խորհրդային Միությունը
      համագործակցեցին համատեղ տիեզերական առաքելության վրա: Սա առաջին
      անգամն էր, երբ ամերիկյան և խորհրդային տիեզերանավերը տեղակայվեցին
      տիեզերքում՝ խորհրդանշելով լարվածության հալեցումը և ապագա միջազգային
      տիեզերական համագործակցության ուղիների բացումը:`,
      `7. Կրթական և մշակութային ազդեցություն. Տիեզերական մրցավազքը գրավեց
      ամբողջ աշխարհի մարդկանց երևակայությունը՝ ոգեշնչելով գիտնականների,
      ինժեներների և տիեզերագնացների սերնդին: Այն մեծ հետաքրքրություն
      առաջացրեց գիտության և տեխնոլոգիայի նկատմամբ՝ հանգեցնելով STEM
      կրթության և հետազոտությունների առաջընթացին: Տիեզերական մրցավազքը
      նաև ազդեց ժողովրդական մշակույթի վրա՝ տիեզերական թեմաներով ֆիլմերով,գրքերով և հեռուստատեսային շոուներով, որոնք գրավեցին հանդիսատեսին և
      ձևավորեցին հավաքական երևակայությունը:`],
      button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
      created_at: new Date().toISOString(),
    },
   
    {
      lesson: `Դաս 1. Տիեզերական հետազոտության ներածություն`,
      lectures: `Տիեզերական հետազոտության հեռանկարները ներկայիս միտումները և ապագա հեռանկարները`,
      text1:`Տիեզերական հետազոտության ներկայիս միտումներն ու ապագա հեռանկարները
      հետաքրքիր են և մեծ ներուժ ունեն հետագա առաջընթացի համար: Ահա մի քանի
      հիմնական միտումներ և հեռանկարներ ոլորտում.`,
      image: `${URL_IMAGES}/lesson3_3.jpg`,

      text_arr_margin: [`
      1. Առևտրային տիեզերական արդյունաբերություն. Մի նշանավոր միտում է
      առևտրային տիեզերական արդյունաբերության արագ աճը: Մասնավոր
      ընկերությունները, ինչպիսիք են SpaceX-ը, Blue Origin-ը և Virgin Galactic-ը, զգալի
      առաջընթաց են գրանցում բազմակի օգտագործման հրթիռների, արբանյակների
      տեղակայման և տիեզերական զբոսաշրջության զարգացման գործում: Մասնավոր
      հատվածի ներգրավվածությունը խթանում է նորարարությունը, նվազեցնում է
      ծախսերը և մեծացնում մուտքը տիեզերք:`,

     ` 2. Լուսնի հետախուզում. Նոր հետաքրքրություն կա Լուսնի ուսումնասիրության
      նկատմամբ, քանի որ տարբեր տիեզերական գործակալություններ և մասնավոր
      ընկերություններ ծրագրում են առաքելություններ՝ մարդկանց լուսնային մակերես
      վերադարձնելու համար: ՆԱՍԱ-ի Արտեմիս ծրագիրը նպատակ ունի մինչև 2024
      թվականը Լուսնի վրա կայուն ներկայություն հաստատել՝ կենտրոնանալով
      գիտական հետազոտությունների, ռեսուրսների օգտագործման և դեպի Մարս
      ապագա անձնակազմի առաքելությունների նախապատրաստման վրա:`,

      `3. Մարսի հետախուզում. Մարսը մնում է հետազոտության հիմնական թիրախը:
      Բազմաթիվ առաքելություններ են մեկնարկել՝ ուսումնասիրելու Մարսի մակերեսը,
      փնտրելու անցյալ կամ ներկա կյանքի նշանները և նախապատրաստվելու ապագա
      մարդկային առաքելություններին: ՆԱՍԱ-ի Perseverance մարսագնացը, օրինակ,
      ուսումնասիրում է Մարսի երկրաբանությունը և նմուշներ հավաքում Երկիր
      հնարավոր վերադարձի համար: Ապագա առաքելությունները նպատակ ունեն
      փորձարկել մարդկանց գաղութացման համար անհրաժեշտ տեխնոլոգիաները և
      գնահատել մոլորակի բնակելիությունը:`,

      `4. Միջազգային համագործակցություն. Տիեզերական հետազոտություններն ավելի ու
      ավելի են ներառում միջազգային համագործակցություն:
      Միջազգային տիեզերական կայանը (ՄՏԿ) ծառայում է որպես գլոբալ համագործակցության վառ
      օրինակ՝ տարբեր ազգերի հետ ռեսուրսների ներդրմամբ, հետազոտություններով և
      գիտական գիտելիքների փոխանակմամբ: Ապագա առաքելությունները, ինչպիսինէ Lunar Gateway-ը, նպատակ ունեն խթանել միջազգային համագործակցությունը
      լուսնի հետախուզման համար:`,

      `5. Միջմոլորակային առաքելություններ. Լուսնից և Մարսից այն կողմ, աճում է
      հետաքրքրությունը մեր արեգակնային համակարգի այլ ուղղություններ
      ուսումնասիրելու նկատմամբ: Նախատեսվում են առաքելություններ՝
      ուսումնասիրելու աստերոիդները, Յուպիտերի արբանյակը՝ Եվրոպան (որը կարող է
      օվկիանոս պահել իր սառցե մակերևույթի տակ), Սատուրնի արբանյակ
      Էնցելադուսը (իր պոտենցիալ ստորգետնյա ջրով) և նույնիսկ ավելի հեռու
      ուղղություններ, ինչպիսիք են Պլուտոնը և մեր արեգակնային համակարգի
      արտաքին տարածքները:`,

      `6. Տիեզերական աստղադիտակներ և աստղագիտություն. Տիեզերական
      աստղադիտակների առաջխաղացումները շարունակում են հեղափոխել տիեզերքի մեր պատկերացումները: Ջեյմս Ուեբ տիեզերական աստղադիտակի (JWST) նման
      նախագծերը, որոնք գործարկվելու են 2021 թվականին, խոստանում են
      աննախադեպ տեսարաններ ապահովել հեռավոր գալակտիկաների, մոլորակային
      համակարգերի և վաղ տիեզերքի մասին: Այս աստղադիտակները թույլ են տալիս
      բեկումնային հայտնագործություններ կատարել աստղաֆիզիկայի և տիեզերագիտության մեջ:`,
      `7. Տիեզերական ռեսուրսներ և կայունություն. Կայունության և երկարատև
      տիեզերական առաքելությունների համար տիեզերական ռեսուրսների
      օգտագործման հայեցակարգը լայն տարածում է գտել: Լուսնի և աստերոիդների
      վրա ջրային սառույցը կարող է օգտագործվել կյանքի պահպանման, վառելիքի
      արտադրության և տիեզերքում արտադրության համար: Տեղում ռեսուրսների
      օգտագործման (ISRU) տեխնոլոգիաների զարգացումը կարևոր նշանակություն
      ունի տիեզերքի կայուն հետախուզումը հնարավոր դարձնելու և Երկրի վրա
      հիմնված մատակարարումներից կախվածությունը նվազեցնելու համար:`,
      `8. Տիեզերական զբոսաշրջություն. տիեզերական զբոսաշրջության հեռանկարն
      իրականություն է դառնում: Virgin Galactic-ի և Blue Origin-ի նման
      ընկերություններն աշխատում են մասնավոր անձանց ենթաօրբիտալ տիեզերական
      թռիչքներ առաջարկելու ուղղությամբ: Այս ձևավորվող արդյունաբերությունը
      նպատակ ունի խաղաղ բնակիչներին հնարավորություն ընձեռել փորձելու
      տիեզերական ճանապարհորդություն և խթանել հանրային ներգրավվածությունը
      տիեզերքի հետախուզման մեջ:`],
      button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
      created_at: new Date().toISOString(),
    },

    {
      lesson: `Դաս 1. Տիեզերական հետազոտության ներածություն`,
      lectures: `Տիեզերական գործակալությունները և նրանց առաքելությունները`,
      text1: `Աշխարհի մի քանի տիեզերական գործակալություններ ակտիվորեն ներգրավված են
      տիեզերական հետազոտության և գիտական առաքելությունների մեջ:`,
      image: `${URL_IMAGES}/lesson4_4.png`,
      text2:` Ահա մի քանի նշանավոր տիեզերական գործակալություններ և նրանց նշանավոր
      առաքելությունները.`,
      text_arr_margin:[`
      1. Օդագնացության և տիեզերական տարածության ազգային վարչություն (NASA).
       Մարսի հետախուզական ծրագիր. NASA-ն Մարս է ուղարկել մի քանի
      մարսագնացներ, այդ թվում՝ Spirit, Opportunity, Curiosity և Perseverance
      մարսագնացների հաջող առաքելությունները, որոնք ուսումնասիրել են Մարսի
      մակերեսը, ուսումնասիրել նրա երկրաբանությունը և փնտրել անցյալ կամ ներկա
      կյանքի նշաններ:
       Hubble տիեզերական աստղադիտակ. NASA-ն արձակեց Hubble տիեզերական
      աստղադիտակը 1990 թվականին՝ հեղափոխելով տիեզերքի մեր ըմբռնումը և
      տրամադրելով հեռավոր գալակտիկաների, միգամածությունների և այլ երկնային
      օբյեկտների ապշեցուցիչ պատկերներ:
       Արտեմիս ծրագիր. NASA-ի Artemis ծրագիրը նպատակ ունի մարդկանց
      վերադարձնել Լուսին մինչև 2024 թվականը: Այն կենտրոնանում է Լուսնի կայուն
      հետախուզման, լուսնային դարպասի ստեղծման և դեպի Մարս անձնակազմով
      առաքելությունների նախապատրաստման վրա:
       «Վոյաջեր» ծրագիր. «Վոյաջեր 1» և «Վոյաջեր 2» տիեզերանավերը, որոնք
      գործարկվել են 1977 թվականին, ուսումնասիրեցին մեր արեգակնային
      համակարգի արտաքին մոլորակները և շարունակեցին իրենց
      ճանապարհորդությունը դեպի միջաստղային տարածություն՝ տրամադրելով
      արժեքավոր տվյալներ այս հեռավոր շրջանների մասին:`,
      `2. Ռուսաստանի տիեզերական գործակալություն (Ռոսկոսմոս).
       Միջազգային տիեզերական կայան (ISS). Roscosmos-ը առանցքային դեր է
      խաղացել ISS-ի՝ տիեզերքում բազմազգ հետազոտական լաբորատորիայի
      կառուցման և շահագործման մեջ, որը շարունակաբար օկուպացված է 2000
      թվականից:
       «Լունա» ծրագիր. «Ռոսկոսմոսը» Լունա ծրագրի շրջանակներում իրականացրել է
      մի շարք առաքելություններ դեպի Լուսին, ներառյալ ռոբոտային ռոբոտների հաջող
      վայրէջքը և լուսնային հողի նմուշների հավաքումը:`,
     ` 3. Եվրոպական տիեզերական գործակալություն (ESA).
       Rosetta Mission. ESA-ի Rosetta առաքելությունը հաջողությամբ տեղադրեց Philae
      կոչվող վայրէջքը 67P/Չուրյումով-Գերասիմենկո գիսաստղի մակերեսին
      տրամադրելով արժեքավոր տվյալներ գիսաստղերի և դրանց կազմի մասին:
       ExoMars ծրագիր. ESA-ն, համագործակցելով Roscosmos-ի հետ, մեկնարկեց
      ExoMars առաքելությունները՝ ուսումնասիրելու Մարսի միջավայրը, փնտրելու
      կյանքի նշաններ և հասկանալու մոլորակի երկրաբանությունն ու մթնոլորտը:`,
      `4. Չինաստանի տիեզերական տարածության ազգային վարչություն (CNSA).
       Chang'e ծրագիր. CNSA-ն իրականացրել է մի շարք առաքելություններ Chang'e
      ծրագրի շրջանակներում, ներառյալ լուսնային ուղեծրեր, վայրէջքներ և ռովերներ:
      Chang'e 4-ը դարձավ առաջին առաքելությունը, որը վայրէջք կատարեց Լուսնի
      հեռավոր կողմում, մինչդեռ Chang'e 5-ը հաջողությամբ վերադարձրեց լուսնային
      նմուշները Երկիր: Տյանչժոու առաքելություններ. CNSA-ի Տյանչժոու առաքելությունները
      կենտրոնացած են Չինաստանի տիեզերակայան բեռների մատակարարման վրա՝
      ցուցադրելով իրենց կարողությունները լոգիստիկայի և տիեզերակայանների
      գործունեության մեջ:`,
      `5. Հնդկական տիեզերական հետազոտությունների կազմակերպություն (ISRO).
       Chandrayaan ծրագիր. ISRO-ի Chandrayaan առաքելությունները ներառում են
      լուսնային ուղեծրեր և վայրէջքներ: Chandrayaan-1-ը հայտնաբերել է ջրի
      մոլեկուլներ Լուսնի մակերեսին, մինչդեռ Chandrayaan-2-ը փորձել է փափուկ
      վայրէջք կատարել Լուսնի մակերեսին:
       Mars Orbiter Mission. ISRO-ի Mars Orbiter Mission-ը, որը նաև հայտնի է որպես
      Mangalyaan, հաջողությամբ տիեզերանավ է տեղադրել Մարսի ուղեծրում՝
      դարձնելով Հնդկաստանը ասիական առաջին երկիրը, որը հասել է այս կարևոր
      կետին:`],
      button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
      created_at: new Date().toISOString(),
    },
  // LESSON 2
  {
    lesson: `Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս`,
    lectures: `Մոլորակների, նրանց արբանյակների և հիմնական հատկանիշների ակնարկ`,
    text1: `Մեր արեգակնային համակարգի յուրաքանչյուր մոլորակի հետաքրքրաշարժ առանձնահատկություններն ու բնութագրերը՝
    դրանց մթնոլորտի, արբանյակների և նշանակալի առաքելությունների հետ միասին.`,
    image: `${URL_IMAGES}/lesson-2.jpg`,
    text_arr: [`● Մերկուրի:
    - Առանձնահատկություններ. Մերկուրին Արեգակին ամենամոտ մոլորակն է և ունի քարքարոտ, մեծ խառնարաններով մակերես: Այն ունի նոսր մթնոլորտ, որը կոչվում
    է էկզոլորտ, որը բաղկացած է ատոմներից, որոնք պայթեցվել են նրա մակերեսի
    արևային քամուց: Այն զգում է ջերմաստիճանի ծայրահեղ տատանումներ՝ սկսած
    ցերեկը չափազանց շոգից մինչև գիշերը ծայրահեղ ցուրտ:
    - Լուսիններ. Մերկուրին արբանյակներ չունի:
    - Հատկանշական առաքելություններ. NASA-ի Mariner 10 առաքելությունը
    (1974-1975) տրամադրեց Մերկուրիի առաջին մոտիկից պատկերները: MESSENGER
    առաքելությունը (2004-2015) մանրամասն ուսումնասիրել է Մերկուրին՝
    արժեքավոր պատկերացումներ տալով նրա երկրաբանության, մագնիսական
    դաշտի և մակերեսի կազմի վերաբերյալ:`,
    `${URL_GIF}/gif2_1.gif`,
    `● Վեներա:
    - Առանձնահատկություններ. Վեներան հաճախ անվանում են Երկրի «քույր
    մոլորակ»՝ իր նման չափերի և կազմի պատճառով: Այն ունի թանձր մթնոլորտ, որը
    հիմնականում բաղկացած է ածխաթթու գազից՝ ծծմբաթթվի ամպերով։ Ինտենսիվ ջերմոցային էֆեկտը հանգեցնում է
    մակերևույթի չափազանց բարձր
    ջերմաստիճանի, ինչը Վեներան դարձնում է մեր արեգակնային համակարգի
    ամենաթեժ մոլորակը:
    - Լուսիններ. Վեներան արբանյակներ չունի:
    - Հատկանշական առաքելություններ. Բազմաթիվ առաքելություններ են
    ուսումնասիրել Վեներան, ներառյալ ՆԱՍԱ-ի Մարիներ 2-ը (1962), Խորհրդային
    Միության Venera ծրագիրը (1961-1984), իսկ վերջերս՝ Եվրոպական տիեզերական
    գործակալության Venus Express-ը (2005-2014): Այս առաքելությունները
    արժեքավոր տվյալներ են տվել Վեներայի մթնոլորտի, մակերեսի և
    երկրաբանության վերաբերյալ։`,
    `${URL_GIF}/gif2_2.gif`,
    `● Երկիր:
    - Առանձնահատկություններ. Երկիրը Արեգակից երրորդ մոլորակն է և միակ հայտնի
    մոլորակն է, որն աջակցում է կյանքի տարբեր ձևերի: Այն ունի ազոտով թթվածնով
    հարուստ մթնոլորտ, որը կենսական նշանակություն ունի կյանքի պահպանման
    համար: Երկրի մակերեսը 71%-ով ծածկված է օվկիանոսներով, և այն ունի դինամիկ
    երկրաբանություն՝ տեկտոնական թիթեղների շարժումներով, լեռներով և տարբեր
    հողային ձևերով։
    - Լուսին. Երկիրն ունի մեկ լուսին, որը կոչվում է Լուսին: Այն Արեգակնային
    համակարգի հինգերորդ ամենամեծ արբանյակն է և զգալի ազդեցություն ունի
    Երկրի մակընթացությունների վրա:
    - Հատկանշական առաքելություններ. Երկիրն ուսումնասիրելու մի քանի
          առաքելություններ են եղել, բայց ուշագրավները ներառում են արբանյակային
    առաքելություններ, ինչպիսիք են NASA-ի Terra, Aqua և Earth Observing System
    (EOS) արբանյակները, որոնք արժեքավոր տվյալներ են տրամադրում Երկրի
    մթնոլորտի, կլիմայի և էկոհամակարգերի վերաբերյալ:`,
    `${URL_GIF}/gif2_3.gif`,
    `● Մարս:
    - Առանձնահատկություններ. Մարսը, որը հաճախ կոչվում է «Կարմիր մոլորակ»,
    ունի բարակ մթնոլորտ, որը հիմնականում բաղկացած է ածխածնի երկօքսիդից:
    Այն ունի կարմրավուն տեսք՝ կապված իր մակերեսի երկաթի օքսիդի (ժանգի) հետ։
    Մարսն ունի բևեռային սառցե գլխարկներ, անցյալի հեղուկ ջրի ապացույցներ,
    հրաբուխներ, հովիտներ և ձորեր, ներառյալ Արեգակնային համակարգի ամենամեծ
    հրաբուխը՝ Օլիմպոս Մոնսը:-
    - Լուսիններ. Մարսն ունի երկու փոքր արբանյակ, որոնք կոչվում են Ֆոբոս և Դեյմոս:
    Նրանք ունեն անկանոն ձև և համարվում են գրավված աստերոիդներ:
    - Հատկանշական առաքելություններ. Բազմաթիվ առաքելություններ են
    ուսումնասիրել Մարսը, այդ թվում՝ ՆԱՍԱ-ի Viking ծրագիրը (1975-1982),
    մարսագնացները, ինչպիսիք են Sojourner, Spirit, Opportunity և Curiosity, իսկ
    վերջերս՝ Perseverance մարսագնացը (2020-ից մինչ այժմ): Այս առաքելությունները
    մանրամասն տվյալներ են տրամադրել Մարսի երկրաբանության, կլիմայի և
    անցյալ կամ ներկա կյանքի նշանների որոնումների վերաբերյալ:`,
    `${URL_GIF}/gif2_4.gif`,
    `● Յուպիտեր:
    - Առանձնահատկություններ.
    Յուպիտերը մեր արեգակնային համակարգի ամենամեծ մոլորակն է, որը հիմնականում բաղկացած է ջրածնից և հելիումից: Այն
    ունի առանձնահատուկ ժապավենային տեսք, որը նրա հզոր մթնոլորտային
    փոթորիկների և ռեակտիվ հոսքերի արդյունք է: Յուպիտերը հայտնի է իր Մեծ
    կարմիր կետով, հսկայական փոթորիկով, որը դիտվել է դարեր շարունակ:
    - Լուսիններ. Յուպիտերն ունի ավելի քան 79 հայտնի արբանյակներ, որոնցից չորսը
    հայտնի են որպես Գալիլեյան արբանյակներ՝ Իո, Եվրոպա, Գանիմեդ և Կալիստո:
    Նրանք աչքի են ընկնում իրենց բազմազան երկրաբանությամբ, ներառյալ ակտիվ
    հրաբուխները Իոյի վրա և հնարավոր ստորգետնյա օվկիանոսները Եվրոպայի վրա:
    - Նշանավոր առաքելություններ. ՆԱՍԱ-ի Գալիլեո առաքելությունը (1989-2003 թթ.)
    տրամադրեց Յուպիտերի և նրա արբանյակների մանրամասն դիտարկումները:
    Juno առաքելությունը (2011-ից մինչ օրս) ներկայումս ուսումնասիրում է
    Յուպիտերի մթնոլորտը, մագնիսական դաշտը և ներքին կառուցվածքը։`,
    `${URL_GIF}/gif2_5.gif`,
    `● Սատուրն:
    - Առանձնահատկություններ. Սատուրնը հայտնի է իր ապշեցուցիչ օղակների
    համակարգով, որը բաղկացած է անհամար սառցե մասնիկներից: Այն մեծությամբ
    երկրորդ մոլորակն է և հիմնականում կազմված է ջրածնից և հելիումից։ Սատուրնը
    իր հյուսիսային բևեռում ունի նշանավոր վեցանկյուն փոթորիկ, որը հայտնի է
    որպես Սատուրնյան վեցանկյուն:
    - Լուսիններ. Սատուրնն ունի ավելի քան 82 հայտնի արբանյակ: Տիտանը նրա
    ամենամեծ արբանյակը, առանձնահատուկ հետաքրքրություն է ներկայացնում իր
    խիտ մթնոլորտի, հեղուկ մեթանի լճերի և կյանքի համար անհրաժեշտ օրգանական
    քիմիայի հնարավորության պատճառով:
    - Հատկանշական առաքելություններ. NASA-ի Cassini առաքելությունը (1997-2017
    թթ.) տրամադրեց բազմաթիվ տվյալներ Սատուրնի, նրա օղակների և
    արբանյակների վերաբերյալ: «Հյուգենս» զոնդը, որը Cassini առաքելության մի
    մասն է, հաջողությամբ վայրէջք կատարեց Տիտանի մակերեսին 2005 թվականին՝
    տրամադրելով լուսնի առաջին պատկերներն ու տվյալները։`,
    `${URL_GIF}/gif2_6.gif`,
    `● Ուրան.
    - Առանձնահատկություններ. Ուրանը Արեգակից յոթերորդ մոլորակն է և եզակի է
    նրանով, որ թեքված է իր կողքին՝ իր պտտման առանցքով գրեթե զուգահեռ
    ուղեծրին: Այն ունի հիմնականում ջրածնի և հելիումի մթնոլորտ, մեթանի
    հետքերով, որոնք տալիս են կապտականաչավուն տեսք։
    - Լուսիններ. Ուրանն ունի 27 հայտնի արբանյակ, այդ թվում՝ Տիտանիան, Օբերոնը,
    Ումբրիելը, Արիելը և Միրանդան: Նրանք տարբերվում են չափերով և ունեն
    տարբեր մակերեսային առանձնահատկություններ:
    - Նշանավոր առաքելություններ. Ուրանը դեռևս չի այցելել հատուկ առաքելություն:
    Այնուամենայնիվ, ՆԱՍԱ-ի «Վոյաջեր 2» տիեզերանավը թռավ Ուրանի մոտով 1986
    թվականին՝ տրամադրելով արժեքավոր տվյալներ և մոտիկից պատկերներ
    մոլորակի և նրա արբանյակների մասին:`,
    `${URL_GIF}/gif2_7.gif`,
    `● Նեպտուն.
    - Առանձնահատկություններ. Նեպտունը Արեգակից ութերորդ մոլորակն է և իր
    կազմով նման է Ուրանին: Այն ունի խիտ մթնոլորտ, որը հիմնականում բաղկացած
    է ջրածնից, հելիումից և մեթանի հետքերից, ինչը նրան տալիս է մուգ կապույտ
    գույն։
    - Լուսիններ. Նեպտունն ունի 14 հայտնի արբանյակ, ներառյալ Տրիտոնը, որն
    Արեգակնային համակարգի մեծությամբ յոթերորդ արբանյակն է: Տրիտոնն աչքի է
    ընկնում իր հետընթաց ուղեծրով և ակտիվ գեյզերներով։
    - Նշանավոր առաքելություններ. Ինչպես Ուրանը, Նեպտունը նույնպես չի այցելել
    հատուկ առաքելություն: Այնուամենայնիվ, ՆԱՍԱ-ի «Վոյաջեր 2» տիեզերանավը
    նույնպես թռավ Նեպտունի մոտ 1989 թվականին՝ տրամադրելով մոտիկից
    դիտարկումներ և պատկերներ մոլորակի, նրա օղակների և արբանյակների մասին։`,
    `${URL_GIF}/gif2_8.gif`
  ],
    slides: [
      `${URL_SLIDES}/lesson2_1.jpg`,
      `${URL_SLIDES}/lesson2_2.jpg`,
      `${URL_SLIDES}/lesson2_3.jpg`,
      `${URL_SLIDES}/lesson2_4.jpg`,
      `${URL_SLIDES}/lesson2_5.jpg`,
      `${URL_SLIDES}/lesson2_6.jpg`,
      `${URL_SLIDES}/lesson2_7.jpg`,
      `${URL_SLIDES}/lesson2_8.jpg`,
      `${URL_SLIDES}/lesson2_9.jpg`,
    ],
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },
  {
    lesson: `Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս`,
    lectures: `Գաճաճ մոլորակներ, աստերոիդներ և գիսաստղեր`,
    text1: `Թզուկ մոլորակները, աստերոիդները և գիսաստղերը երեք տեսակի երկնային մարմիններ
    են, որոնք կարելի է գտնել մեր Արեգակնային համակարգում: Թեև նրանք կիսում են որոշ
    նմանություններ, նրանք ունեն նաև հստակ առանձնահատկություններ, որոնք
    առանձնացնում են միմյանցից:`,
    image: `${URL_IMAGES}/lesson_2.jpg`,
    text_arr: [`● Թզուկ մոլորակներ.`,
    `Թզուկ մոլորակները իրենց ձևով և կազմով նման են մոլորակներին, բայց չափերով ավելի
    փոքր են։ Նրանք գնդաձև են և ուղիղ պտտվում են Արեգակի շուրջ: Միջազգային
    աստղագիտական միությունը (ՄԱՄ) ներկայումս ճանաչում է մեր Արեգակնային
    համակարգի հինգ գաճաճ մոլորակներ՝ Պլուտոն, Էրիդա, Հաումեա, Մակեմակե և Ցերերա:
    Այս օբյեկտները գտնվում են Նեպտունի ուղեծրից այն կողմ՝ Կոյպերի գոտի (Պլուտոն,
    Էրիս, Հաումեա և Մակեմակե) կոչվող տարածաշրջանում կամ Մարսի և Յուպիտերի միջև
    գտնվող աստերոիդների գոտում (Ցերես):`,
    `${URL_GIF}/gif2_9.gif`,
    `● Աստերոիդներ:`,
    `Աստերոիդները քարքարոտ և մետաղական մարմիններ են, որոնք պտտվում են Արեգակի
    շուրջը։ Դրանք Արեգակնային համակարգի վաղ ձևավորման մնացորդներ են և
    հիմնականում հայտնաբերվել են աստերոիդների գոտում՝ Մարսի և Յուպիտերի
    ուղեծրերի միջև գտնվող տարածաշրջանում։ Աստերոիդները լինում են տարբեր չափերի՝
    փոքր ժայռերից մինչև մի քանի հարյուր կիլոմետր տրամագծով մեծ մարմիններ։Արեգակնային համակարգի ամենամեծ աստերոիդը Ցերերան է, որը նույնպես դասվում է
    գաճաճ մոլորակների շարքին։`,
    `${URL_GIF}/gif2_10.gif`,
    `● Գիսաստղեր:`,
    `Գիսաստղերը սառցե մարմիններ են՝ կազմված փոշուց, քարից և սառեցված գազերից,
    ինչպիսիք են ջուրը, ածխաթթու գազը, մեթանը և ամոնիակը։ Նրանք ունեն խիստ
    էլիպսաձեւ ուղեծրեր, որոնք կարող են դրանք Արեգակնային համակարգի արտաքին
    շրջաններից հասցնել Արեգակի մոտ գտնվող ավելի մոտ շրջաններ: Երբ գիսաստղը
    մոտենում է Արեգակին, ջերմությունը հանգեցնում է սառույցի գոլորշիացմանը՝
    ստեղծելով շիկացած կոմա (գազի և փոշու ամպ) միջուկի շուրջ և հաճախ ձևավորելով պոչ,
    որը ցույց է տալիս Արևից հեռու: Գիսաստղերը ծագում են երկու հիմնական շրջաններից՝
    Կոյպերի գոտուց և Օորտի ամպից, որոնք գտնվում են Նեպտունի ուղեծրից շատ հեռու։`,
    `${URL_GIF}/gif2_11.gif`,
  ],
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },
  {
    lesson: `Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս`,
    lectures: `Էկզոմոլորակներ և բնակելի աշխարհների որոնում`,
    text1: `Ուսումնասիրեք էկզոմոլորակների հայեցակարգը և դրանց հայտնաբերման համար
    օգտագործվող մեթոդները՝ շեշտը դնելով պոտենցիալ բնակելի աշխարհների որոնման
    վրա:
    Էկզոմոլորակները, որոնք նաև հայտնի են որպես արտաարեգակնային մոլորակներ,
    մոլորակներ են, որոնք պտտվում են այլ աստղերի շուրջ, բացի մեր Արևից:
    Էկզոմոլորակների հայտնաբերումն ու ուսումնասիրությունը հեղափոխել են տիեզերքի
    մեր պատկերացումները և մեր արեգակնային համակարգից դուրս բնակելի աշխարհների
    ներուժը: Ահա որոշ տեղեկություններ էկզոմոլորակների և բնակելի աշխարհների
    որոնման մասին.`,
    text_arr: [
    `${URL_GIF}/gif2_12.gif`,
    `Էկզոմոլորակների հայտնաբերում.`,
    `1. Էկզոմոլորակները հայտնաբերվում են տարբեր մեթոդներով, այդ թվում`,
    `ա. Ճառագայթային արագության մեթոդ. Այս մեթոդը հայտնաբերում է էկզոմոլորակները չափելով աստղի շարժման ժամանակ առաջացած փոքրիկ տատանումները պտտվող մոլորակի գրավիտացիոն ձգողության պատճառով:`,
    `բ. Տարանցման մեթոդ. Տարանցիկ մեթոդը հայտնաբերում է էկզոմոլորակները դիտելով
    աստղի պայծառության պարբերական թուլացումը, երբ մոլորակն անցնում է նրա
    դիմացից արգելափակելով աստղի լույսի մի մասը:`,
    `գ. Ուղղակի պատկերացում. Այս մեթոդը ներառում է էկզոմոլորակի լույսի ուղղակիորեն
    որսալը: Դա դժվար է ներգրավված հսկայական հեռավորությունների և ընդունող աստղի
    պայծառության պատճառով:`,
    `դ. Գրավիտացիոն միկրոոսպնյակություն. այս մեթոդը հայտնաբերում է
    էկզոմոլորակները՝ դիտարկելով ֆոնային աստղի լույսի թեթևակի ճկումը, որն առաջացել
    է մոլորակի և նրա ընդունող աստղի գրավիտացիոն ազդեցությամբ:`,
    `ե. Աստղաչափություն. Աստղաչափությունը չափում է աստղի դիրքի փոքրիկ
    տատանումները, որոնք առաջանում են ուղեծրով պտտվող մոլորակի գրավիտացիոն
    ձգողականությունից:`,
    `2. Բնակելի աշխարհներ.`,
    `Բնակելի աշխարհների որոնումը կենտրոնանում է էկզոմոլորակների հայտնաբերման
    վրա, որոնք կարող են պոտենցիալ ապրել այնպիսի կյանքով, ինչպիսին մենք գիտենք:
    Բնակելի աշխարհները հաճախ սահմանվում են որպես աստղի «բնակելի գոտու» մեջ
    գտնվող աշխարհներ, որոնք նաև հայտնի են որպես «Ոսկեգույն գոտի»: Դա աստղի շուրջ
    գտնվող շրջանն է, որտեղ պայմանները հարմար են մոլորակի մակերեսին հեղուկ ջրի
    գոյության համար, որը կարևոր բաղադրիչ է մեզ հայտնի կյանքի համար:`,
    `3. Kepler Mission.`,
    `2009 թվականին ՆԱՍԱ-ի կողմից արձակված Kepler տիեզերական աստղադիտակը
    առանցքային դեր է խաղացել հազարավոր էկզոմոլորակների հայտնաբերման գործում:
    Դրա հիմնական նպատակն էր որոշել Երկրի չափ էկզոմոլորակների հաճախականությունը
    աստղերի բնակելի գոտում կամ մոտակայքում: Կեպլերի դիտարկումները հանգեցրին
    բազմաթիվ պոտենցիալ բնակելի էկզոմոլորակների հայտնաբերմանը և արժեքավոր
    տվյալներ տվեցին հետագա հետախուզման համար։`,
    `4. Էկզոմոլորակների բնութագրում.`,
    `Գիտնականները տարբեր մեթոդներ են օգտագործում էկզոմոլորակները բնութագրելու
    համար, ներառյալ նրանց մթնոլորտը սպեկտրոսկոպիայի միջոցով վերլուծելը:
    Ուսումնասիրելով էկզոմոլորակների մթնոլորտի բաղադրությունը՝ գիտնականները
    կարող են փնտրել կենսական գազերի նշաններ, ինչպիսիք են թթվածինը, մեթանը և
    ջրային գոլորշին:`,
    `5. Ապագա առաքելություններ.`,
    `Բազմաթիվ տիեզերական առաքելություններ են նախատեսվում կամ իրականացվում
    էկզոմոլորակների ուսումնասիրությունն առաջ մղելու համար։ Դրանք ներառում են Ջեյմս
    Ուեբ տիեզերական աստղադիտակը (JWST), որը պետք է գործարկվի 2021 թվականին, որը
    կապահովի էկզոմոլորակների մթնոլորտի մանրամասն դիտարկումներ: Բացի այդ, 2018
    թվականին գործարկված Transiting Exoplanet Survey Satellite (TESS) առաքելությունը
    շարունակում է հայտնաբերել նոր էկզոմոլորակներ, այդ թվում՝ նրանց ընդունող
    աստղերի բնակելի գոտիներում:`
    ],
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },
  {
    lesson: `Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս`,
    lectures: `Վերջին հայտնագործություններն արեգակնային համակարգում ու առաքելությունները մեր արեգակնային համակարգում`,
    text1: `Ընդգծեք մեր Արեգակնային համակարգում կատարվող վերջին հայտնագործությունները
    և շարունակական առաքելությունները, ինչպիսիք են Juno առաքելությունը դեպի
    Յուպիտեր կամ New Horizons առաքելությունը դեպի Պլուտոն:`,
    text2: `Վերջին տարիներին մեր արեգակնային համակարգում մի քանի նշանավոր
    հայտնագործություններ և առաքելություններ են եղել: Ահա կարևորներից մի քանիսը.`,
    text_arr: [
    `1. Mars Perseverance Rover (2020).`,
    `ՆԱՍԱ-ի Perseverance մարսագնացը Մարսի վրա վայրէջք կատարեց 2021 թվականի
    փետրվարին: Նրա հիմնական առաքելությունն է փնտրել հնագույն մանրէաբանական
    կյանքի նշաններ, հավաքել ժայռերի նմուշներ Երկիր ապագա վերադարձի համար և
    ցուցադրել տեխնոլոգիաներ Մարսի ապագա մարդկանց հետախուզման համար: Ռովերը
    հագեցած է առաջադեմ գործիքներով, այդ թվում՝ տեսախցիկներով, սպեկտրոմետրերով և
    նմուշներ հավաքելու գայլիկոնով:`,
    `${URL_GIF}/gif2_13.gif`,
    `2. OSIRIS-REx (2018-2021):`,
    `OSIRIS-REx (Origins, Spectral Interpretation, Resource Identification, Security, Regolith
      Explorer) առաքելությունը NASA-ի կողմից 2018 թվականին հաջողությամբ հասել է Երկրի
      մոտակայքում գտնվող Բենու աստերոիդին: Այն մի քանի տարի է անցկացրել՝
      ուսումնասիրելով Բենուի կազմը, ձևը և ուղեծիրը, նախքան հոկտեմբերին նմուշ
      հավաքելը: 2020. Նմուշը Երկիր կվերադարձվի 2023 թվականին՝ արժեքավոր
      պատկերացումներ տալով վաղ Արեգակնային համակարգի և կյանքի ծագման մասին:`,
      `${URL_GIF}/gif2_14.gif`,
      `3. New Horizons(2015):`,
      `ՆԱՍԱ-ի ‘New Horizons’ տիեզերանավը 2015 թվականի հուլիսին իրականացրել է Պլուտոնի
      մոտ պատմական թռիչք՝ տրամադրելով այս հեռավոր գաճաճ մոլորակի առաջին
      մանրամասն պատկերներն ու տվյալները: Առաքելությունը բացահայտեց ցնցող
      երկրաբանական առանձնահատկություններ, ինչպիսիք են լեռները, հարթավայրերը և
      բարակ մթնոլորտը: New Horizons-ն այժմ շարունակում է իր ճանապարհորդությունը դեպի
      Կույպերի գոտի՝ ուսումնասիրելու մեկ այլ Կույպերի գոտու օբյեկտ (KBO)՝ Arrokoth
      անունով:`,
      `${URL_GIF}/gif2_15.gif`,
      ` 4. Juno (2016):`,
      `2011 թվականին ՆԱՍԱ-ի կողմից արձակված Juno տիեզերանավը Յուպիտեր հասավ 2016
      թվականի հուլիսին: Juno-ի հիմնական նպատակն է ուսումնասիրել Յուպիտերի կազմը,
      ձգողականությունը, մագնիսական դաշտը և բևեռային մագնիտոսֆերան: Այնաննախադեպ պատկերացումներ է տվել Յուպիտերի մթնոլորտի մասին՝ բացահայտելով
      նրա փոթորիկները, բևեռափայլերը և բարդ ամպերի նախշերը: Juno-ն նաև
      ուսումնասիրում է Յուպիտերի խորը ինտերիերը՝ հասկանալու նրա ձևավորումն ու
      էվոլյուցիան:`,
      `${URL_GIF}/gif2_16.gif`,
      ` 5. Cassini (1997-2017):`,
      `Չնայած առաքելությունն ավարտվել է թվականին, նրա Cassini 2017
      հայտնագործությունները շարունակում են խորը ազդեցություն ունենալ: Cassini-ը՝
      ՆԱՍԱ-ի, ESA-ի և Իտալիայի տիեզերական գործակալության համատեղ առաքելությունը,
      13 տարի է անցկացրել՝ ուսումնասիրելով Սատուրնը և նրա արբանյակները: Այն
      տրամադրեց Սատուրնի օղակների ցնցող պատկերներ, հայտնաբերեց նոր արբանյակներ,
      ուսումնասիրեց Սատուրնի արբանյակի Տիտանի ածխաջրածնային լճերը և դիտեց
      Էնցելադուս արբանյակից ժայթքող փետուրներ, որոնք ենթադրում են ստորգետնյա
      օվկիանոս:`,
      `${URL_GIF}/gif2_17.gif`
    ],
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },

  // LESSON 3
  {
    lesson: `Դաս 3. Հրթիռներ և շարժիչ համակարգեր`,
    lectures: `Հրթիռային շարժման սկզբունքները`,
    text1: `Հրթիռային շարժիչ ուժը հենվում է Նյուտոնի շարժման երրորդ օրենքի վրա, որն ասում է,
    որ յուրաքանչյուր գործողության համար կա հավասար և հակառակ ռեակցիա:`,
    image: `${URL_IMAGES}/das3_1.jpg`,
    text2: `Հրթիռային շարժման հիմնական սկզբունքները հետևյալն են.`,
    text_arr_margin:[
    `1. Նյուտոնի երրորդ օրենքը. Ինչպես նշվեց վերևում, հրթիռի շարժիչ ուժը հիմնված է
    Նյուտոնի երրորդ օրենքի վրա, որն ասում է, որ երբ հրթիռը մի ուղղությամբ
    արտանետում է բարձր արագությամբ արտանետվող գազեր, հրթիռի վրա
    հակառակ ուղղությամբ գործադրվում է հավասար և հակառակ ուժ՝ այն մղելով
    առաջ:`,
    `2. Իմպուլսի պահպանում. հրթիռային շարժիչը նույնպես ղեկավարվում է իմպուլսի
    պահպանման սկզբունքով: Համակարգի ընդհանուր իմպուլսը մնում է անփոփոխ,
    քանի դեռ դրա վրա չի գործում արտաքին ուժ: Երբ հրթիռը զանգված է արտաքսում
    մեծ արագությամբ, այն զգում է իմպուլսի հավասար և հակառակ փոփոխություն,
    ինչը հանգեցնում է հրթիռի առաջ արագացման:`,
    `3. Արտանետում. մղումն այն ուժն է, որն առաջ է մղում հրթիռը: Այն առաջանում է
    հրթիռի շարժիչներից գերարագ արտանետվող գազերի արտանետումից։ Շարժման
    մեծությունը կախված է արտանետվող գազերի զանգվածային հոսքի
    արագությունից և դրանց արտանետման արագությունից:`,
    `4. Շարժիչ: Հրթիռների համար անհրաժեշտ է շարժիչ, որը վառելիքի և օքսիդիչի
    համակցություն է: Վառելիքն ապահովում է էներգիան, մինչդեռ օքսիդիչը
    ապահովում է այրման համար անհրաժեշտ թթվածինը: Շարժիչը պահվում է
    հրթիռի բաքում և այրման ժամանակ դուրս է մղվում շարժիչի վարդակից:`,
    `5. Այրում. հրթիռային շարժիչները գործում են այրման գործընթացի միջոցով:
    Շարժիչը բռնկվում է այրման խցիկում, որտեղ այն ենթարկվում է քիմիական
    ռեակցիայի՝ ազատելով մեծ քանակությամբ էներգիա տաք, ընդարձակվող գազերի
    տեսքով։ Այս գործընթացը առաջացնում է բարձր ճնշում և ջերմաստիճան, որոնք
    ուղղվում են վարդակով արագացնելու գազերը և առաջացնում են մղում:`,
    `6. Վարդակի ձևավորում. Հրթիռի վարդակի ձևն ու ձևավորումը վճռորոշ դեր են
    խաղում հրթիռների շարժման մեջ: Վարդակները սովորաբար կոնաձև կամ
    զանգակաձև են: Դրանք նախագծված են արտանետվող գազերը ընդլայնելու մինչև
    գերձայնային արագություններ՝ մեծացնելով արտանետվող գազերի արագությունն
    ու թափը և առավելագույնի հասցնելով մղումը:`,
    `7. Հատուկ իմպուլս. Հատուկ իմպուլսը (Isp) հրթիռային շարժիչի արդյունավետության
    չափումն է: Այն ներկայացնում է սպառված շարժիչի մեկ միավորի համար
    արտադրվող մղման քանակությունը: Ավելի բարձր հատուկ իմպուլսային
    շարժիչներն ավելի արդյունավետ են և կարող են ավելի մեծ մղում ապահովել
    շարժիչի տվյալ քանակի համար:`,
    ],
    text_arr: [
      `Այս սկզբունքները կազմում են հրթիռների շարժման հիմքը և օգտագործվում են տարբեր
      հրթիռային համակարգերում, ներառյալ տիեզերական հետազոտության, արբանյակների
      արձակման և միջմոլորակային առաքելությունների համար:`,
      `Կարևոր է նաև Ցիոլկովսկու հրթիռների բանաձևը, որը նաև հայտնի է որպես Չայկովսկու
      բանաձև, մաթեմատիկական բանաձև է, որը կապում է հրթիռի արագության (Δv)
      փոփոխությունը նրա շարժիչ համակարգի արդյունավետ արտանետման արագության
      (Ve) և սկզբնական զանգվածի (m0) հարաբերակցության հետ, մինչև հրթիռի վերջնական
      զանգվածը (mf):`,
      `Բանաձևն արտահայտվում է հետևյալ կերպ.`,
      `Δv = Ve * ln(m0/mf):`,
      `Համակարգի արագությունը չի կարող գերազանցել հրթռի արագությանը։`,
      `Չայկովսկու բանաձևը մեծ նշանակություն ունի հրթիռային և տիեզերական
      հետազոտության ոլորտում։ Այն կարևոր պատկերացումներ է տալիս հրթիռային շարժիչ
      համակարգերի հիմնարար ֆիզիկայի և սահմանափակումների (ունենք հրթռի շարժիչի
      սահմանափակում) վերաբերյալ: Օգտագործելով բանաձևը, ինժեներներն ու
      գիտնականները կարող են վերլուծել հրթիռի կատարողական բնութագրերը, որոշել
      շարժիչի անհրաժեշտ քանակությունը արագության ցանկալի փոփոխության համար և
      օպտիմալացնել հրթիռային շարժիչների դիզայնն ու արդյունավետությունը:`,
      `Հրթիռի սահմանափակումները ներառում են ծանրաբեռնվածության հզորությունը,
      վառելիքի սահմանափակումները, ծախսերը, անվտանգության նկատառումները,
      սահմանափակ կրկնակի օգտագործման հնարավորությունը, շրջակա միջավայրի վրա
      ազդեցությունը, տեխնիկական բարդությունները և հեռավորությունը/ճանապարհորդությունը:`,
    ],
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },

  {
    lesson: `Դաս 3. Հրթիռներ և շարժիչ համակարգեր`,
    lectures: `Հրթիռային շարժիչների տեսակները և դրանց կիրառությունները`,
    text1: `Կան մի քանի տեսակի հրթիռային շարժիչներ, որոնք օգտագործվում են տարբեր
    ծրագրերում: Ահա որոշ ընդհանուր տեսակներ և դրանց կիրառությունները.`,
    text_arr_margin: [
    `1. Պինդ հրթիռային շարժիչներ.
    ● Նկարագրություն. Հրթիռային պինդ շարժիչներն օգտագործում են պինդ
    վառելիք, որը վառելիքի և օքսիդիչի խառնուրդ է: Շարժիչը գտնվում է պինդ
    վիճակում և այրվում է վերահսկվող եղանակով:
    ● Կիրառումներ. Հրթիռային պինդ շարժիչները սովորաբար օգտագործվում են
    տիեզերական արձակման մեքենաներում, ռազմական հրթիռներում,
    հրավառություններում և տարբեր հրթիռային մոդելներում: Նրանք
    ապահովում են բարձր շարժիչային ուժ և դիզայնի պարզություն, սակայն
    բացակայում է կրկնակի օգտագործման հնարավորությունը:`,
    `2. Հեղուկ հրթիռային շարժիչներ.
    ● Նկարագրություն. Հեղուկ հրթիռային շարժիչներն օգտագործում են հեղուկ
    շարժիչներ, սովորաբար հեղուկ վառելիք և հեղուկ օքսիդիչ: Շարժիչները
    պահվում են առանձին և միացվում և բռնկվում այրման խցիկում:
    ● Կիրառումներ. Հեղուկ հրթիռային շարժիչները օգտագործվում են
    տիեզերական արձակման տարբեր մեքենաներում, ինչպիսիք են SpaceX
    Falcon 9-ը և Atlas V-ը: Նրանք առաջարկում են լավ մղման կառավարում,
    կարող են խափանվել կամ անջատվել և հարմար են բազմակի
    օգտագործման համակարգերի համար:`,
    `3. Հիբրիդային հրթիռային շարժիչներ.
    ● Նկարագրություն. Հիբրիդային հրթիռային շարժիչները համատեղում են
    ինչպես պինդ, այնպես էլ հեղուկ հրթիռային շարժիչների
    առանձնահատկությունները: Նրանք օգտագործում են պինդ վառելիք և
    հեղուկ կամ գազային օքսիդիչ, որոնք սովորաբար պահվում են առանձին փուլերում:
    ● Կիրառումներ. Հիբրիդային հրթիռային շարժիչներն ունեն պոտենցիալ
    կիրառություն տիեզերական զբոսաշրջության, արբանյակների փոքր
    արձակման և փորձարարական հրթիռների մեջ: Նրանք առաջարկում են
    ինչպես պինդ, այնպես էլ հեղուկ համակարգերի որոշ առավելություններ,
    ինչպիսիք են պարզությունն ու անվտանգությունը:`,
    `4. Երկպրոպելանտ հրթիռային շարժիչներ.
    ● Նկարագրություն. երկպրոպելանտ հրթիռային շարժիչներն օգտագործում
    են երկու առանձին հեղուկ շարժիչներ՝ մեկը վառելիքի և մյուսը
    օքսիդացնողի համար:
    ● Կիրառումներ. երկպրոպելանտ շարժիչները լայնորեն օգտագործվում են
    տիեզերանավերի շարժիչ համակարգերում, ներառյալ արբանյակային
    շարժիչները, տիեզերական զոնդերը և միջմոլորակային
    առաքելությունները: Նրանք առաջարկում են լավ կատարողականություն և վերահսկելիություն:`,
    `5. Մոնոպրոպելանտ հրթիռային շարժիչներ.
    ● Նկարագրություն. Մոնոպրոպելանտ հրթիռային շարժիչներն օգտագործում
    են մեկ հեղուկ շարժիչ, սովորաբար բարձր ռեակտիվ քիմիական
    միացություն, ինչպիսին է հիդրազինը: Շարժիչը քայքայվում է կամ
    փոխազդում է կատալիզատորի հետ՝ առաջացնելով մղում:
    ● Կիրառումներ. Մոնոպրելեկտոր շարժիչները սովորաբար օգտագործվում են
    արբանյակների, տիեզերական զոնդերի և տիեզերանավերի վրա մանևրելու
    շարժիչ համակարգերում: Նրանք առաջարկում են պարզություն,
    կոմպակտություն և օգտագործման հեշտություն:`,
    `6. Էլեկտրական հրթիռային շարժիչներ.
    ● Նկարագրություն. Էլեկտրական հրթիռային շարժիչները, որոնք նաև
    հայտնի են որպես իոնային մղիչներ կամ էլեկտրական շարժիչ
    համակարգեր, օգտագործում են էլեկտրական դաշտեր կամ էլեկտրամագնիսական ուժեր՝ իոններ կամ այլ լիցքավորված մասնիկներ
    արագացնելու և արտաքսելու համար:
    ● Կիրառումներ. Էլեկտրական հրթիռային շարժիչներն օգտագործվում են
    երկարատև տիեզերական առաքելություններում, ինչպիսիք են խորը
    տիեզերական զոնդերը և արբանյակային կայաններ պահելը: Նրանք
    ապահովում են բարձր կոնկրետ իմպուլս, բայց ավելի ցածր մղում,
    համեմատած քիմիական հրթիռների հետ:`,
    ],
    slides: [
      `${URL_SLIDES}/lesson3_1.jpg`,
      `${URL_SLIDES}/lesson3_2.jpg`,
      `${URL_SLIDES}/lesson3_3.jpg`,
      `${URL_SLIDES}/lesson3_4.jpg`,
      `${URL_SLIDES}/lesson3_5.jpg`,
      `${URL_SLIDES}/lesson3_6.jpg`,
      `${URL_SLIDES}/lesson3_7.jpg`,
      `${URL_SLIDES}/lesson3_8.jpg`,
    ],
    text2:`Սրանք հրթիռային շարժիչների տեսակների մի քանի օրինակներ են, և կան այլ նմուշներ,
    որոնք օգտագործվում են հատուկ ծրագրերի համար: Շարժիչի յուրաքանչյուր տեսակ ունի
    իր առավելությունները, և դրանց ընտրությունը կախված է այնպիսի գործոններից,
    ինչպիսիք են առաքելության պահանջները, արժեքը, հուսալիությունը և ցանկալի
    կատարողական բնութագրերը:`,
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString()
  },
  {
    lesson: `Դաս 3. Հրթիռներ և շարժիչ համակարգեր`,
    lectures: `Հրթիռների նախագծում և օպտիմալացում`,
    text1: `Քննարկեք հրթիռների նախագծումը և օպտիմիզացումը, ներառյալ այնպիսի ասպեկտներ,
    ինչպիսիք են վառելիքի արդյունավետությունը, օգտակար բեռնվածքի հզորությունը:
    Հրթիռների նախագծումը և օպտիմալացումը ներառում են բազմամասնագիտական
    մոտեցում, որը միավորում է ճարտարագիտությունը, ֆիզիկան և մաթեմատիկան՝
    ստեղծելու արդյունավետ և բարձր արդյունավետությամբ հրթիռային համակարգեր:`,
    image: `${URL_IMAGES}/das3_2.jpg`,
    text2:`Ահա հրթիռների նախագծման և օպտիմալացման մի քանի հիմնական ասպեկտներ.
    պահանջները:`,
    text_arr_margin: [
    `1. Առաքելության պահանջները: Սա ներառում է ծանրաբեռնվածության
    հզորությունը, ցանկալի ուղեծիրը, հեռահարությունը և առաքելությանը հատուկ
    այլ գործոններ: Այս պահանջների ըմբռնումը շատ կարևոր է հրթիռի չափը,
    կատարողականությունը և հնարավորությունները որոշելու համար:`,
    `2. Կատարման պարամետրեր. Նախագծման գործընթացում պետք է հաշվի առնել
    կատարողականի մի քանի պարամետր: Դրանք ներառում են հատուկ իմպուլսի
    (Isp), մղման և քաշի հարաբերակցության, օգտակար բեռի մասնաբաժնի և դելտա-v
    (արագության փոփոխություն) պահանջները: Այս պարամետրերի օպտիմալացումը
    ապահովում է արդյունավետ շարժիչ ուժ և առավելագույնի հասցնում հրթիռի
    հնարավորությունները:`,
    `3. Կառուցվածքային նախագծում. Հրթիռային կառույցները պետք է նախագծվեն
    այնպես, որ դիմակայեն արձակման և թռիչքի ժամանակ առաջացած ծայրահեղ
    ուժերին: Սա ներառում է համապատասխան նյութերի ընտրություն, կրող
    կառույցների նախագծում և այնպիսի գործոնների դիտարկում, ինչպիսիք են քաշը,
    կառուցվածքի ամբողջականությունը և աերոդինամիկական կայունությունը:`,
    `4. Աերոդինամիկա. աերոդինամիկ ձևավորումը կարևոր դեր է խաղում հակահրթիռի
    դիմադրության նվազեցման և թռիչքի կատարողականի օպտիմալացման գործում:Հրթիռի ձևը,
    ներառյալ քթի կոնը և լողակները, պետք է մանրակրկիտ ձևավորված
    լինեն օդի դիմադրությունը նվազագույնի հասցնելու և կայունությունը բարելավելու համար:
    Հաշվողական հեղուկների դինամիկայի CFD)
    մոդելավորումները հաճախ օգտագործվում են աերոդինամիկ բնութագրերը
    օպտիմալացնելու համար:`,
    `Օպտիմալ աերոդինամիկ կատարման համար հրթիռի ձևը նախագծելիս հիմնական
    գործոնները, որոնք պետք է հաշվի առնել, ներառում են քթի կոնի ձևը, մարմնի
    տրամագիծը և լողակների ձևավորումը: Քթի հարթ կոնը նվազեցնում է
    դիմադրողականությունը, մինչդեռ մարմնի համապատասխան տրամագիծը և
    լողակները օգնում են պահպանել կայունությունը թռիչքի ընթացքում:`,
    `5. Շարժիչ համակարգ. Շարժիչ համակարգի ընտրությունը՝ լինի դա պինդ, հեղուկ,
    հիբրիդային կամ էլեկտրական, մեծապես ազդում է հրթիռի նախագծման վրա:
    Պետք է հաշվի առնել այնպիսի գործոններ, ինչպիսիք են մղումը, հատուկ
    իմպուլսը, վառելիքի արդյունավետությունը և գործառնական ճկունությունը:
    Շարժիչի կոնֆիգուրացիան, այրման խցիկի ձևավորումը, վարդակների ձևը և
    շարժիչի ընտրությունը նպաստում են շարժիչի համակարգի օպտիմալացմանը:`,
    `6. Զանգվածային օպտիմիզացում. Հրթիռի ընդհանուր զանգվածը նվազագույնի
    հասցնելը շատ կարևոր է ավելի բարձր կատարողականություն և
    արդյունավետություն ձեռք բերելու համար: Սա ներառում է կառուցվածքային
    բաղադրիչների նախագծման օպտիմալացում, թեթև նյութերի օգտագործում և
    արդյունավետ արտադրական տեխնիկայի ներդրում: Զանգվածի կրճատումը
    բարելավում է օգտակար բեռի բաժինը և թույլ է տալիս ավելի մեծ մանևրելու
    հնարավորություն:`,
    `7. Ջերմային կառավարում. հրթիռները շահագործման ընթացքում զգալի ջերմություն
    են առաջացնում, հատկապես այրման խցիկում և վարդակում: Ջերմային
    արդյունավետ կառավարումը կենսական նշանակություն ունի գերտաքացումից և
    կառուցվածքային վնասներից խուսափելու համար: Ջերմափոխադրումը
    օպտիմալացնելու և կառուցվածքային ամբողջականությունը պահպանելու համար
    օգտագործվում են հովացման համակարգեր, մեկուսիչ և ջերմապաշտպան նյութեր:`,
    `8. Կառավարման և ուղղորդման համակարգեր. Հրթիռները պահանջում են ճշգրիտ
    հսկողություն և ուղղորդում ցանկալի հետագիծը և առաքելության նպատակներին
    հասնելու համար: Կառավարման համակարգերի նախագծումը և ինտեգրումը,
    ներառյալ մղման վեկտորի կառավարումը, ռեակցիայի կառավարման
    համակարգերը և ուղղորդման ալգորիթմները, կարևոր են ճշգրիտ և կայուն թռիչքի
    հասնելու համար:`,
    `9. Անվտանգություն և հուսալիություն. հրթիռների նախագծումը պետք է
    առաջնահերթ լինի անվտանգության և հուսալիության համար: Սա ներառում է
    խիստ փորձարկում, ձախողման վերլուծություն, կրիտիկական համակարգերում
    ավելորդություն և խիստ ինժեներական ստանդարտների պահպանում:
    Հուսալիությունը հատկապես կարևոր է կառավարվող առաքելություններում և
    առևտրային գործարկման ծառայություններում:`,
    `10. Կրկնվող օպտիմիզացում. հրթիռների նախագծումը կրկնվող գործընթաց է, որը
    ներառում է շարունակական ճշգրտում և օպտիմալացում՝
    հիմնվածթեստավորման, սիմուլյացիաների և տվյալների վերլուծության վրա: Դիզայնի
    տարբեր պարամետրերը ճշգրտվում և գնահատվում են կատարողականը
    բարելավելու և առաքելության պահանջները բավարարելու համար:`],
    text3: `Ընդլայնված հաշվողական մոդելավորում, սիմուլյացիա և օպտիմալացման տեխնիկան
    լայնորեն օգտագործվում են հրթիռների նախագծման վերլուծության և
    կատարելագործման համար: Այս գործիքները ինժեներներին հնարավորություն են տալիս
    գնահատել դիզայնի բազմաթիվ կրկնությունները, օպտիմալացնել կատարումն ու
    արդյունավետությունը նախքան ֆիզիկական նախատիպերի ստեղծումը:`,
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },

  {
    lesson: `Դաս 3. Հրթիռներ և շարժիչ համակարգեր`,
    lectures: `Հրթիռային տեխնոլոգիայի ապագա զարգացումները`,
    text1: `Բացահայտեք հրթիռային տեխնոլոգիայի ֆուտուրիստական գաղափարները, ինչպիսիք
    են բազմակի օգտագործման հրթիռները և էլեկտրական շարժիչ համակարգերը:`,
    image: `${URL_IMAGES}/das3_3.jpg`,
    text2:`Հրթիռային տեխնոլոգիաների ոլորտը շարունակաբար զարգանում է, և սպասվում է, որ մի
    քանի ապագա զարգացումներ կձևավորեն տիեզերական հետազոտության և առևտրային
    տիեզերական թռիչքների ապագան: Ահա շարունակական հետազոտությունների և
    հրթիռային տեխնոլոգիայի հնարավոր առաջընթացի մի քանի ոլորտներ.`,
    text_arr_margin: [
    `1. Կրկնակի օգտագործման հրթիռներ. Կրկնակի օգտագործման հնարավորությունը
    զգալի ուշադրություն է գրավում հրթիռային տեխնոլոգիայում: SpaceX-ի Falcon 9-ը
    և Falcon Heavy-ը ցուցադրել են հաջող բազմակի օգտագործման հրթիռների փուլեր՝
    զգալիորեն նվազեցնելով արձակման ծախսերը: Ակնկալվում է, որ բազմակի
    օգտագործման հրթիռների տեխնոլոգիայի հետագա առաջընթացները, ինչպիսիք
    են արագ շրջադարձային ժամանակը և բարձր հուսալիությունը, կնվազեցնեն
    ծախսերը և հնարավորություն կտան ավելի հաճախակի տիեզերական
    առաքելություններին:`,
    `2. Ընդլայնված շարժիչ համակարգեր. հետազոտություններ են անցկացվում
    առաջադեմ շարժիչ համակարգերի վրա, որոնք կարող են առաջարկել ավելի բարձր
    արդյունավետություն և ավելի արագ ճանապարհորդություն: Օրինակները
    ներառում են իոնային շարժիչ, միջուկային շարժիչ և արևային առագաստներ: Այս
    տեխնոլոգիաները կարող են թույլ տալ ավելի արագ միջմոլորակային
    ճանապարհորդություն և նվազեցնել առաքելությունների տևողությունը:`,
    `3. Կանաչ շարժիչներ. Ավանդական հրթիռային շարժիչները հաճախ պարունակում
    են վտանգավոր և թունավոր նյութեր: Կանաչ շարժիչների մշակումը նպատակ ունի
    փոխարինել դրանք ավելի էկոլոգիապես մաքուր այլընտրանքներով: Կանաչ
    շարժիչներն առաջարկում են առավելություններ, ինչպիսիք են անվտանգության
    բարձրացումը, թունավորության նվազեցումը և բարելավված բեռնաթափումը:`,
    `4. Էլեկտրական շարժիչ. Էլեկտրական շարժիչ համակարգերը, ինչպիսիք են իոնային
    շարժիչները և Hall-ի էֆեկտի շարժիչները, ուշադրություն են գրավում երկարատև
    տիեզերական առաքելությունների համար: Այս համակարգերն ապահովում են
    բարձր կոնկրետ իմպուլս և իդեալական են այնպիսի ծրագրերի համար, ինչպիսիք
    են խոր տիեզերական զոնդերը և արբանյակային կայաններ պահելը:`,
    `5. Հավելումների արտադրություն. հավելումների արտադրությունը կամ 3D
    տպագրությունը հեղափոխություն է անում հրթիռների արտադրության մեջ: Այն
    թույլ է տալիս բարդ և օպտիմիզացված ձևավորումներ, նվազեցնում է
    արտադրության ծախսերը և հնարավորություն է տալիս արագ նախատիպեր
    պատրաստել: Հավելումների արտադրության տեխնիկայի և նյութերի շարունակական առաջընթացը կհանգեցնի հրթիռների նախագծման և
    արտադրության հետագա նորարարություններին:`,
    `6. In-Situ Resource Utilization (ISRU). ISRU-ն ներառում է երկնային մարմինների վրա
    հայտնաբերված ռեսուրսների օգտագործումը, ինչպիսիք են Լուսինը կամ Մարսը,
    հրթիռային շարժիչների արտադրության համար: Սա նվազեցնում է Երկրի վրա
    հիմնված շարժիչային վառելիքի մատակարարման անհրաժեշտությունը և բացում
    է տիեզերքում մարդու կայուն ներկայության հնարավորությունները:`,
    `7. Ընդլայնված նյութեր. թեթև և բարձր ամրության նյութերի մշակումը կարևոր
    նշանակություն ունի հրթիռների արդյունավետությունը բարելավելու համար:Ածխածնային կոմպոզիտները, կերամիկաները և այլ առաջադեմ նյութերը
    ուսումնասիրվում են քաշը նվազեցնելու, կառուցվածքի ամբողջականությունը
    բարձրացնելու և ծայրահեղ ջերմաստիճաններին դիմակայելու համար:`,
    `8. Առաջնորդման և նավիգացիայի առաջադեմ համակարգեր. ուղղորդման,
    նավիգացիայի և կառավարման համակարգերի առաջընթացը կբարձրացնի
    հրթիռների ճշգրտությունն ու ինքնավարությունը: Սա ներառում է հետագծի
    բարելավված օպտիմիզացում, ինքնավար վայրէջքի համակարգեր և ուժեղացված
    իրավիճակային իրազեկում:`,
    `9. Փոքր արբանյակների արձակման համակարգեր. փոքր արբանյակների արձակման
    պահանջարկը արագորեն աճում է: Արբանյակների արձակման հատուկ փոքր
    համակարգեր, ինչպիսիք են փոքր մասշտաբի վերօգտագործվող հրթիռները կամ
    օդային արձակման համակարգերը, մշակվում են՝ փոքր բեռների համար
    ծախսարդյունավետ և ճկուն մուտք դեպի տիեզերք ապահովելու համար:`,
    `10. Լուսնի և Մարսի հետախուզում. հրթիռային տեխնոլոգիայի ապագա զարգացումները պայմանավորված կլինեն Լուսնի և Մարսի վրա մարդկային
    կայուն ներկայություն հաստատելու նպատակով: Սա ներառում է անձնակազմով տիեզերանավերի,
    երկարաժամկետ կենսաապահովման համակարգերի և տրանսպորտային ճարտարապետության
    մշակում միջմոլորակային առաքելություններին աջակցելու համար:`],
    text3:`Սրանք հրթիռային տեխնոլոգիայի շարունակական հետազոտությունների և զարգացման
    մի քանի ոլորտներ են: Քանի որ արդյունաբերությունը զարգանում է, մենք կարող ենք
    ակնկալել հետագա առաջընթացներ, նորարարություններ և նոր կիրառություններ, որոնք
    կձևավորեն տիեզերական հետազոտության և առևտրային տիեզերական թռիչքների
    ապագան:`,
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },

  // LESSON 4

  {
    lesson: `Դաս 4. Տիեզերանավ և առաքելություններ`,
    lectures: `Տիեզերանավերի տեսակները և դրանց գործառույթները`,
    text1: `Արբանյակները տիեզերանավեր են, որոնք պտտվում են Երկրի կամ երկնային
    մարմինների շուրջ՝ մատուցելով տարբեր ծառայություններ, ինչպիսիք են կապը,
    եղանակի մոնիտորինը, նավիգացիան, գիտական հետազոտությունները և այլն:`,
    text2:`Ահա տիեզերանավերի մի քանի տարբեր տեսակներ, ներառյալ արբանյակները,
    տիեզերական մաքոքները և անձնակազմով խցիկները՝ իրենց գործառույթներով և
    հնարավորություններով:`,
    text_arr_margin: [
      `1.Արբանյակներ`,
      `Ներկայացրեք տիեզերանավերի տարբեր տեսակները, ներառյալ արբանյակները,
    տիեզերանավերը և անձնակազմով կապսուլները, և քննարկեք դրանց հատուկ
    գործառույթներն ու հնարավորությունները:`,
    `${URL_GIF}/gif4_1.gif`,
    `Դրանք կարելի է դասակարգել մի քանի տեսակների.`,
    `● Հաղորդակցման արբանյակներ. այս արբանյակները փոխանցում են ազդանշաններ հեռախոսի,
    հեռուստատեսության, ինտերնետի և այլ հաղորդակցման միջոցների:`,
    `${URL_IMAGES}/das4_1.jpg`,
    `Ահա կապի արբանյակների մի քանի հիմնական հատկանիշներ և գործառույթներ.`,
    `1. Ուղեծիր և ծածկույթ։ Կապի արբանյակները տեղադրվում են գեոստացիոնար
    ուղեծրում (GEO) կամ միջին Երկրի ուղեծրում (MEO)՝ ապահովելու որոշակի
    շրջանների կամ ամբողջ Երկրի շարունակական ծածկույթը: GEO արբանյակները
    պտտվում են մոտավորապես 36000 կիլոմետր բարձրության վրա՝ մնալով ֆիքսված
    Երկրի մակերեսի համեմատ՝ ապահովելով շարունակական ծածկույթ որոշակի
    աշխարհագրական տարածքի վրա: MEO արբանյակները տեղադրված են ավելի
    ցածր բարձրության վրա, ինչը նրանց հնարավորություն է տալիս ծածկել Երկրի
    մակերեսի ավելի մեծ տարածքներ:`,
    `2. Ազդանշանի ռելե (օգտագործվում է ազդանշանի միցաման կամ անջատման
    համար)։ Կապի արբանյակները ազդանշաններ են ստանում ցամաքային
    հաղորդիչներից և փոխանցում դրանք ցամաքային այլ ընդունիչներին: Այս
    ազդանշանները կարող են պարունակել տարբեր տեսակի հաղորդակցություններ,
    ներառյալ ձայնային, տվյալների, տեսանկարահանման և ինտերնետ
    ծառայություններ: Արբանյակը գործում է որպես կամուրջ ուղարկողի և ստացողի
    միջև՝ թույլ տալով հաղորդակցվել երկար հեռավորությունների վրա, ինչպիսիք են
    միջազգային զանգերը կամ համաշխարհային ինտերնետ կապը:`,
    `3. Բազմաթիվ հաղորդիչներ։ Կապի արբանյակները հագեցած են բազմաթիվ
    հաղորդիչներով, որոնք, ըստ էության, ռադիոհաղորդիչներ են, որոնք
    ազդանշաններ են ստանում մեկ հաճախականության գոտուց, ուժեղացնում դրանք
    և այնուհետև դրանք վերահաղորդում են Երկիր այլ հաճախականության
    տիրույթով: Յուրաքանչյուր հաղորդիչ (hեռահաղորդակցության մեջ հաղորդիչն
    այն սարքն է, որը ազդանշան ստանալուց հետո ի պատասխան այլ ազդանշան է
    արձակում) աշխատում է որոշակի հաճախականության տիրույթում, ինչը թույլ է
    տալիս միաժամանակ ստանալ մի քանի կապի ալիքներ:`,
    `4. Ճառագայթային ձևավորում. շատ ժամանակակից կապի արբանյակներ
    օգտագործում են առաջադեմ ալեհավաք համակարգեր և ճառագայթային
    ձևավորման տեխնիկա: Արբանյակի ազդանշանը կենտրոնացնելով Երկրի
    մակերևույթի որոշակի շրջաններում՝ ճառագայթային ձևավորումը թույլ է տալիս
    ավելի արդյունավետ օգտագործել արբանյակային ռեսուրսները և ապահովում է
    ավելի բարձր ազդանշանի ուժ և ավելի լավ որակ ծածկույթի տարածքում գտնվող
    օգտվողների համար:`,
    `5. Ծառայությունների բազմազանություն. Կապի արբանյակներն աջակցում են
    ծառայությունների լայն շրջանակ, ներառյալ հեռուստատեսային հեռարձակումը,
    ինտերնետ կապը, հեռախոսային հաղորդակցությունը, վիդեո կոնֆերանսը և
    տվյալների փոխանցումը բիզնեսների և կառավարությունների համար: Դրանքհնարավորություն են տալիս գլոբալ կապի հնարավորություն՝ կապելով մարդկանց
    հեռավոր վայրերում և հեշտացնելով միջազգային հաղորդակցությունը:`,
    `6. Միջարբանյակային կապեր. որոշ առաջադեմ կապի արբանյակային համակարգեր
    օգտագործում են միջարբանյակային կապեր (ISL)՝ արբանյակների միջև ուղիղ
    կապ հաստատելու համար: ISL-ները թույլ են տալիս տվյալների փոխանցում
    արբանյակների միջև՝ թույլ տալով ավելի արագ և արդյունավետ
    հաղորդակցություն, ինչպես նաև բարելավված համակարգի ճկունություն:`,
    `${URL_IMAGES}/das4_2.jpg`,
    `● Եղանակային արբանյակներ. նրանք վերահսկում են եղանակի օրինաչափությունները, հավաքում են մթնոլորտային տվյալներ և տրամադրում են պատկերներ, որոնք օգտագործվում են եղանակի կանխատեսման համար:`,
    `Ահա եղանակային արբանյակների մի քանի հիմնական առանձնահատկություններ և
    գործառույթներ.`,
    `1. Հեռահար զոնդավորում. Եղանակային արբանյակներն օգտագործում են տարբեր
    հեռահար զոնդավորման գործիքներ՝ տիեզերքից Երկրի մթնոլորտը դիտելու
    համար: Այս գործիքները ներառում են տեսանելի, ինֆրակարմիր և միկրոալիքայինտվիչներ (կարգավորիչ կամ կառավարիչ հարմարանքի տարր), որոնք չափում են
    մթնոլորտի տարբեր ասպեկտներ, ինչպիսիք են ամպի ծածկույթը, ջերմաստիճանը,
    խոնավությունը, տեղումները, քամու ձևերը և մթնոլորտի կազմը:`,
    `2. Պատկերների և տվյալների հավաքագրում. Եղանակային արբանյակները
    նկարահանում են Երկրի մակերեսի, ամպերի և եղանակային համակարգերի
    բարձրորակ պատկերներ և տվյալներ: Այս նկարները օդերևութաբաններին
    արժեքավոր տեղեկություններ են տալիս՝ հետևելու փոթորիկներին, վերահսկելու
    եղանակային պայմանները և ճշգրիտ եղանակի կանխատեսումներ կատարելու
    համար: Արբանյակները շարունակաբար ֆիքսում են պատկերներ և տվյալներ՝
    թույլ տալով գրեթե իրական ժամանակում վերահսկել եղանակային երևույթները:`,
    `3. Համաշխարհային ծածկույթ. Եղանակային արբանյակները տեղադրվում են
    գեոստացիոնար կամ բևեռային ուղեծրերում՝ համաշխարհային ծածկույթ
    ստանալու համար: Գեոստացիոնար եղանակային արբանյակները, որոնք
    տեղակայված են հասարակածից մոտավորապես 36000 կիլոմետր բարձրության
    վրա, ապահովում են որոշակի տարածաշրջանի շարունակական մոնիտորինգ,
    օրինակ՝ մայրցամաքի կամ օվկիանոսի: Բևեռային ուղեծրով արբանյակները
    բևեռից բևեռ պտտվում են Երկրի շուրջ՝ ապահովելով գլոբալ ծածկույթ՝
    յուրաքանչյուր ուղեծրի ընթացքում նկարահանելով ամբողջ մոլորակի պատկերները և տվյալները:`,
    `4. Եղանակի կանխատեսում և վերլուծություն. եղանակային արբանյակների կողմից
    հավաքագրված տվյալները, ցամաքային և օդային այլ դիտարկումների հետ
    միասին, օգտագործվում են եղանակային մոդելներ մշակելու և ապագա
    եղանակային պայմանները կանխատեսելու համար: Օդերեւութաբանները
    վերլուծում են արբանյակային պատկերները և տվյալները՝ հետևելու եղանակային
    համակարգերի շարժին, բացահայտելու մթնոլորտային օրինաչափությունները և
    կանխատեսելու փոթորիկների, փոթորիկների, ցիկլոնների և այլ եղանակային
    իրադարձությունների զարգացումը:`,
    `5. Եղանակի ծանր մոնիտորինգ. Եղանակային արբանյակները կարևոր դեր են
    խաղում եղանակային ծանր երևույթների մոնիտորինգի և հետևման գործում,
    ինչպիսիք են արևադարձային փոթորիկները, փոթորիկները, տորնադոները և
    ամպրոպները: Իրական ժամանակում պատկերներ և տվյալներ տրամադրելով՝
    արբանյակներն օգնում են վաղ հայտնաբերել, հետևել և կանխատեսել այս
    վտանգավոր եղանակային պայմանները՝ հնարավորություն տալով ժամանակին
    նախազգուշացումների և տարհանման միջոցառումների իրականացմանը:`,
    `6. Կլիմայի ուսումնասիրություններ. Եղանակային արբանյակների երկարաժամկետ
    դիտարկումները նպաստում են կլիմայի ուսումնասիրություններին և հետազոտություններին:
    Ջերմաստիճանի միտումների, ծովի սառույցի
    տարածության, ամպի ծածկույթի փոփոխության և կլիմայի հետ կապված այլ
    պարամետրերի վերաբերյալ տվյալներ հավաքելով՝ արբանյակներն օգնում ենգիտնականներին հասկանալ և վերահսկել կլիմայի օրինաչափությունները,
    բացահայտել կլիմայի փոփոխության ցուցանիշները և գնահատել մարդու
    գործունեության ազդեցությունը Երկրի կլիմայական համակարգի վրա:`,
    `Եղանակային արբանյակները զգալիորեն բարելավել են եղանակային օրինաչափությունները հասկանալու և կանխատեսելու մեր կարողությունը՝
    բարձրացնելով եղանակային ծանր իրադարձությունների մեր պատրաստվածությունը և
    հնարավորություն տալով ավելի ճշգրիտ եղանակային կանխատեսումներ անել:`,
    `● Նավիգացիոն արբանյակներ. Օրինակները ներառում են Գլոբալ դիրքորոշման
    համակարգ (GPS) արբանյակները, որոնք հնարավորություն են տալիս ճշգրիտ
    դիրքորոշման և նավիգացիայի Երկրի վրա:`,
    `${URL_GIF}/gif4_2.gif`,
    `Գլոբալ նավիգացիոն արբանյակային համակարգը (GNSS) նավիգացիոն արբանյակների
    գլոբալ ցանց է, որը հնարավորություն է տալիս ճշգրիտ դիրքավորել և ճանապարհորդել
    Երկրի վրա: Ամենահայտնի GNSS-ը Գլոբալ դիրքորոշման համակարգն է (GPS): Ահա
    նավիգացիոն արբանյակների մի քանի հիմնական հատկանիշներ և գործառույթներ.`,
    `1. Արբանյակային համաստեղություններ: Նավիգացիոն արբանյակները գործում են
    համաստեղություններում, որոնք բաղկացած են բազմաթիվ արբանյակներից,
    որոնք տեղակայված են Երկրի շուրջ հատուկ ուղեծրերում: Համաստեղության
    արբանյակները միասին աշխատում են՝ ապահովելու շարունակական ծածկույթ և
    ապահովելու, մի քանի արբանյակներ տեսանելի լինեն Երկրի մակերեսի
    ցանկացած կետից ցանկացած պահի:`,
    `2. Ճշգրիտ դիրքավորում. նավիգացիոն արբանյակներն օգտագործում են բարձր
    ճշգրիտ ատոմային ժամացույցներ և ազդանշաններ են փոխանցում, որոնք Երկրի
    վրա ստացողները կարող են օգտագործել իրենց ճշգրիտ դիրքը հաշվարկելու
    համար: Ստանալով ազդանշաններ մի քանի արբանյակներից, ստացողը կարող է
    որոշել իր լայնությունը, երկայնությունը, բարձրությունը և արագությունը մի
    գործընթացի միջոցով, որը կոչվում է եռալերացիա: Սա թույլ է տալիս
    օգտատերերին ճշգրիտ որոշել իրենց դիրքը Երկրի մակերեւույթի ցանկացած
    կետում:`,
    `3. Նավիգացիա և ճանապարհի որոնում. Նավիգացիոն արբանյակները օգտատերերին հնարավորություն են տալիս որոշել իրենց ուղղությունը և
    նավարկելու կոնկրետ ուղղություններ: Ճշգրիտ դիրքի տեղեկատվության շնորհիվ
    նավիգացիոն համակարգերը կարող են ապահովել հերթափոխ ուղղություններ,
    առաջարկել օպտիմալ երթուղիներ և հաշվարկել ժամանման գնահատված
    ժամանակը: Նավիգացիոն համակարգերը լայնորեն օգտագործվում են տարբեր
    ոլորտներում, ներառյալ ավիացիոն, ծովային, ավտոմոբիլային, գեոդեզիական և
    բացօթյա հանգստի գործունեությունը:`,
    `4. Ժամկետավորում և համաժամացում. նավիգացիոն արբանյակները տրամադրում
    են շատ ճշգրիտ ժամանակային ազդանշաններ, որոնք կարող են օգտագործվել
    համաժամացման նպատակներով: Ճշգրիտ ժամանակաչափումը չափազանց
    կարևոր է այնպիսի ծրագրերի համար, ինչպիսիք են հեռահաղորդակցությունը,
    ֆինանսական գործարքները, էլեկտրացանցերի համաժամացումը, գիտական
    փորձերը և ցանցի համաժամացումը տարբեր ոլորտների համար:`,
    `5. Multi-GNSS-ի համատեղելիություն. Բացի GPS-ից, կան նաև այլ գլոբալ
    նավիգացիոն արբանյակային համակարգեր, ներառյալ ռուսական GLONASS-ը,
    չինական BeiDou-ն և Եվրոպական միության Galileo-ն: Շատ ընդունիչներ
    նախագծված են մի քանի GNSS համակարգերի հետ համատեղելի լինելու համար՝
    թույլ տալով օգտվողներին միաժամանակ մուտք գործել բազմաթիվ
    համաստեղությունների ազդանշաններ: Սա բարելավում է դիրքավորման
    ճշգրտությունը, հասանելիությունը և հուսալիությունը, հատկապես կոնկրետ
    արբանյակների սահմանափակ տեսանելիությամբ տարածքներում:`,
    `6. Ընդլայնման համակարգեր. նավիգացիոն արբանյակները կարող են ընդլայնվել
    ցամաքային համակարգերի միջոցով՝ բարձրացնելու դրանց ճշգրտությունն ու
    հուսալիությունը: Ավելացման համակարգերն օգտագործում են լրացուցիչ
    ցամաքային կայաններ արբանյակային ազդանշանները վերահսկելու, սխալները
    կամ աղավաղումները շտկելու և այդ ուղղումները օգտվողներին հեռարձակելու
    համար: Օրինակները ներառում են Միացյալ Նահանգներում օգտագործվող Wide
    Area Augmentation System (WAAS) և Եվրոպայում օգտագործվող Եվրոպական
    գեոստացիոնար նավիգացիոն ծառայությունը (EGNOS):`,
    `Նավիգացիոն արբանյակները հեղափոխել են մեր ճանապարհորդելու և Երկրի վրա
    դիրքավորելու ձևը: Դրանք տրամադրում են ճշգրիտ, իրական ժամանակում տեղորոշման
    տեղեկատվություն, որն անփոխարինելի է դարձել բազմաթիվ ոլորտներում, ինչը
    հնարավորություն է տալիս ավելի անվտանգ և արդյունավետ փոխադրումներ
    իրականացնել, ճշգրիտ գեոդեզիոն և քարտեզագրում, անխափան հաղորդակցություն և
    համաժամացում, ինչպես նաև տեղորոշման վրա հիմնված ծառայությունների լայն
    շրջանակ:`,
    `● Գիտական արբանյակներ. Այս տիեզերանավերը համալրված են գիտական
    գործիքներով՝ տիեզերքի տարբեր ասպեկտներ ուսումնասիրելու համար, ինչպիսիք
    են տիեզերական աստղադիտակները, ինչպիսին է Hubble-ը կամ առաջիկայում
    Ջեյմս Ուեբ տիեզերական աստղադիտակը:`,
    `Ահա գիտական արբանյակների մի քանի հիմնական հատկանիշներ և գործառույթներ.`,
    `1. Հեռահար զոնդավորում և պատկերում. գիտական արբանյակները բարձր
    լուծաչափով պատկերներ և տվյալներ են ֆիքսում տարբեր սենսորների միջոցով,
    ներառյալ տեսախցիկները, սպեկտրոմետրերը և ռադարային համակարգերը: Այսսենսորներն օգնում են ուսումնասիրել Երկրի հողը, մթնոլորտը, օվկիանոսները,
    սառցե գլխարկները և բուսականությունը՝ արժեքավոր պատկերացումներ տալով
    կլիմայի փոփոխության, շրջակա միջավայրի մոնիտորինգի և բնական ռեսուրսների
    կառավարման վերաբերյալ:`,
    `2. Տիեզերական աստղադիտակներ. Տիեզերական աստղադիտակները գիտական
    արբանյակներ են, որոնք հագեցած են հզոր աստղադիտակային համակարգերով,
    որոնք դիտում են երկնային օբյեկտները Երկրի մթնոլորտից այն կողմ: Դրանք
    աստղագետներին հնարավորություն են տալիս աննախադեպ պարզությամբ և
    զգայունությամբ ուսումնասիրել հեռավոր գալակտիկաները, աստղերը,
    մոլորակները և այլ երկնային երևույթներ։ Օրինակները ներառում են Հաբլ
    տիեզերական աստղադիտակը, Չանդրայի ռենտգենյան աստղադիտարանը և
    առաջիկայում սպասվող Ջեյմս Ուեբ տիեզերական աստղադիտակը:`,
    `3. Աստղագիտական հետազոտություն. աստղագիտական հետազոտություններին
    նվիրված գիտական արբանյակները դիտում են լույսի տարբեր ալիքների
    երկարություններ, ներառյալ տեսանելի, ուլտրամանուշակագույն, ռենտգենյան և
    գամմա ճառագայթումը:
    Ուսումնասիրելով այս տարբեր ալիքների երկարությունները՝ աստղագետները կարող են ուսումնասիրել աստղերի,
    գալակտիկաների, սև խոռոչների, գերնոր աստղերի և տիեզերական այլ
    երևույթների հատկությունները՝ օգնելով բացահայտելու տիեզերքի առեղծվածները:`,
    `4. Երկրի համակարգի գիտություն. Գիտական արբանյակները վճռորոշ դեր են
    խաղում Երկրի համակարգի գիտության մեջ, որն ուսումնասիրում է մեր մոլորակի
    տարբեր բաղադրիչների փոխազդեցությունը, ներառյալ մթնոլորտը,
    հիդրոսֆերան, կենսոլորտը և երկրագնդը: Այս արբանյակները տրամադրում են
    տվյալներ կլիմայի օրինաչափությունների, եղանակի կանխատեսման, օվկիանոսի
    հոսանքների, սառցե ծածկույթի, մթնոլորտի կազմի և Երկրի համակարգի այլ
    պարամետրերի վերաբերյալ՝ օգնելով հասկանալ Երկրի գործընթացներն ու
    փոփոխությունները:`,
    `5. Մոլորակների հետազոտում.
    Արբանյակները, որոնք նախատեսված են մոլորակների հետազոտման համար, ուղարկվում են մեր Արեգակնային
    համակարգի այլ երկնային մարմինների հետազոտման համար, ինչպիսիք են
    մոլորակները, արբանյակները, աստերոիդները և գիսաստղերը:
    Այս առաքելությունները ներառում են ուղեծրեր, վայրէջքներ, ռովերներ և թռչող
    տիեզերանավեր, որոնք նկարներ են նկարահանում, վերլուծում մակերեսի կազմը,
    ուսումնասիրում երկրաբանական առանձնահատկությունները և փնտրում անցյալ
    կամ ներկա կյանքի նշաններ: Օրինակները ներառում են մարսագնացները,
    Վոյաջեր առաքելությունները և Cassini-Huygens առաքելությունը դեպի Սատուրն:`,
    `6. Մասնիկների և ճառագայթման դետեկտորներ. Գիտական արբանյակները կրում են
    մասնիկների դետեկտորներ և ճառագայթման տվիչներ՝ տիեզերքում տիեզերականճառագայթները, արևի մասնիկները և ճառագայթման այլ ձևերը չափելու համար:
    Այս չափումները գիտնականներին օգնում են հասկանալ տիեզերական եղանակի
    ազդեցությունը Երկրի վրա, ուսումնասիրել մասնիկների ֆիզիկան և հետազոտել
    տիեզերական միջավայրը՝ տիեզերագնացների և տիեզերանավերի համար
    հնարավոր վտանգների համար:`,
    `Գիտական արբանյակները էական գործիքներ են տիեզերքի, Երկրի և դրանք ձևավորող
    գործընթացների մասին մեր գիտելիքներն առաջ մղելու համար: Նրանք տրամադրում են
    անգնահատելի տվյալներ, որոնք նպաստում են գիտական հետազոտություններին,
    օգնում են վերահսկել շրջակա միջավայրը և ընդլայնում են տիեզերքի մասին մեր
    պատկերացումները:`,
    ],
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },

  {
    lesson: `Դաս 4. Տիեզերանավ և առաքելություններ`,
    lectures: `2. Տիեզերական մաքոքներ`,
    text1: `Տիեզերական մաքոքները բազմակի օգտագործման տիեզերանավեր են, որոնք
    նախատեսված են անձնակազմի անդամներին և բեռները տիեզերք տեղափոխելու և
    այնուհետև Երկիր վերադարձնելու համար: Տիեզերական մաքոքները հիմնական
    գործառույթը, ինչպիսին է NASA-ի պաշտոնաթող Space Shuttle ծրագիրը,
    տիեզերագնացների, արբանյակների և այլ բեռների տեղափոխումն էր Երկրի ցածր
    ուղեծիր (LEO): Նրանք վճռորոշ դեր խաղացին Միջազգային տիեզերակայանի (ՄՏԿ)
    կառուցման գործում և օգտագործվեցին գիտական փորձերի, արբանյակների
    տեղակայման և վերանորոգման համար:`,
    text_arr_margin: [
    `${URL_GIF}/gif4_3.gif`,
    `Տիեզերական մաքոքները տիեզերանավերի մի տեսակ է, որոնք օգտագործվել են ՆԱՍԱ-ի՝
    Միացյալ Նահանգների տիեզերական գործակալության կողմից 1981-2011 թվականներին
    մարդկային տիեզերական թռիչքների համար: Ահա տիեզերական մաքոքների մի քանի
    հիմնական առանձնահատկություններ և գործառույթներ.`,
    `1. Կրկնակի օգտագործման հնարավորություն. Տիեզերական մաքոքների որոշիչ
    հատկանիշներից մեկը դրանց կրկնակի օգտագործման հնարավորությունն էր: Ի
    տարբերություն ավանդական հրթիռների, որոնք նետվում են արձակումից հետո,
    տիեզերական մաթոթները նախագծված էին բազմակի օգտագործման համար՝
    բազմաթիվ առաքելություններ թռչելու ունակությամբ:
    Առաքելությունն ավարտելուց հետո մաքոքները նորից կմտնեն Երկրի մթնոլորտ, վայրէջք
    կկատարեն և կվերանորոգվեն հետագա թռիչքների համար:`,
    `2. Անձնակազմ և բեռներ. Տիեզերական մաքոքները կարող էին տեղափոխել
    տիեզերագնացների անձնակազմ, որոնք սովորաբար տատանվում էին հինգից յոթ
    անդամի միջև: Բացի անձնակազմից, մաքոքները կարող էին զգալի քանակությամբ
    բեռ տեղափոխել տիեզերք, ներառյալ արբանյակները, գիտական գործիքները,սարքավորումները և պարագաները: Նրանք կենսական դեր են խաղացել
    արբանյակների տեղակայման և Միջազգային տիեզերական կայանի (ՄՏԿ)
    կառուցման ու համալրման գործում:`,
    `3. Ուղեծիր և մանևրելիություն. Տիեզերական մաքոքները գործում են Երկրի ցածր
    ուղեծրում (LEO), սովորաբար մոտ 300-400 կիլոմետր բարձրության վրա: Նրանք
    հագեցած էին մանևրող շարժիչներով և մղիչներով, որոնք թույլ էին տալիս փոխել
    իրենց ուղեծիրը, հանդիպել այլ տիեզերանավերի հետ և կատարել տարբեր
    ուղեծրային մանևրներ։ Այս մանևրելու ունակությունը շատ կարևոր էր
    արբանյակների տեղակայման, տիեզերակայանների հանդիպման և առաքելության
    այլ նպատակների համար:`,
    `4. Տիեզերական մաքոքները բեռնախցիկը գտնվում է ուղեծրի հետևի մասում և կարող
    է տեղավորել մեծ բեռներ, ինչպիսիք են արբանյակները կամ մոդուլները ISS-ի
    համար: Բացվածքն ունի մոտ 18 մետր երկարություն, 4,6 մետր լայնություն և 18
    մետր ծավալ։ Այն ապահովում է վերահսկվող միջավայր բեռների համար
    արձակման, ուղեծրի և վերամիավորման ժամանակ:`,
    `5. Լաբորատորիա և փորձեր. Տիեզերական մաքոքներն ունեին անձնակազմի խցիկ,
    որն ապահովում է տիեզերագնացների համար բնակելի տարածքներ իրենց
    առաքելությունների ընթացքում: Անձնակազմի խցիկը նաև ծառայում է որպես
    լաբորատորիա միկրոգրավիտացիայի ոլորտում փորձեր անցկացնելու, տիեզերքի
    ազդեցությունը տարբեր նյութերի, կենսաբանական նմուշների և մարդու
    ֆիզիոլոգիայի վրա ուսումնասիրելու համար։ Այս կարողությունը նպաստեց
    գիտական հետազոտություններին և առաջընթացին բազմաթիվ ոլորտներում:`,
    `6. Վերադարձ Երկիր. Տիեզերքում իրենց առաքելությունն ավարտելուց հետո
    տիեզերական մաքոքները նորից կմտնեն Երկրի մթնոլորտ: Մթնոլորտային շփման
    պատճառով կենթարկվելով բարձր ջերմաստիճանային և ծայրահեղ ուժերի ճնշման,
    այնուհետև պարաշյուտներոի օգնությամբ կդանդաղեցնեն վայրէջքը: Ի վերջո,
    վայրէջք կկատարեն թռիչքուղու վրա, ինչպես ինքնաթիռը:`
  
    ],
    image:  `${URL_IMAGES}/das4_3.jpg`,
    text2: `Տիեզերական մաքոքները մեծ դեր ունեցան մարդկային տիեզերական թռիչքների
    առաջխաղացման և գիտական, տեխնոլոգիական, ինժեներական տարբեր նվաճումների
    համար: Նրանք նշանակալի դեր են խաղացել ISS-ի կառուցման և սպասարկման գործում,
    հետազոտություններ են անցկացրել միկրոգրավիտացիայի ոլորտում, տեղակայել
    արբանյակներ և նպաստել ապագա տիեզերական հետազոտությունների համար
    տեխնոլոգիաների զարգացմանը:`,
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },
  {
    lesson: `Դաս 4. Տիեզերանավ և առաքելություններ`,
    lectures: `3. Անձնակազմով պարկուճ`,
    text1: `Անձնակազմով պարկուճները տիեզերանավեր են, որոնք հատուկ նախագծված են
    տիեզերագնացներին անվտանգ տիեզերք տեղափոխելու համար: Այս պարկուճները
    սովորաբար արձակվում են հրթիռի վերևից և կարող են նորից մտնել և վայրէջք կատարել:
    Անձնակազմի խցիկների օրինակները ներառում են.`,
    image: `${URL_IMAGES}/das4_4.jpg`,
    text_arr_margin: [
    `● «Սոյուզ». Ռուսաստանի կողմից մշակված «Սոյուզ» տիեզերանավը շահագործման
    է հանձնվել 1960-ական թվականներից և օգտագործվում է անձնակազմի
    տեղափոխման համար դեպի ISS և հակառակ ուղղությամբ:`,
    `● Crew Dragon. մշակված SpaceX-ի կողմից NASA-ի կոմերցիոն անձնակազմի ծրագրի
    համար, Crew Dragon-ը անձնակազմով խցիկ է, որը կարող է տիեզերագնացներին
    տեղափոխել ISS և ապահով վերադարձնել Երկիր:`,
    `● Starliner. Boeing-ի Starliner տիեզերանավը մեկ այլ անձնակազմով պարկուճ է, որը
    նախատեսված է տիեզերագնացներին դեպի ISS և հետ փոխադրելու համար:`,
    `${URL_GIF}/gif4_4.gif`],
    text2: `Անձնակազմով խցիկները կարևոր են անձնակազմի առաքելությունների համար, որոնք թույլ են տալիս տիեզերագնացներին
    ճանապարհորդել տիեզերք և անվտանգ վերադառնալ՝ հեշտացնելով տիեզերական հետազոտությունը,
    գիտական հետազոտությունը և տիեզերական կայանների պահպանումը:`,
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },
  {
    lesson: `Դաս 4. Տիեզերանավ և առաքելություններ`,
    lectures: `Ուղեծրի մեխանիկա և հետագծի հաշվարկներ`,
    text1: `Բացատրեք ուղեծրային մեխանիկան և հաշվարկները, որոնք ներգրավված են
    տիեզերական առաքելությունների պլանավորման և կատարման մեջ, ներառյալ
    արձակման պատուհանները, փոխանցման ուղեծրերը և ժամադրությունները:`,
    image: `${URL_IMAGES}/das4_ux.jpg`,
    text2:`Ուղեծրային մեխանիկան օդատիեզերական ճարտարագիտության այն ճյուղն է, որը
    զբաղվում է գրավիտացիոն ուժերի ազդեցության տակ տարածության մեջ առարկաների
    շարժումով։ Ուղեծրային մեխանիկայի ըմբռնումը շատ կարևոր է տիեզերական
    առաքելությունների պլանավորման և իրականացման համար, ներառյալ մեկնարկի
    պատուհանները որոշելը, փոխանցման ուղեծրերի նախագծումը և տիեզերանավերի միջև
    հանդիպման հասնելը:`,
    text_arr_margin: [
    `${URL_GIF}/gif4_5.gif`,
    `Ահա մի քանի հիմնական հասկացություններ և հաշվարկներ, որոնք ներգրավված են
    տիեզերական առաքելությունների ուղեծրային մեխանիկայում.`,
    `1. Կեպլերի մոլորակների շարժման օրենքները. Յոհաննես Կեպլերը ձևակերպեց երեք
    օրենք, որոնք նկարագրում են Արեգակի շուրջ պտտվող մոլորակների և այլ
    առարկաների շարժումը: Այս օրենքները կարևոր են ուղեծրերի երկրաչափությունն
    ու դինամիկան հասկանալու համար: Դրանք ներառում են էլիպսների օրենքը
    (ուղեծրի ձևերը), հավասար տարածքների օրենքը (արագությունը և դիրքը ուղեծրիերկայնքով) և ներդաշնակության օրենքը (շրջադարձի շրջանի և հեռավորության
    կապը)։`,
    `2. Գործարկման պատուհանը. Գործարկման պատուհանը վերաբերում է որոշակի
    ժամանակաշրջանին, որի ընթացքում տիեզերանավը կարող է մեկնարկվել՝
    նվազագույն էներգիայի պահանջներով հասնելու իր նպատակակետին:
    Գործարկման պատուհանները որոշվում են՝ հաշվի առնելով արձակման վայրի
    հարաբերական դիրքերն ու արագությունները, նպատակակետը (օրինակ՝ մոլորակ
    կամ տիեզերական կայան) և ուղեծրային մեխանիկան, որը ներգրավված է
    տեղափոխման մեջ:`,
    `3. Փոխանցման ուղեծրեր. Փոխանցման ուղեծրերը օգտագործվում են տիեզերանավը
    մի ուղեծրից մյուսը տեղափոխելու կամ այն երկնային մարմինների միջև, օրինակ՝
    Երկրի և Մարսի միջև տեղափոխելու համար: Ամենատարածված փոխանցման
    ուղեծրերը Հոհմանի փոխանցումներն են, որոնք արդյունավետ են և պահանջում
    են նվազագույն քանակությամբ էներգիա։ Փոխանցման ուղեծրերի որոշման հետ
    կապված հաշվարկները ներառում են պահանջվող Delta-V-ի (արագության
    փոփոխություն) որոշումը և այրման մանևրների ժամանակի և դիրքավորման
    հաշվարկը:`,
    `Կորևոր է նաև իմանալ Հոհմանի փոխանցման ուղեծիր մասին։ Հոհմանի
    փոխանցման ուղեծիրը վառելիքի խնայող մեթոդ է, որն օգտագործվում է
    տիեզերանավը տիեզերքում երկու շրջանաձև ուղեծրերի միջև տեղափոխելու
    համար: Փոխանցման ուղեծիրը էլիպսաձև ուղի է, որը հատում է ինչպես
    սկզբնական, այնպես էլ թիրախային ուղեծրերը։`,
    `Հոհմանի փոխանցում իրականացնելու համար տիեզերանավը նախ այրում է իր
    շարժիչները սկզբնական շրջանաձև ուղեծրի երկայնքով՝ բարձրացնելու իր
    ապոապսիսը (էլիպսաձև ուղեծրի ամենաբարձր կետը)։ Այս փոխանցման այրումը
    մեծացնում է տիեզերանավի էներգիան և տեղափոխում այն փոխանցման ուղեծիր:`,
    `Երբ տիեզերանավը հասնում է փոխանցման ուղեծրի ապոապսիսին, այն
    կատարում է շարժիչի մեկ այլ այրում, որը հայտնի է որպես շրջանաձև այրում: Այս
    այրումն իրականացվում է ապոապսիսում՝ էլիպսաձև ուղեծիրը շրջանաձև ուղեծրի
    վերածելու համար, բայց այժմ ավելի բարձր բարձրության վրա: Շրջանաձև
    ուղեծիրը դառնում է թիրախային ուղեծիր:`,
    `Զգուշորեն ժամանակավորելով այս շարժիչի այրումը, տիեզերանավը կարող է
    արդյունավետ կերպով հասնել նախնական և թիրախային ուղեծրերի միջև
    ցանկալի տեղափոխությանը: Հոհմանի փոխանցումը նվազագույնի է հասցնում
    վառելիքի ծախսը՝ օգտվելով երկնային մարմինների բնական դինամիկայից:`,
    `Ընդհանուր առմամբ, Հոհմանի փոխանցման ուղեծիրը ապահովում է պրակտիկ և
    վառելիքի խնայող տեխնիկա տիեզերական տիեզերանավը շրջանաձև ուղեծրերի
    միջև տեղափոխելու համար:`,
    `${URL_IMAGES}/das4_5.jpg`,
    `4. Delta-V հաշվարկներ. Delta-v-ն արագության փոփոխությունն է, որն անհրաժեշտ է
    որոշակի ուղեծրի փոփոխության կամ փոխանցման հասնելու համար: Սա
    ուղեծրային մեխանիկայի հաշվարկներում կարևոր պարամետր է, քանի որ որոշում
    է տարբեր մանևրների համար անհրաժեշտ էներգիան: Delta-V-ի հաշվարկը
    ներառում է այնպիսի գործոնների դիտարկում, ինչպիսիք են երկնային
    մարմինների գրավիտացիոն ուժերը, ուղեծրի ցանկալի փոփոխությունը և
    տիեզերանավի շարժիչ համակարգի բնութագրերը:`,
    `Առաջին տիեզերական արագությունը, որը նաև հայտնի է որպես ուղեծրային
    արագություն, նվազագույն արագությունն է, որն անհրաժեշտ է օբյեկտի համար
    երկնային մարմնի շուրջ կայուն ուղեծրի հասնելու համար: Այն նշանակալի է
    տիեզերական հետազոտության մեջ, քանի որ այն հնարավորություն է տալիս
    տիեզերանավերին պահպանել կայուն և շարունակական ներկայությունը
    տիեզերքում:`,
    `Երկրից առաջին տիեզերական արագությունը մոտավորապես 11,2 կիլոմետր/վրկ է
    (կամ մոտ 25020 մղոն/ժամ): Սա նշանակում է, որ եթե օբյեկտը, ինչպիսին
    տիեզերանավն է, հասնում է կամ գերազանցում է այս արագությունը, այն կարող է
    հաղթահարել Երկրի գրավիտացիոն ձգողականությունը և մտնել տիեզերք:`,
    `Կարևոր է նշել, որ տիեզերանավերի արագությունները կարող են տարբեր լինել՝
    կախված առաքելությունից և հետագծից: Երբ տիեզերանավը հասնի առաջին
    տիեզերական արագության, այն կարող է շարունակել արագանալ լրացուցիչ
    շարժիչի կամ գրավիտացիոն աջակցության մանևրների միջոցով՝ հասնելու ավելի
    բարձր արագությունների, ինչպիսիք են միջմոլորակային ճանապարհորդության
    կամ խորը տիեզերքի հետազոտման համար պահանջվողները:`,
    `${URL_IMAGES}/das4_6.jpg`,
    `5. Հանդիպման վայր և նավահանգիստ. Հանդիպման վայրը ներառում է երկու
    տիեզերանավերի միավորումը տիեզերքում, մինչդեռ նավահանգիստը վերաբերում
    է նրանց միջև ֆիզիկական կապին: Հանդիպումների և նավամատույցի հասնելու
    համար անհրաժեշտ են ճշգրիտ հաշվարկներ՝ տիեզերանավի ուղեծրերին,
    հարաբերական արագություններին և ժամանակին համապատասխանելու համար:
    Տարբեր տեխնիկա, ներառյալ փուլային ուղեծրերը, միասնական հանդիպումը ևՀոհմանի փոխանցումները, օգտագործվում են ժամադրության և նավահանգստի
    մանևրների պլանավորման և իրականացման համար:`,
    `6. Ուղեծրային փոխանցումներ և հարթության փոփոխություններ. ուղեծրի
    փոխանցումները ներառում են ուղեծրի թեքության կամ հարթության
    փոփոխություն: Սա հաճախ անհրաժեշտ է առաքելության հատուկ նպատակներին
    հասնելու համար: Ուղեծրային փոխանցումների և հարթության
    փոփոխությունների հաշվարկները ներառում են անհրաժեշտ Delta-V-ի որոշումը և
    մանևրների համապատասխան ժամանակացույցը:`,
    `7. Գրավիտացիոն օժանդակ միջոցները, որոնք նաև հայտնի են որպես մոլորակային
    թռիչքներ, օգտագործում են երկնային մարմնի գրավիտացիոն ձգողականությունը՝
    փոխելու տիեզերանավի հետագիծն ու արագությունը: Այս տեխնիկան սովորաբար
    օգտագործվում է արագություն ձեռք բերելու կամ կորցնելու և միջմոլորակային
    առաքելությունների հետագիծը կարգավորելու համար: Գրավիտացիոն օգնության
    հաշվարկները ներառում են տիեզերանավի հետագծի և թիրախային մարմնի
    գրավիտացիոն ազդեցության ճշգրիտ հաշվարկները:`,
    `Ուղեծրերը կարելի է դասակարգել՝ ելնելով նրանց ձևից և Երկրից հեռավորությունից:
    Ահա ուղեծրերի հիմնական տեսակները.`,
    `${URL_IMAGES}/das4_7.jpg`,
    `● Ցածր Երկրի ուղեծիր (LEO): Այս ուղեծրերը համեմատաբար մոտ են Երկրի
    մակերեսին, սովորաբար տատանվում են Երկրից մոտ 160 կմ (100 մղոն) մինչև
    2000 կիլոմետր (1200 մղոն) բարձրության վրա: LEO-ն սովորաբար օգտագործվում
    է արբանյակային հաղորդակցության, Երկրի դիտարկման և տիեզերական
    առաքելությունների համար, ինչպիսիք են Միջազգային տիեզերական կայանը
    (ISS):`,
    `● Միջին Երկրի ուղեծիր (MEO). MEO-ն միջանկյալ ուղեծիր է, որի բարձրությունները
    տատանվում են շուրջ 2000 կմ (1200 մղոն) մինչև 35786 կիլոմետր (22236 մղոն):
    Գլոբալ նավիգացիոն արբանյակային համակարգերը (GNSS), ինչպիսիք են GPS-ը
    և GLONASS-ը, օգտագործում են MEO-ն դիրքորոշման և ժամանակի
    ծառայությունների համար:`,
    `● Գեոստացիոնար ուղեծիր (GEO). GEO-ն Երկրի բարձր ուղեծիր է, որը գտնվում է
    հասարակածից մոտավորապես 35,786 կիլոմետր (22,236 մղոն) բարձրության վրա:
    GEO-ի ուղեծրի արբանյակները Երկրի վրա գտնվող դիտորդի համեմատ անշարժ
    են թվում, քանի որ դրանք համապատասխանում են Երկրի պտույտին: Դրանք
    սովորաբար օգտագործվում են կապի, եղանակի մոնիտորինգի և հեռարձակման
    համար:`,
    `● Բարձր էլիպսաձև ուղեծիր (HEO). HEO-ներն ունեն էլիպսաձև շատ երկարավուն
    ուղիներ, որոնց արբանյակի բարձրությունը զգալիորեն փոխվում է իր ուղեծրի
    ընթացքում: Այս ուղեծրերն օգտագործվում են հատուկ նպատակների համար,
    բևեռային հարդությամբ հաղորդակցություն ստանալու համար:`,
    `● Արևի համաժամանակյա ուղեծիր (SSO). SSO-ը մերձբևեռային ուղեծիր է, որը
    պահպանում է ֆիքսված անկյուն արբանյակի ուղեծրի հարթության և Արեգակի
    միջև: Այս ուղեծիրը հաճախ օգտագործվում է Երկրի դիտորդական արբանյակների
    համար՝ հետևողական լուսավորության պայմանները պատկերելու և մոնիտորինգի
    նպատակով:`,
    `● Molniya ուղեծիր. Molniya ուղեծիրը բարձր թեքությամբ բարձր էլիպսաձև ուղեծրի
    տեսակ է: Այն հիմնականում օգտագործվում է ռուսական կապի արբանյակների
    կողմից՝ ծածկելու բարձր լայնության շրջանները, ինչպիսիք են Ռուսաստանի
    հյուսիսային մասերը, որտեղ այլ ուղեծրեր ունեն սահմանափակ ծածկույթ:`,
    `${URL_IMAGES}/das4_8.jpg`,
    `Ուղեծրային մեխանիկայի այս հաշվարկներն ու հասկացությունները կարևոր են
    առաքելության պլանավորման, տիեզերանավերի հետագծերի նախագծման և բարդ
    տիեզերական առաքելությունների իրականացման համար: Դրանք գիտնականներին և
    ինժեներներին հնարավորություն են տալիս օպտիմալացնել վառելիքի սպառումը, հասնել
    առաքելության նպատակներին և ապահովել տիեզերական առաքելությունների
    անվտանգ և արդյունավետ շահագործումը:`,
    ],
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },
  {
    lesson: `Դաս 4. Տիեզերանավ և առաքելություններ`,
    lectures: `Միջմոլորակային առաքելություններ և տիեզերական զոնդեր`,
    text1: `Ուսումնասիրեք նշանավոր միջմոլորակային առաքելությունները և տիեզերական
    զոնդերը, ինչպիսիք են «Վոյաջերը», «Կասսինին» կամ Մարսի վրա գտնվող
    «Perseverance» մարսագնացը:`,
    text2: `Ահա մի քանի նշանավոր միջմոլորակային առաքելություններ և տիեզերական զոնդեր,
    որոնք նպաստել են Արեգակնային համակարգի մեր ըմբռնմանը.`,
    text_arr_margin: [
    `1. Վոյաջեր. «Վոյաջեր» տիեզերանավը, մասնավորապես «Վոյաջեր 1»-ը և «Վոյաջեր
    2»-ը, արձակվել են 1977 թվականին՝ մեր արեգակնային համակարգի արտաքին
    մոլորակները հետազոտելու հիմնական առաքելությամբ: Այս զույգ զոնդերը
    մանրամասն դիտարկումներ և տվյալներ են տրամադրել Յուպիտերի, Սատուրնի,
    Ուրանի և Նեպտունի մասին։ Վոյաջեր 1-ը դարձավ մարդու կողմից ստեղծված
    առաջին օբյեկտը, որը հասավ միջաստղային տարածություն 2012 թվականին:
    Վոյաջեր առաքելությունները անգնահատելի տեղեկություններ են տրամադրել
    մոլորակների, նրանց արբանյակների և Արեգակնային համակարգի արտաքին
    շրջանների մասին:`,
    `${URL_IMAGES}/das4_9.jpg`,
    `2. Cassini-Huygens. Cassini-Huygens առաքելությունը ՆԱՍԱ-ի, Եվրոպական
    տիեզերական գործակալության (ESA) և Իտալիայի տիեզերական գործակալության
    (ASI) համագործակցությունն էր: Տիեզերանավը, որը կոչվում է Cassini, արձակվել է
    1997 թվականին և հասել Սատուրն 2004 թվականին: Այն իրականացրել է
    Սատուրնի, նրա օղակների և արբանյակների համապարփակ ուսումնասիրություն:
    Հյուգենս զոնդը, որը մշակվել է ESA-ի կողմից, հաջողությամբ վայրէջք է կատարել Սատուրնի Տիտանի արբանյակի վրա թվականին՝ արժեքավոր 2005
    պատկերացումներ տալով նրա մթնոլորտի և մակերեսի վերաբերյալ: Cassini-ի
    առաքելությունն ավարտվել է 2017 թվականին Սատուրնի մթնոլորտում կանխամտածված:`,
    `${URL_IMAGES}/das4_10.jpg`,
    `3. Մարսագնացներ (օրինակ՝ հաստատակամություն, հետաքրքրասիրություն). Մարսագնացները կարևոր դեր են ունեցել կարմիր մոլորակի երկրաբանության,
    մթնոլորտի և պոտենցիալ բնակելիության ուսումնասիրության մեջ: NASA-ի
    Perseverance մարսագնացը, որը գործարկվել է 2020 թվականին, Մարսի
    հետախուզական նավատորմի վերջին լրացումն է: Այն հագեցած է առաջադեմ
    գիտական գործիքներով, ներառյալ տեսախցիկները, սպեկտրոմետրերը և
    փորվածքը՝ անցյալի մանրէաբանական կյանքի նշաններ որոնելու, Երկիր ապագա վերադարձի համար նմուշներ հավաքելու և ապագա մարդկային
    առաքելությունների համար տեխնոլոգիաներ փորձարկելու համար:`,
    `${URL_IMAGES}/das4_11.jpg`,
    `4. Նոր հորիզոններ. 2006 թվականին գործարկված New Horizons տիեզերանավը
    ավարտեց Պլուտոնի և նրա արբանյակների պատմական թռիչքը 2015 թվականին՝
    տրամադրելով այս հեռավոր գաճաճ մոլորակի առաջին մոտիկից պատկերներն ու
    տվյալները: Պլուտոնի հանդիպումից հետո New Horizons-ը շարունակեց իր
    ճանապարհորդությունը դեպի Կոյպերի գոտի, որտեղ 2019-ին թռավ Arrokoth
    կոչվող փոքրիկ Կույպերի գոտու օբյեկտի մոտ: Առաքելությունը արժեքավոր
    պատկերացումներ է տվել այս սառցե, հեռավոր աշխարհների կազմի և
    բնութագրերի վերաբերյալ:`,
    `${URL_IMAGES}/das4_12.jpg`,
    `5. Ռոզետա. Եվրոպական տիեզերական գործակալության Rosetta առաքելությունը
    արձակվել է թվականին՝ նպատակ ունենալով ուսումնասիրել 2004
    67P/Չուրյումով-Գերասիմենկո գիսաստղը: 2014թ.-ին առաքելությունը հասել է
    պատմական իրադարձության՝ հաջողությամբ տեղակայելով Philae վայրէջքը
    գիսաստղի մակերեսին: Առաքելությունը մանրամասն տվյալներ է տրամադրել
    գիսաստղի կազմի, կառուցվածքի և գործունեության մասին՝ լույս սփռելով
    գիսաստղերի ծագման և էվոլյուցիայի և վաղ Արեգակնային համակարգի վրա։`,
    `6. Մարիներ և պիոներ առաքելություններ. 1960-ականներին և 1970-ականներին
    ՆԱՍԱ-ի կողմից իրականացված «Մարիներ» և «Պիոներ» առաքելությունները
    միջմոլորակային հետախուզման առաջնահերթ ձեռնարկություններ էին: Մարիներ
    2-ը դարձավ առաջին տիեզերանավը, որը թռավ մեկ այլ մոլորակով (Վեներա) 1962
    թվականին, իսկ Մարիներ 4-ը հաջողությամբ իրականացրեց Մարսի առաջին
    թռիչքը 1965 թվականին՝ ուղարկելով մոլորակի մակերեսի մոտիկից պատկերներ։
    Pioneer առաքելություններն ուսումնասիրեցին արեգակնային համակարգի
    տարբեր ասպեկտներ, ներառյալ աստերոիդների, Լուսնի և Յուպիտերի
    ուսումնասիրությունը:`,
    `${URL_IMAGES}/das4_13.jpg`,
    `Այս առաքելությունները, ի թիվս բազմաթիվ այլ առաքելությունների, զգալիորեն
    ընդլայնել են մեր գիտելիքները Արեգակնային համակարգի մասին՝ ապահովելով
    երկնային մարմինների մանրամասն դիտարկումներ, չափումներ և պատկերներ և օգնել
    մեզ հասկանալ դրանց երկրաբանական առանձնահատկությունները, մթնոլորտը և
    կյանքի ներուժը: Նրանք ճանապարհ են հարթել ապագա առաքելությունների համար և
    շարունակում են ոգեշնչել նոր հայտնագործություններն ու գիտական առաջընթացները:`
    ],
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],

    created_at: new Date().toISOString(),
  },
  {
    lesson: `Դաս 4. Տիեզերանավ և առաքելություններ`,
    lectures: `Առաքելության ուսումնասիրություն. Մարսագնացները և նրանց գիտական բացահայտումները`,
    text1: `Մարսագնացների վերաբերյալ մանրամասն դեպքի ուսումնասիրություն կատարեք՝
    ուսումնասիրելով նրանց գիտական գործիքները, հայտնագործությունները և կարմիր
    մոլորակը ուսումնասիրելու մարտահրավերները:`,
    text2:   `Մարսագնացները կարևոր դերակատարներ են եղել կարմիր մոլորակի հետախուզման
    գործում՝ տրամադրելով արժեքավոր գիտական տվյալներ և ընդլայնելով Մարսի մասին
    մեր պատկերացումները: Եկեք ուսումնասիրենք մարսագնացների կրած գիտական
    գործիքները, ընդգծենք նրանց որոշ նշանակալի հայտնագործություններ և
    ուսումնասիրենք Մարսի ուսումնասիրության հետ կապված մարտահրավերները:`,
    text_arr_margin: [
      `Գիտական գործիքներ.`,
      `1. Տեսախցիկներ. Մարսագնացները հագեցված են տարբեր տեսակի
      տեսախցիկներով, ներառյալ համայնապատկերային տեսախցիկներ, նավիգացիոն
      տեսախցիկներ և մանրադիտակային պատկերներ: Այս գործիքները ֆիքսում են
      Մարսի մակերևույթի բարձրորակ պատկերները՝ թույլ տալով գիտնականներին
      ուսումնասիրել ապարների, հողի և առանձնահատկությունների
      երկրաբանությունը, մորֆոլոգիան և բաղադրությունը։`,
      `2. Սպեկտրոմետրեր. Ռովերները կրում են սպեկտրոմետրեր՝ վերլուծելու մարսյան
      ապարների և հողի քիմիական բաղադրությունը: Գործիքները օգտագործում են
      տարբեր մեթոդներ, ինչպիսիք են ռենտգենյան սպեկտրոսկոպիան, ալֆա
      մասնիկների ռենտգենյան սպեկտրոմետրիան և լազերային առաջացրած
      քայքայման սպեկտրոսկոպիան՝ որոշելու նմուշների տարրական բաղադրությունը
      և հանքաբանությունը:`,
      `3. Հորատման և նմուշների հավաքում. Մարսագնացները, ինչպիսիք են Curiosity-ն և
      Perseverance-ը, ունեն հորատման համակարգ՝ քարերի և հողի նմուշներ
      հավաքելու համար: Այս նմուշներն այնուհետև վերլուծվում են տարբեր սարքերի
      միջոցով, ներառյալ սպեկտրոմետրերը և մանրադիտակային պատկերները,
      որպեսզի մանրամասն տեղեկություններ տրամադրեն մոլորակի երկրաբանության,
      անցյալի բնակելիության հնարավորության և մոլորակի պատմության մասին
      հուշումների մասին:`,
      `4. Շրջակա միջավայրի սենսորներ. Ռովերները հագեցած են շրջակա միջավայրի
      սենսորներով՝ վերահսկելու Մարսի մթնոլորտը, ներառյալ ջերմաստիճանը,
      ճնշումը, խոնավությունը և քամու արագությունը: Այս չափումները նպաստում են
      Մարսի եղանակի օրինաչափությունների, մթնոլորտի դինամիկայի և ապագայում
      մարդկանց հետախուզմանն աջակցելու մեր ըմբռնմանը:`,
      `Բացահայտումներ.`,
      `1. Անցյալ ջրի ապացույց. Մարսագնացները մոլորակի մակերեսի վրա անցյալի ջրի
      համոզիչ ապացույցներ են հայտնաբերել: Spirit and Opportunity-ն, որը ՆԱՍԱ-ի Mars
      Exploration Rover առաքելության մի մասն է, հայտնաբերել է հնագույն ժայռային
      գոյացություններ, նստվածքային կառույցներ և հանքային հանքավայրեր, որոնք
      վկայում են Մարսի անցյալում հեղուկ ջրի առկայության մասին: Curiosity
      մարսագնացի գտածոները Գեյլի խառնարանում նույնպես հուշում են, որ այդ
      տարածքում ժամանակին լիճ է եղել:`,
      `2. Օրգանական միացություններ. Եվ Curiosity-ն և Perseverance-ը հայտնաբերել են
      օրգանական մոլեկուլներ, ներառյալ բարդ ածխածնի միացությունները, մարսյան
      ժայռերում: Այս հայտնագործությունները հրապուրիչ հուշումներ են տալիս Մարսի
      վրա անցյալ կամ ներկա կյանքի ներուժի մասին, թեև այս օրգանական
      մոլեկուլների ճշգրիտ ծագումը դեռ ուսումնասիրության փուլում է:`,
      `3. Մեթանի տատանումները. Մարսի մթնոլորտում մեթանի առկայությունը զգալի
      հետաքրքրության թեմա է դարձել: Curiosity-ն հայտնաբերել է մեթանի
      տատանումներ, և թե՛ ուղեծրերի, թե՛ ռավերների չափումները ցույց են տվել
      մեթանի մակարդակների սեզոնային և տեղայնացված տատանումները: Այս
      բացահայտումները առաջացրել են Մարսի վրա մեթանի արտադրության
      աղբյուրների և գործընթացների հետագա հետազոտություններ:`,
      `4. Հնագույն բնակելիություն. Ռովերները ապացույցներ են ներկայացրել, որ Մարսը
      ժամանակին եղել է պոտենցիալ բնակելի միջավայր: Հանքանյութերի
      բացահայտումները, որոնք վկայում են անցյալի ջրի մասին, օրգանական
      մոլեկուլների նույնականացումը և կյանքի համար կարևոր տարրերի
      հայտնաբերումը, միասին նպաստել են մոլորակի անցյալի բնակելիության մեր ըմբռնմանը:`,
      `Մարտահրավերներ.`,
      `1. Հեռավորություն և հաղորդակցություն. Մարսը Երկրից միջինը 225 միլիոն
      կիլոմետր հեռավորության վրա է: Հաղորդակցման զգալի ժամանակի հետաձգումը,
      որը տատանվում է մի քանի րոպեից մինչև մի քանի ժամ, մարտահրավերներ է
      ստեղծում ռովերների իրական ժամանակում վերահսկման և տվյալների
      փոխանցման համար: Առաքելության պլանավորումը և կատարումը պետք է հաշվի
      առնեն հաղորդակցության այս սահմանափակումները:`,
      `2. Ծայրահեղ մարսյան միջավայր. Մարսը ծանր պայմաններ է ներկայացնում
      ռավերների համար, ներառյալ ծայրահեղ ջերմաստիճանները, բարձր
      ճառագայթման մակարդակը և հղկող փոշու առկայությունը: Ինժեներները պետք է
      նախագծեն ռովերներ, որպեսզի դիմակայեն այս պայմաններին և ապահովեն
      առաքելության երկարակեցությունը:`,
      `3. Շարժունակություն և տեղանք. Մարսն ունի տարբեր տեղանքներ, ներառյալ
      ժայռոտ մակերեսները, զառիթափ լանջերը և ավազոտ շրջանները: Ռովերները
      պետք է կարողանան նավարկելու և անցնելու այս դժվար տեղանքները՝
      միաժամանակ խուսափելով խոչընդոտներից: Ռովերների անիվների և
      շարժունակության համակարգերի ձևավորումը կարևոր դեր է խաղում
      արդյունավետ նավարկելու ունակության մեջ:`,
      `4. Սահմանափակ կյանք և հզորություն. Մարսագնացները հենվում են արևային
      մարտկոցների վրա էլեկտրաէներգիա արտադրելու համար, ինչը դժվարություններէ առաջացնում փոշու փոթորիկների ժամանակ կամ երբ վահանակները
      ժամանակի ընթացքում ծածկվում են փոշով: Բացի այդ, ռովերների կյանքի
      տևողությունը սահմանափակվում է այնպիսի գործոններով, ինչպիսիք են
      մաշվածությունը, բաղադրիչների ծերացումը և կենսական գործիքների վրա փոշու
      կուտակումը:`
    ],
    text3: `Չնայած այս մարտահրավերներին, մարսագնացները ուշագրավ գիտական ներդրումներ
    են կատարել և շարունակում են արժեքավոր տվյալներ տրամադրել կարմիր մոլորակի
    մասին: Նրանք հեղափոխեցին Մարսի անցյալի բնակելիության, ջրի պատմության և կյանքի ներուժի մեր
    պատկերացումները՝ ճանապարհ հարթելով ապագա առաքելությունների համար, ներառյալ նմուշների վերադարձը
    և մարդկանց հետախուզումը:`,
    button: ["Հետ", "Առաջ", "Հետ դեպի հարցաշար"],
    created_at: new Date().toISOString(),
  },

  ]);

  await pg("questions").insert([
    // Lesson 1
    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      question:
        "Ո՞րն է եղել տիեզերք արձակված առաջին արհեստական արբանյակը և ո՞ր երկիրն է այն արձակել:",
      incorrectAnswer: [
        "Տիեզերք արձակված առաջին արհեստական արբանյակը կոչվել է Starship, և այն արձակվել է Հնդկաստանի կողմից։",
        "Տիեզերք արձակված առաջին արհեստական արբանյակը կոչվում էր «Տիեզերական Հերմես», և այն արձակվեց Ատլանտիս երկրի կողմից:",
        "Տիեզերք արձակված առաջին արհեստական արբանյակը կոչվել է Sputnik Apollo, և այն արձակվել է Ամերիկայի կողմից։",
      ],
      correctAnswer:
        "Տիեզերք արձակված առաջին արհեստական արբանյակը կոչվել է Sputnik 1, և այն արձակվել է Խորհրդային Միության կողմից։",
        background:`${URL_IMAGES}/quiz.gif`,
      button: [ "Դուք հավաքեցիք ", "Դասընթացներ","Առաջ", "Հետ"],
      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      question:
        "Ո՞վ էր առաջին մարդը, ով ճանապարհորդեց տիեզերք և պտտվեց Երկրի շուրջը:",
      incorrectAnswer: [
        "Առաջին մարդը, ով ճանապարհորդեց տիեզերք և պտտվեց Երկրի շուրջը, կապիտան Քրքն էր Star Trek-ից:",
        "Առաջին մարդը, ով ճանապարհորդեց տիեզերք և պտտվեց Երկրի շուրջը, հայտնի տիեզերագնաց Ամելիա Էրհարթն էր:",
        "Առաջին մարդը, ով ճանապարհորդեց տիեզերք և պտտվեց Երկրի շուրջը կին տիեզերագնաց Վալենտինա Տերեշկովան էր:",
      ],
      correctAnswer:
        "Առաջին մարդը, ով ճանապարհորդեց տիեզերք և պտտվեց Երկրի շուրջը, խորհրդային տիեզերագնաց Յուրի Գագարինն էր:",
        background:`${URL_IMAGES}/quiz.gif`,
      
      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      question:
        "Ո՞ր առաքելությունն է՝ մարդկանց առաջին վայրէջքը Լուսնի վրա, և ովքե՞ր էին ներգրավված տիեզերագնացները:",
      incorrectAnswer: [
        "Առաքելությունը, որը նշանավորեց մարդկանց առաջին վայրէջքը Լուսնի վրա, Ապոլոն 13-ն էր: Ներգրավված տիեզերագնացներն էին Թոմ Հենքսը, Քևին Բեկոնը և Բիլ Փաքսթոնը:",
        "Առաքելությունը, որը նշանավորեց մարդկանց առաջին վայրէջքը Լուսնի վրա, կոչվում էր «Moonwalkers United»: Ներգրավված տիեզերագնացներն էին Նիլ Արմսթրոնգը, Ջոն Լենոնը, Վան-Դեր-Վալսը։",
        "Առաքելությունը, որը նշանավորեց մարդկանց առաջին վայրէջքը Լուսնի վրա, կոչվում էր «Լիալուսին»: Ներգրավված տիեզերագնացներն էին Ջեյմս Բաղյանը, Հարություն Կիվիրյանը և Ալբերտ Ծերենցը:",
      ],
      correctAnswer:
        "Առաքելությունը, որը նշանավորեց առաջին անգամ, երբ մարդիկ վայրէջք կատարեցին Լուսնի վրա, Apollo 11-ն էր: Ներգրավված տիեզերագնացներն էին Նիլ Արմսթրոնգը, Բազ Օլդրինը և Մայքլ Քոլինզը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      question:
        "Ո՞րն է Hubble տիեզերական աստղադիտակի նշանակությունը տիեզերական հետազոտության մեջ:",
      incorrectAnswer: [
        "«Հաբլ» տիեզերական աստղադիտակը նշանակալի է տիեզերական հետազոտության մեջ, քանի որ այն կարող է այլմոլորակայինների և անհայտ թռչող օբյեկտների պատկերներ որսալ:",
        "«Հաբլ» տիեզերական աստղադիտակը նշանակալից է տիեզերական հետազոտության մեջ, քանի որ այն կարող է հայտնաբերել Էլիպտիկալ գալակտիկանները:",
        "Hubble տիեզերական աստղադիտակը նշանակալից է տիեզերական հետազոտության մեջ, քանի որ այն կարող է բյուրեղյա հստակ պատկերներ նկարահանել Յուպիտերի մակերեսից:",
      ],
      correctAnswer:
        "«Հաբլ» տիեզերական աստղադիտակը կարևոր նշանակություն ունի տիեզերական հետազոտության մեջ, քանի որ այն ապահովում է երկնային օբյեկտների բարձր լուծաչափով պատկերներ և մեծապես նպաստել է տիեզերքի մեր ըմբռնմանը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      question:
        "Ինչպե՞ս է ԱՄՆ-ի և Խորհրդային Միության միջև տիեզերական մրցավազքը ազդել Երկրի վրա տեխնոլոգիական առաջընթացի վրա:",
      incorrectAnswer: [
        "ԱՄՆ-ի և Խորհրդային Միության միջև տիեզերական մրցավազքը որևէ ազդեցություն չի ունեցել Երկրի վրա տեխնոլոգիական առաջընթացի վրա: Այդ ամենը հորինված պատմություն էր, որը ստեղծվել էր Հոլիվուդի կողմից:",
        "ԱՄՆ-ի և Խորհրդային Միության միջև տիեզերական մրցավազքը որևէ ազդեցություն չի ունեցել Երկրի վրա տեխնոլոգիական առաջընթացի վրա: Սա պարզապես ընկերական մրցակցություն էր:",
        "ԱՄՆ-ի և Խորհրդային Միության միջև տիեզերական մրցավազքը հանգեցրեց Երկրի ուղեծրի փոփոխության:",
      ],
      correctAnswer:
        "Միացյալ Նահանգների և Խորհրդային Միության միջև Տիեզերական մրցավազքը մեծ ազդեցություն ունեցավ Երկրի վրա տեխնոլոգիական առաջընթացի վրա, մասնավորապես օդատիեզերական ճարտարագիտության, համակարգչային տեխնոլոգիաների և հեռահաղորդակցության ոլորտներում:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      question:
        "Ո՞րն էր Apollo ծրագրի նպատակը և որո՞նք էին դրա հիմնական ձեռքբերումները:",
      incorrectAnswer: [
        "Apollo ծրագրի հիմնական նպատակն էր գտնել և հավաքել լուսնի քարեր, որոնք կարող էին օգտագործվել որպես շինանյութ Երկրի վրա:",
        "Apollo ծրագրի հիմնական նպատակն է վերաբնակեցնել Մարսը։",
        "Apollo ծրագրի հիմնական նպատակն էր Մարսի երկնակեղևի ուսումնասիրումը:",
      ],
      correctAnswer:
        "Apollo ծրագրի հիմնական նպատակն էր մարդկային վայրէջքը Լուսնի վրա և անվտանգ վերադարձը Երկիր: Նրա հիմնական ձեռքբերումները ներառում են Ապոլլո 11 Լուսնի վայրէջքը և հետագա առաքելությունները, որոնք ընդլայնեցին մեր գիտելիքները լուսնի երկրաբանության վերաբերյալ:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      question:
        "Ի՞նչ արդյունք ունեցավ Sputnik-ի արձակումը 1957 թվականին և ինչպե՞ս այն ազդեց միջազգային հարաբերությունների վրա։",
      incorrectAnswer: [
        "Sputnik-ի արձակման արդյունքը 1957թ.-ին այն էր, որ այն առաջացրեց մարդկանց միջազգային կատաղություն, որոնք փորձում էին իրենց բակերից արձակել սեփական արբանյակները:",
      ],
      correctAnswer:
        "1957 թվականին Խորհրդային Միության կողմից Sputnik-ի գործարկումը մեծ իրադարձություն էր տիեզերական հետազոտության մեջ: Այն մտահոգություն առաջացրեց Միացյալ Նահանգներում խորհրդային տեխնոլոգիական առաջընթացների վերաբերյալ և հանգեցրեց գիտության և տեխնոլոգիաների կրթության վրա մեծ շեշտադրման, ինչպես նաև ՆԱՍԱ-ի ստեղծմանը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      question:
        "Ի՞նչ դեր խաղաց տիեզերական մաքոքային ծրագիրը տիեզերքի հետազոտման մեջ, և որո՞նք էին նրա նշանավոր առաքելություններից մի քանիսը:",
      incorrectAnswer: [
        "Տիեզերական մաքոքային ծրագրի հիմնական նպատակը տիեզերագնացներին սնունդ մատակարարելն էր:",
        "Տիեզերական մաքոքային ծրագրի հիմնական նպատակն էր հեռավոր աստղերն ուսումնասիրել:",
        "Տիեզերական մաքոքային ծրագրի հիմնական նպատակը միջգալակտիկական ուսումնասիրություններ իրականացնել էր:",
      ],
      correctAnswer:
        "Տիեզերական մաքոքային ծրագիրը վճռորոշ դեր խաղաց տիեզերական հետազոտության մեջ, քանի որ այն տրամադրեց բազմակի օգտագործման տիեզերանավ տարբեր առաքելությունների համար: Նշանավոր առաքելությունները ներառում են արբանյակների տեղակայումը, Hubble տիեզերական աստղադիտակի սպասարկումը և Միջազգային տիեզերական կայանի կառուցումը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      question:
        "Որո՞նք են տիեզերքի ուսումնասիրության ներկայիս միտումները, և ինչպե՞ս են դրանք նպաստում տիեզերքի մեր ըմբռնմանը:",
      incorrectAnswer: [
        "Տիեզերական հետազոտության ներկայիս միտումները ներառում են միջգալակտիկական հաղորդակցության միջոցով այլմոլորակային քաղաքակրթությունների որոնում:",
        "Տիեզերական հետազոտության ներկայիս միտումները ներառում են Տիեզերքից Երկիր տեղափոխել օգտակար հանածոներն ու նյութերը։",
        "իեզերական հետազոտության ներկայիս միտումները ներառում են տիեզերական գանձերի քարտեզների որոնում՝ տիեզերական ոսկու թաքնված թաքստոցները հայտնաբերելու համար:",
      ],
      correctAnswer:
        "Տիեզերական հետազոտության ներկայիս միտումները ներառում են Մարսի հետազոտումը, էկզոմոլորակների ուսումնասիրությունը, բազմակի օգտագործման հրթիռների մշակումը և մասնավոր ընկերությունների աճող ներգրավվածությունը տիեզերական առաքելություններում: Այս միտումները նպաստում են տիեզերական գիտության մեր ըմբռնմանը և այլմոլորակային կյանքի որոնմանը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 1. Տիեզերական հետազոտության ներածություն",
      question:
        "Որո՞նք են տիեզերքի հետազոտման ապագա հեռանկարներն ու նպատակները, մասնավորապես՝ անձնակազմի առաքելությունները և գաղութացումը:",
      incorrectAnswer: [
        "Տիեզերական հետազոտության ապագա հեռանկարները ներառում են Լուսնի վրա տիեզերական օլիմպիական խաղերի կազմակերպումը:",
        "Տիեզերական հետազոտության ապագա հեռանկարները ներառում են Սև խոռոչների վերացումը։",
        "Տիեզերական հետազոտության ապագա հեռանկարները ներառում են տիեզերական աղբի հավաքումը Մերկուրի մոլորակում:",
      ],
      correctAnswer:
        "Տիեզերական հետազոտության ապագա հեռանկարները ներառում են մարդատար առաքելություններ դեպի Մարս, այլ երկնային մարմինների վրա մարդկանց մշտական բնակավայրերի ստեղծումը, ինչպիսիք են Լուսինը կամ Մարսը, և մեր արեգակնային համակարգի արտաքին տարածքների շարունակական հետազոտությունը: Նպատակն է ընդլայնել մարդու ներկայությունը Երկրից դուրս և հետագայում բացահայտել տիեզերքի առեղծվածները:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },

    // Lesson 2
    {
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      question:
        "Մեր Արեգակնային համակարգի ո՞ր մոլորակն ունի ամենաշատ արբանյակները և քանի՞սն են դրանք:",
      incorrectAnswer: [
        "Սատուրնն ունի ամենաշատ արբանյակները մեր Արեգակնային համակարգում՝ ընդհանուր 82 հայտնի արբանյակներով:",
        "Ուրանը մեր Արեգակնային համակարգի ամենաշատ արբանյակներն ունի՝ ընդհանուր 150 հայտնի արբանյակներով:",
        "Մարսն ունի ամենաշատ արբանյակները մեր Արեգակնային համակարգում՝ ընդհանուր 20 հայտնի արբանյակներով:",
      ],
      correctAnswer:
        "Յուպիտերն ունի ամենաշատ արբանյակները մեր Արեգակնային համակարգում՝ ընդհանուր 79 հայտնի արբանյակներով:",
      background: `${URL_IMAGES}/quiz.gif`,
      button: [ "Դուք հավաքեցիք ", "Դասընթացներ","Առաջ",],
      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      question:
        "Ո՞րն է Սատուրնի օղակների հիմնական հատկանիշը և ինչպե՞ս են դրանք ձևավորվում:",
      incorrectAnswer: [
        "Սատուրնի օղակները կազմված են ամուր ոսկու մասնիկներից, որոնք կուտակվել են հին այլմոլորակային քաղաքակրթությունների կողմից:",
        "Սատուրնի օղակները կազմված են սառցե գնդիկներից, որոնք աստիճանաբար հալվում են։",
        "Սատուրնի օղակները կազմված են հին այլմոլորակայինների տիեզերանավերի բեկորներից, որոնք բախվել են մոլորակին:",
      ],
      correctAnswer:
        "Սատուրնի օղակները կազմված են սառույցի և ապարի անհամար մանր մասնիկներից, որոնք պտտվում են մոլորակի շուրջ։ Ենթադրվում է, որ դրանք գիսաստղերի, աստերոիդների կամ փշրված արբանյակների մնացորդներ են։",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      question:
        "Ո՞ր մոլորակն ունի Արեգակնային համակարգի ամենամեծ հրաբուխը և ինչպես է նրա անունը։",
      incorrectAnswer: [
        "Վեներան ունի արեգակնային համակարգի ամենամեծ հրաբուխը, որը կոչվում է Օլիմպոս լեռ: Այն նաև ամենաբարձր հրաբուխն է՝ հասնելով մոտ 16 մղոն (26 կիլոմետր) բարձրության։",
        "Վեներան ունի արեգակնային համակարգի ամենամեծ հրաբուխը, որը կոչվում է Վեզուվիուս: Այն նաև ամենաբարձր հրաբուխն է, որի բարձրությունը հասնում է մոտ 20 մղոն (32 կիլոմետր):",
        "Երկիրն ունի արեգակնային համակարգի ամենամեծ հրաբուխը, որը կոչվում է Էվերեստ: Այն նաև ամենաբարձր հրաբուխն է, որի բարձրությունը հասնում է մոտ 29029 ֆուտի (8848 մետրի):",
      ],
      correctAnswer:
        "Մարսն ունի արեգակնային համակարգի ամենամեծ հրաբուխը, որը կոչվում է Օլիմպոս Մոնս: Այն նաև ամենաբարձր հրաբուխն է՝ հասնելով մոտ 13,6 մղոն (22 կիլոմետր) բարձրության։",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      question:
        "Ո՞րն է գաճաճ մոլորակի սահմանումը, և քանի՞սն են պաշտոնապես ճանաչվել Միջազգային աստղագիտական միության (ՄԱԳ) կողմից:",
      incorrectAnswer: [
        "Թզուկ մոլորակը երկնային մարմին է, որը պտտվում է Արեգակի շուրջ, ունի անկանոն ձև և մաքրել է իր ուղեծրը այլ բեկորներից։ Ներկայումս կան 8 ճանաչված գաճաճ մոլորակներ:",
        "Թզուկ մոլորակը երկնային մարմին է, որը պտտվում է Արեգակի շուրջ, ունի անկանոն ձև և ունի այլմոլորակային էակների բնակություն:",
        "Թզուկ մոլորակը երկնային մարմին է, որը պտտվում է լուսնի շուրջ, ունի անկանոն ձև և ունի կիսաթափանցիկ արտաքին թաղանթ։ Ներկայումս ճանաչված է 15 գաճաճ մոլորակ:",
      ],
      correctAnswer:
        "Թզուկ մոլորակը երկնային մարմին է, որը պտտվում է Արեգակի շուրջ, ունի գնդաձև տեսք: Ներկայումս կան 5 ճանաչված գաճաճ մոլորակներ՝ Պլուտոն, Էրիս, Հաումեա, Մակեմակե և Ցերերա:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      question: "Ո՞րն է տարբերությունը աստերոիդի և գիսաստղի միջև:",
      incorrectAnswer: [
        "Աստերոիդները կազմված են սառեցված գազերից, իսկ գիսաստղերը՝ ամուր քարից և մետաղից։",
        "Աստերոիդները տիեզերական հսկա ադամանդներ են, իսկ գիսաստղերը միջաստղային գնդաձև մարմիններ։",
        "Աստերոիդները հսկա կոնաձև մարմիններ են, որոնք լողում են տիեզերքում, մինչդեռ գիսաստղերը կազմված են ոսկե ապարներից և անկանոն տարածված են տիեզերքում։",
      ],
      correctAnswer:
        "Աստերոիդները քարքարոտ և մետաղական մարմիններ են, որոնք պտտվում են Արեգակի շուրջ, որոնք հիմնականում հայտնաբերված են Մարսի և Յուպիտերի միջև գտնվող աստերոիդների գոտում, մինչդեռ գիսաստղերը սառցե մարմիններ են, որոնք ծագում են Արեգակնային համակարգի արտաքին շրջաններից։",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      question:
        "Ո՞ր տիեզերանավն է այցելել գաճաճ Պլուտոն մոլորակը 2015 թվականին, և որո՞նք են եղել առաքելության ընթացքում կատարված նշանակալի հայտնագործությունները:",
      incorrectAnswer: [
        "2015 թվականին Պլուտոն այցելած տիեզերանավը Եվրոպական տիեզերական գործակալության «Ռոզետա» առաքելությունն էր։ Այն հայտնաբերել է, որ Պլուտոնն ունի թանձր մթնոլորտ և հարմար է մարդկանց գաղութացման համար:",
        "Տիեզերանավը, որն այցելեց Պլուտոն 2015 թվականին, ժամանակի ճամփորդող ռոբոտ էր՝ Բազի անունով: Կարողացավ ուսումնասիրել ռելիեֆը և ուղերկել մի քանի նկարներ։",
        "Տիեզերանավը, որն այցելեց Պլուտոն 2015 թվականին, Պլուտի տիեզերանավն էր, որը ձախողեց իր առաքելությունը։",
      ],
      correctAnswer:
        "2015 թվականին Պլուտոն այցելած տիեզերանավը ՆԱՍԱ-ի «Նոր հորիզոններ» առաքելությունն էր: Այն բացահայտեց, որ Պլուտոնն ունի բարդ երկրաբանություն՝ ներառյալ լեռները, հովիտները և նոսր մթնոլորտը։",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      question:
        "Ի՞նչ է էկզոմոլորակը և ինչպե՞ս են դրանք հայտնաբերում աստղագետների կողմից:",
      incorrectAnswer: [
        "Էկզոմոլորակը մոլորակ է, որը պտտվում է մեր արեգակնային համակարգի աստղի շուրջ: Դրանք հայտնաբերվում են հեռավոր աստղերի պատկերներ ֆիքսելով և մոլորակները նույնականացնելով՝ ելնելով դրանց գույնից:",
      ],
      correctAnswer:
        "Էկզոմոլորակը մոլորակ է, որը պտտվում է աստղի շուրջ մեր արեգակնային համակարգից դուրս: Դրանք հայտնաբերվում են տարբեր մեթոդների միջոցով, ինչպիսիք են տարանցիկ մեթոդը (աստղի լույսի մթագնում հայտնաբերելը, երբ մոլորակն անցնում է դրա դիմաց) և ճառագայթային արագության մեթոդը (չափում է աստղի տատանումները, որոնք առաջանում են ուղեծրով պտտվող մոլորակի գրավիտացիոն ձգողականության հետևանքով)։",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      question:
        "Որո՞նք են այն բնութագրերը, որոնք մոլորակը դարձնում են պոտենցիալ բնակելի:",
      incorrectAnswer: [
        "Հիմնական հատկանիշը, որը մոլորակը դարձնում է բնակելի, նրա մոտ լինելն է աստղին, իսկ ավելի մոտ մոլորակները ավելի հարմար են կյանքի համար:",
        "Հիմնական բնութագիրը, որը մոլորակը դարձնում է բնակելի, հատուկ բյուրեղային գնդիկների առկայությունն է, որը կարող է վկայել կյանքի մասին։",
        "Հիմնական հատկանիշը, որը մոլորակը դարձնում է բնակելի, միաբջիջ օրգանիզմների առկայությունն է, որպես կյանքի առաջին նմուշ։",
      ],
      correctAnswer:
        "Բնութագրերը, որոնք մոլորակը դարձնում են պոտենցիալ բնակելի, ներառում են իր աստղի «բնակելի գոտում» գտնվելը (որտեղ հնարավոր են հեղուկ ջրի համար պայմաններ), կայուն մթնոլորտ ունենալը և ամուր մակերես ունենալը։",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      question:
        "Ո՞րն է մեր արեգակնային համակարգին ամենամոտ էկզոմոլորակը, և ի՞նչ գիտենք դրա հնարավոր բնակելիության մասին:",
      incorrectAnswer: [
        "Մեր արեգակնային համակարգին ամենամոտ էկզոմոլորակը Պրոքսիմա Սենտուրի Ա-ն է, որը գտնվում է Երկրից մոտավորապես 2 լուսատարի հեռավորության վրա: Այն ունի շնչող մթնոլորտ և արդեն ուսումնասիրվել է մարդկային առաքելությունների կողմից:",
        "Մեր արեգակնային համակարգին ամենամոտ էկզոմոլորակը Պրոքսիմա Սենտուրի Բ-ն է, որը, ինչպես հայտնի է, բնակեցված է խելացի տիեզերական պինգվիններով:",
        "Մեր արեգակնային համակարգին ամենամոտ էկզոմոլորակը Պրոքսիմա Սենտուրին է, որն արդեն գաղութացվել է մարդկության կողմից։",
      ],
      correctAnswer:
        "Մեր արեգակնային համակարգին ամենամոտ էկզոմոլորակը Պրոքսիմա Սենտուրի Բ-ն է, որը պտտվում է Պրոքսիմա Սենտուրի աստղի շուրջ: Այն գտնվում է Երկրից մոտավորապես 4,24 լուսատարի հեռավորության վրա։ Նրա պոտենցիալ բնակելիությունը դեռ ուսումնասիրվում է, սակայն այն գտնվում է իր աստղի բնակելի գոտում։",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 2. Մեր Արեգակնային Համակարգը և դրանից դուրս",
      question:
        "Ո՞ր առաքելությունն է 2021 թվականին հաջողությամբ վայրէջք կատարել «Հաստատակամություն» անունով մարսագնաց Մարսի վրա, և ո՞րն է դրա առաջնային նպատակը:",
      incorrectAnswer: [
        "Առաքելությունը, որը 2021 թվականին հաջողությամբ վայրէջք կատարեց Մարսի վրա Perseverance անունով ռովերին, SpaceX-ի Starship առաքելությունն էր: Նրա առաջնային նպատակը Մարսի վրա մարդկային գաղութ հիմնելն է։",
        "Առաքելությունը, որը հաջողությամբ վայրէջք կատարեց Մարսի վրա 2021 թվականին «Հաստատակամություն» անունով ռովերին, ՆԱՍԱ-ի և միջգալակտիկական գանձ որոնողների թիմի համագործակցությունն էր: Դրա հիմնական նպատակն է գտնել հնագույն այլմոլորակային արտեֆակտներ:",
        "Առաքելությունը, որը 2021 թվականին հաջողությամբ վայրէջք կատարեց Մարսի վրա Perseverance անունով ռովերին, ղեկավարում էր Մարսի սուպերհերոսների թիմը: Դրա հիմնական նպատակն է պաշտպանել գալակտիկան այլմոլորակայինների ներխուժումներից:",
      ],
      correctAnswer:
        "Առաքելությունը, որը հաջողությամբ վայրէջք կատարեց Perseverance մարսագնացը Մարսի վրա 2021 թվականին, ՆԱՍԱ-ի Մարս 2020 առաքելությունն էր: Դրա հիմնական նպատակն է փնտրել հնագույն մանրէաբանական կյանքի նշաններ, ուսումնասիրել մոլորակի երկրաբանությունը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },

    // Lesson 3
    {
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      question:
        "Ո՞րն է Նյուտոնի շարժման երրորդ օրենքը և ինչպե՞ս է այն առնչվում հրթիռների շարժմանը:",
      incorrectAnswer: [
        "Նյուտոնի շարժման երրորդ օրենքն ասում է, որ յուրաքանչյուր գործողության համար կա հավասար և հակառակ ռեակցիա: Հրթիռի շարժման համատեքստում սա նշանակում է, որ քանի որ հրթիռը բարձր արագությամբ արտանետում է գազերը մեկ ուղղությամբ (ազդեցություն), այն ձգում է նույն ուղղությամբ (հակազդեցություն)՝ հրթիռը առաջ մղելով:",
        "Նյուտոնի շարժման երրորդ օրենքն ասում է, որ յուրաքանչյուր գործողության համար կա հավասար և հակառակ ռեակցիա: Հրթիռի շարժման համատեքստում սա նշանակում է, որ քանի որ հրթիռը բարձր արագությամբ արտանետում է գազերը մեկ ուղղությամբ (ազդեցություն), հակառակ ուղղությամբ (հակազդեցություն) գրավիտացիոն ուժ է ստանում՝ հրթիռը առաջ մղելով:",
        "Նյուտոնի երրորդ օրենքը ճիշտ չէ հրթիռային շարժման համար։",
      ],
      correctAnswer:
        "Նյուտոնի շարժման երրորդ օրենքն ասում է, որ յուրաքանչյուր գործողության համար կա հավասար և հակառակ ռեակցիա: Հրթիռի շարժման համատեքստում սա նշանակում է, որ քանի որ հրթիռը բարձր արագությամբ արտանետում է գազերը մեկ ուղղությամբ (ազդեցություն), հակառակ ուղղությամբ (հակազդեցություն) մղիչ ուժ է ստանում՝ հրթիռը առաջ մղելով:",
      background: `${URL_IMAGES}/quiz.gif`,
      button: [ "Դուք հավաքեցիք ", "Դասընթացներ","Առաջ",],
      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      question:
        "Որո՞նք են հրթիռային շարժիչ համակարգերի երկու հիմնական տեսակները, և ինչո՞վ են դրանք տարբերվում:",
      incorrectAnswer: [
        "Հրթիռային շարժիչ համակարգերի երկու հիմնական տեսակներն են՝ պինդ հրթիռային շարժիչները և հեղուկ հրթիռային շարժիչները: Պինդ հրթիռային շարժիչներն օգտագործում են մեկ հեղուկ շարժիչ, օրինակ՝ հեղուկ ջրածինը, մինչդեռ հեղուկ հրթիռային շարժիչներն օգտագործում են առանձին պինդ շարժիչներ, ինչպիսիք են վառելիքի և օքսիդիչի խառնուրդը:",
        "Հրթիռային շարժիչ համակարգերի երկու հիմնական տեսակներն են՝ պինդ հրթիռային շարժիչները և հեղուկ հրթիռային շարժիչները: Պինդ հրթիռային շարժիչներն օգտագործում են գազային շարժիչ, ինչպիսին է սեղմված օդը, մինչդեռ հեղուկ հրթիռային շարժիչները շարժման համար օգտագործում են հեղուկ վառելիքի և մագնիսական դաշտի համակցություն:",
        "Հրթիռային շարժիչ համակարգերի երկու հիմնական տեսակներն են՝ պինդ պինդ հրթիռային շարժիչները և գազային հրթիռային շարժիչներ։ Պինդ հրթիռային շարժիչներն օգտագործում են մեկ պինդ շարժիչ, օրինակ՝ վառելիքի և օքսիդիչի խառնուրդ, մինչդեռ գազային հրթիռային շարժիչներն օգտագործում են գազային շարժիչ, ինչպիսին է սեղմված օդը։",
      ],
      correctAnswer:
        "Հրթիռային շարժիչ համակարգերի երկու հիմնական տեսակներն են՝ պինդ հրթիռային շարժիչները և հեղուկ հրթիռային շարժիչները: Պինդ հրթիռային շարժիչներն օգտագործում են մեկ պինդ շարժիչ, օրինակ՝ վառելիքի և օքսիդիչի խառնուրդ, մինչդեռ հեղուկ հրթիռային շարժիչներն օգտագործում են առանձին հեղուկ շարժիչներ, ինչպիսիք են հեղուկ թթվածինը և հեղուկ ջրածինը կամ կերոսինը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      question:
        "Ո՞րն է հիմնարար տարբերությունը պինդ հրթիռային շարժիչների և հեղուկ հրթիռային շարժիչների միջև:",
      incorrectAnswer: [
        "Պինդ հրթիռային շարժիչների և հեղուկ հրթիռային շարժիչների միջև հիմնարար տարբերությունը կայանում է նրանց շարժիչային բաղադրության մեջ: Պինդ հրթիռային շարժիչները օգտագործում են մի քանի հեղուկ շարժիչներ, մինչդեռ հեղուկ հրթիռային շարժիչները օգտագործում են մեկ պինդ շարժիչ:",
      ],
      correctAnswer:
        "Պինդ հրթիռային շարժիչների և հեղուկ հրթիռային շարժիչների միջև հիմնարար տարբերությունը կայանում է նրանց շարժիչային բաղադրության մեջ: Հրթիռային պինդ շարժիչներն ունեն ֆիքսված շարժիչային խառնուրդ, որը չի կարող խափանվել կամ անջատվել բռնկվելուց հետո, մինչդեռ հեղուկ հրթիռային շարժիչները թույլ են տալիս ճշգրիտ վերահսկել մղումը` կարգավորելով հեղուկ շարժիչների հոսքի արագությունը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      question:
        "Ո՞րն է Ցիոլկովսկու հրթիռների բանաձևը և ի՞նչ է այն ներկայացնում:",
      incorrectAnswer: [
        "Հրթիռների Չայկովսկու բանաձևը մաթեմատիկական հավասարում է, որը նկարագրում է հրթիռի արտաքին ներկի գույնի և շարժման արդյունավետության միջև կապը։ Այն նշում է, որ որքան բարձր է ներկի գույնի հագեցվածությունը և պայծառությունը, այնքան մեծ է հրթիռի առաջացրած մղումը:",
        "Հրթիռների Չայկովսկու բանաձևը մաթեմատիկական հավասարում է, որը հաշվարկում է այրման ընդհանուր քանակը, որոնք կարող են արձակվել հրթիռից: Այն հաշվի է առնում հրթիռի երկարությունը, այրման խողովակների քանակը և յուրաքանչյուր այրման պայթուցիկ ուժը՝ հրթիռի առավելագույն հզորությունը որոշելու համար։",
        "Չայկովսկու հրթիռների բանաձեւը երաժշտական ստեղծագործություն է, որը ստեղծվել է հայտնի կոմպոզիտոր Պյոտր Իլյիչ Չայկովսկու կողմից։ Այն կապ չունի հրթիռների կամ տիեզերական հետազոտության հետ:",
      ],
      correctAnswer:
        "Ցիոլկովսկու հրթիռի հավասարումը, որը նաև հայտնի է որպես Չայկովսկու բանաձև, մաթեմատիկական բանաձև է, որը կապում է հրթիռի արագության (Δv) փոփոխությունը նրա շարժիչ համակարգի արդյունավետ արտանետման արագության (Ve) և սկզբնական զանգվածի (m0) հարաբերակցության հետ, մինչև հրթիռի վերջնական զանգվածը (mf): Բանաձևն արտահայտվում է հետևյալ կերպ. Δv = Ve * ln(m0/mf):Համակարգի արագությունը չի կարող գերազանցել հրթռի արագությանը։",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      question:
        "Ո՞րն է Ցիոլկովսկու բանաձևի նշանակությունն ու կիրառությունները հրթիռային ոլորտում։",
      incorrectAnswer: [
        "Չայկովսկու բանաձևը, որը նաև հայտնի է որպես Ցիոլկովսկու հրթիռային հավասարում, հիմնականում օգտագործվում է դասական երաժշտության կոմպոզիցիայի ոլորտում։ Այն ապահովում է երաժշտական նոտաների և հրթիռների կողմից առաջացած շարժիչ ուժի փոխհարաբերությունների մաթեմատիկական ներկայացում: Հրթիռի թռիչքի տարբեր փուլերին հատուկ երաժշտական հնչերանգներ վերագրելով՝ կոմպոզիտորները կարող են ստեղծել սիմֆոնիաներ, որոնք ընդօրինակում են տիեզերական հետազոտության դինամիկ շարժումը և էներգիան:",
      ],
      correctAnswer:
        "Չայկովսկու բանաձևը մեծ նշանակություն ունի հրթիռային և տիեզերական հետազոտության ոլորտում։ Այն կարևոր պատկերացումներ է տալիս հրթիռային շարժիչ համակարգերի հիմնարար ֆիզիկայի և սահմանափակումների (ունենք հրթռի շարժիչի սահմանափակում) վերաբերյալ: Օգտագործելով բանաձևը, ինժեներներն ու գիտնականները կարող են վերլուծել հրթիռի կատարողական բնութագրերը, որոշել շարժիչի անհրաժեշտ քանակությունը արագության ցանկալի փոփոխության համար և օպտիմալացնել հրթիռային շարժիչների դիզայնն ու արդյունավետությունը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      question:
        "Որո՞նք են հրթիռային շարժիչ համակարգերի հետ կապված հիմնական սահմանափակումները կամ մարտահրավերները:",
      incorrectAnswer: [
        "Հրթիռային շարժիչ համակարգերը սահմանափակումներ չունեն և կարող են անսահմանափակ բեռ տեղափոխել առանց ջանքերի: Հրթիռները կարող են աշխատել ցանկացած տեսակի վառելիքով և սահմանափակված չեն վառելիքի հատուկ պահանջներով:",
      ],
      correctAnswer:
        "Հրթիռի սահմանափակումները ներառում են ծանրաբեռնվածության հզորությունը, վառելիքի սահմանափակումները, ծախսերը, անվտանգության նկատառումները, սահմանափակ կրկնակի օգտագործման հնարավորությունը, շրջակա միջավայրի վրա ազդեցությունը, տեխնիկական բարդությունները և հեռավորությունը/ճանապարհորդությունը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      question:
        "Որո՞նք են այն հիմնական գործոնները, որոնք պետք է հաշվի առնել հրթիռի ձևը օպտիմալ աերոդինամիկ կատարման համար նախագծելիս:",
      incorrectAnswer: [
        "Օպտիմալ աերոդինամիկ կատարման համար հրթիռի ձևը նախագծելիս հիմնական գործոնները, որոնք պետք է հաշվի առնել, ներառում են լողակների քանակը և դրանք որքան հնարավոր է շատ քանակը։",
        "Օպտիմալ աերոդինամիկ կատարման համար հրթիռի ձևը նախագծելիս հիմնական գործոնները, որոնք պետք է հաշվի առնել, ներառում են հրթիռի պատուհանների չափն ու ձևը: Ավելի մեծ պատուհանները ապահովում են ավելի լավ աերոդինամիկ կայունություն:",
        "Օպտիմալ աերոդինամիկ հաշվարկներ կատարելու համար օդի դիմադրությունն ու ծանրության կետնրոնը կարելի է հաշվի չառնել։",
      ],
      correctAnswer:
        "Օպտիմալ աերոդինամիկ կատարման համար հրթիռի ձևը նախագծելիս հիմնական գործոնները, որոնք պետք է հաշվի առնել, ներառում են քթի կոնի ձևը, մարմնի տրամագիծը և լողակների ձևավորումը: Քթի հարթ կոնը նվազեցնում է դիմադրողականությունը, մինչդեռ մարմնի համապատասխան տրամագիծը և լողակները օգնում են պահպանել կայունությունը թռիչքի ընթացքում:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      question:
        "Ինչպե՞ս կարելի է զանգվածի կենտրոնը և ճնշման կենտրոնը օպտիմալացնել հրթիռի վերելքի ժամանակ կայուն թռիչք ապահովելու համար:",
      incorrectAnswer: [
        "Կայուն թռիչք ապահովելու համար զանգվածի կենտրոնը (CoM) պետք է տեղակայված լինի ճնշման կենտրոնի (CoP) հետևում: Այս դասավորությունը օգնում է հրթիռին պահպանել դեպի առաջ թեքված դիրքը և կայունանալ:",
        "Կայուն թռիչք ապահովելու համար զանգվածի կենտրոնը (CoM) պետք է տեղակայված լինի ճնշման կենտրոնից (CoP) վերև: Այս դասավորությունը օգնում է հրթիռին պահպանել ուղիղ դիրքը և կայունանալ։",
        "Կայուն թռիչք ապահովելու համար բավական է ճշգրիտ հաշվել ճնշման կենտրոնը, զանգվածների կենտրոնը կարելի է անտեսել։",
      ],
      correctAnswer:
        "Կայուն թռիչք ապահովելու համար զանգվածի կենտրոնը (CoM) պետք է տեղակայվի ճնշման կենտրոնից (CoP) առաջ: Այս դասավորությունը թույլ չի տալիս հրթիռը շրջվի օդում: CoM-ի և CoP-ի դիրքերի օպտիմալացումը կարելի է հասնել հրթիռի երկարության երկայնքով զանգվածի բաշխումը կարգավորելով:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      question:
        "Որո՞նք են այն զարգացող տեխնոլոգիաները կամ հասկացությունները, որոնք ուսումնասիրվում են հրթիռների կրկնակի օգտագործումը բարելավելու համար:",
      incorrectAnswer: [
        "Հրթիռների կրկնակի օգտագործման բարելավման զարգացող տեխնոլոգիաները ներառում են ամբողջ հրթիռի պարաշյուտի վերականգնման համակարգերի օգտագործումը ուղղահայաց վայրէջքի համակարգերի փոխարեն:",
      ],
      correctAnswer:
        "Հրթիռների կրկնակի օգտագործման բարելավման զարգացող տեխնոլոգիաները ներառում են ուղղահայաց վայրէջքի համակարգերի առաջխաղացումները, ինչպիսիք են SpaceX-ի Falcon 9 հրթիռը, որը կարող է ինքնավար վայրէջք կատարել և նորից օգտագործվել: Բացի այդ, շարունակական ջանքեր են գործադրվում ստեղծել բազմակի օգտագործման նոր շարժիչներ և տալ գիտական բացատրություն։",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 3. Հրթիռներ և շարժիչ համակարգեր",
      question:
        "Ինչպե՞ս կարող է նյութագիտության ոլորտում առաջընթացը ազդել ապագա հրթիռների նախագծման և կատարողականի վրա:",
      incorrectAnswer: [
        "Նյութագիտության առաջընթացը կարող է հանգեցնել ապագա հրթիռների համար ավելի ծանր և դիմացկուն նյութերի ստեղծմանը, ինչը կարող է բարձրացնել դրանց արժեքը և բարձրացնել դրանց արդյունավետությունը:",
        "Նյութագիտության առաջընթացը կարող է հանգեցնել ապագա հրթիռների համար ավելի ծանր և ավելի քիչ ջերմակայուն նյութերի ստեղծմանը, ինչը կարող է դրական ազդել դրանց աշխատանքի և անվտանգության համար:",
        "",
      ],
      correctAnswer:
        "Նյութագիտության առաջընթացը կարող է հանգեցնել թեթև, բայց ամուր նյութերի զարգացմանը, ինչպիսիք են ածխածնային նանոխողովակները կամ առաջադեմ կոմպոզիտները: Այս նյութերը կարող են բարելավել ապագա հրթիռների արդյունավետությունը՝ նվազեցնելով դրանց քաշը, հնարավորություն տալով ավելի մեծ բեռնատարողություն ունենալ և բարձրացնելով ընդհանուր ամրությունը:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },

    // Lesson 4
    {
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      question: "Ո՞րն է կապի արբանյակի հիմնական գործառույթը:",
      incorrectAnswer: [
        "Հաղորդակցման արբանյակները հիմնականում նախատեսված են եղանակի մոնիտորինգի և կանխատեսման համար:",
        "Կապի արբանյակները հիմնականում նախատեսված են տիեզերքում գիտական հետազոտություններ իրականացնելու համար:",
        "Կապի արբանյակները հիմնականում նախատեսված են ռազմական հսկողություն իրականացնելու համար:",
      ],
      correctAnswer:
        "Հաղորդակցման արբանյակի հիմնական գործառույթը ազդանշաններ փոխանցելն է Երկրի տարբեր վայրերի միջև՝ հեշտացնելով կապի տարբեր ձևեր, ինչպիսիք են հեռուստատեսային հեռարձակումները, հեռախոսազանգերը և ինտերնետ տվյալները:",
      background: `${URL_IMAGES}/quiz.gif`,
      button: [ "Դուք հավաքեցիք ", "Դասընթացներ","Առաջ",],
      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      question:
        "Ինչպե՞ս են եղանակային արբանյակները նպաստում օդերևութաբանական ուսումնասիրություններին:",
      incorrectAnswer: [
        "Եղանակային արբանյակները նպաստում են կանխատեսումների և մշտադիտարկմանը՝ հետևելով թռչունների միգրացիայի ձևերին և ուսումնասիրելով նրանց վարքագիծը:",
        "Եղանակային արբանյակները նպաստում են կանխատեսմանը և մոնիտորինգին` կանխատեսելով հանրաճանաչ սպորտային իրադարձությունների արդյունքները և իրական ժամանակում թարմացումներ տրամադրելով խաղերի արդյունքների վերաբերյալ:",
        "Եղանակային արբանյակները նպաստում են եղանակի կանխատեսմանը և մշտադիտարկմանը՝ վերահսկելով եղանակը՝ թույլ տալով մարդկանց պատվիրել իրենց նախընտրած կլիմայական պայմանները:",
      ],
      correctAnswer:
        "Եղանակային արբանյակները նպաստում են կանխատեսումների և մշտադիտարկմանը՝ Երկրի մթնոլորտի, ամպերի, եղանակային օրինաչափությունների և այլ օդերևութաբանական երևույթների մասին պատկերներ և տվյալներ որսալու միջոցով:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      question:
        "Ինչպե՞ս է աշխատում գրավիտացիոն մանևրը և ինչպես է այն օգտագործվում միջմոլորակային առաքելություններում:",
      incorrectAnswer: [
        "Ձգողականության օժանդակ մանևրը ներառում են հզոր մղիչներ՝ տիեզերանավը առաջ մղելու և դրա արագությունը մեծացնելու համար:",
      ],
      correctAnswer:
        "Ձգողականության օժանդակ մանևրը ներառում է երկնային մարմնի ձգողականության օգտագործումը տիեզերանավի հետագիծը փոխելու և դրա արագությունը մեծացնելու կամ նվազեցնելու համար: Այս տեխնիկան օգտագործվում է վառելիքը խնայելու և միջմոլորակային առաքելությունների ժամանակ տիեզերանավի ուղին կարգավորելու համար:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      question: "Ի՞նչ է ուղեծիրը և քանի՞ տեսակի ուղեծիրներ կան։",
      incorrectAnswer: [
        "Ուղեծիրն այն ուղին է, որով անցնում է օբյեկտը, երբ այն պտտվում է մեկ այլ օբյեկտի շուրջ՝ գրավիտացիոն ձգողության պատճառով: Գոյություն ունեն ուղեծրերի 8 հիմնական տեսակ՝ ցածր Երկրի ուղեծիր (LEO), Երկրի միջին ուղեծիր (MEO), Երկրաբանական ուղեծիր (GEO), բարձր էլիպտիկ ուղեծիր (HEO), արև-սինխրոն ուղեծիր (SSO) և Molniya ուղեծիր, Semson ուղեծիր և միջգալակտիկյան : Այս ուղեծրերի միջև հեռավորությունները տարբեր են՝ տատանվում են մի քանի հարյուր կիլոմետրից մինչև տասնյակ հազարավոր կիլոմետրեր:",
        "Ուղեծիրը համաստեղության մեջ աստղերի դասավորությունից առաջացած ձև է: Կան 8 հիմնական տեսակ՝ ցածր Երկրի ուղեծիր (LEO), Երկրի միջին ուղեծիր (MEO), Երկրաբանական ուղեծիր (GEO), բարձր էլիպտիկ ուղեծիր (HEO), արև-սինխրոն ուղեծիր (SSO) և Molniya ուղեծիր, Semson ուղեծիր և միջգալակտիկյան։",
        "Ուղեծիր գոյություն չունի, կա անծայրածիր տիեզերք առանց որևէ սահամանափակումների և արբանյակները պտտվում են անկանոն։",
      ],
      correctAnswer:
        "Ուղեծիրն այն ուղին է, որով անցնում է օբյեկտը, երբ այն պտտվում է մեկ այլ օբյեկտի շուրջ՝ գրավիտացիոն ձգողության պատճառով: Գոյություն ունեն ուղեծրերի 6 հիմնական տեսակ՝ ցածր Երկրի ուղեծիր (LEO), Երկրի միջին ուղեծիր (MEO), Երկրաբանական ուղեծիր (GEO), բարձր էլիպտիկ ուղեծիր (HEO), արև-սինխրոն ուղեծիր (SSO) և Molniya ուղեծիր: Այս ուղեծրերի միջև հեռավորությունները տարբեր են՝ տատանվում են մի քանի հարյուր կիլոմետրից մինչև տասնյակ հազարավոր կիլոմետրեր:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      question:
        "Ի՞նչ գործոններ են ազդում արբանյակի ուղեծրային ժամանակաշրջանի վրա:",
      incorrectAnswer: [
        "Արբանյակի ուղեծրային շրջանի վրա ազդող գործոններն են նրա ուղեծրի երկարությունը և կենտրոնական մարմնի զանգվածը, որի շուրջ պտտվում է:",
        "Արբանյակի գույնը անմիջական ազդեցություն ունի նրա ուղեծրային շրջանի վրա: Ուղեծրային շրջանը որոշվում է տեսողական տեսքով:",
        "Արբանյակի վրա արևային մարտկոցների քանակը ազդում նրա ուղեծրային շրջանի վրա: Արևային մարտկոցները օգտագործվում են արբանյակի աշխատանքի համար և ուղղակի ազդեցություն չունեն նրա ուղեծրի բնութագրերի վրա:",
      ],
      correctAnswer:
        "Արբանյակի ուղեծրային շրջանի վրա ազդող գործոններն են նրա ուղեծրի բարձրությունը և կենտրոնական մարմնի զանգվածը, որի շուրջ պտտվում է:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      question:
        "Ինչպե՞ս է օգտագործվում Հոհմանի փոխանցման ուղեծիրը՝ տիեզերանավը երկու շրջանաձև ուղեծրերի միջև տեղափոխելու համար:",
      incorrectAnswer: [
        "Հոհմանի փոխանցման ուղեծիրը ձեռք է բերում տիեզերանավի շարժիչները ցանկալի փոխանցման հակառակ ուղղությամբ, ինչի հետևանքով այն դանդաղում է և աստիճանաբար մտնում թիրախային ուղեծիր:",
        "Տիեզերանավը կատարում է մի շարք արագ մանևրներ և ուղեծրային շրջումներ՝ մի շրջանաձև ուղեծրից մյուսին անցնելու համար:",
        "Հոհմանի փոխանցման ուղեծիրը ներառում է տիեզերանավը ուղիղ գծով շարժվող սկզբնական և թիրախային ուղեծրերի միջև՝ առանց շարժիչի այրման անհրաժեշտության:",
      ],
      correctAnswer:
        "Հոհմանի փոխանցման ուղեծիրն օգտագործվում է տիեզերանավը երկու շրջանաձև ուղեծրերի միջև տեղափոխելու համար՝ բարձրացնելով տիեզերանավի ուղեծիրը մեկ շարժիչի այրմամբ և այնուհետև այն պտտեցնելով ցանկալի վայրում՝ մեկ այլ շարժիչի այրմամբ:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      question:
        "Ո՞րն է առաջին տիեզերական արագությունը և դրա նշանակությունը տիեզերական հետազոտության մեջ:",
      incorrectAnswer: [
        "Առաջին տիեզերական արագությունը առավելագույն արագությունն է, որով տիեզերանավը կարող է ճանապարհորդել Երկրի ուղեծրով՝ առանց խորը տիեզերք մտնելու:Այն նշանակալի է տիեզերական հետազոտության մեջ, քանի որ այն հնարավորություն է տալիս տիեզերանավերին պահպանել կայուն և շարունակական ներկայությունը տիեզերքում։",
        "Առաջին տիեզերական արագությունը վերաբերում է այն արագությանը, որով տիեզերանավը պետք է ընթանա տիեզերքում անկշռության հասնելու համար, ինչը թույլ է տալիս փորձեր կատարել միկրոգրավիտացիոն միջավայրերում:",
        "Առաջին տիեզերական արագությունը այն արագությունն է, որով տիեզերանավը կարող է հասնել լևիտացիայի՝ թույլ տալով նրան առանց ջանքերի լողալ Երկրի մթնոլորտում:",
      ],
      correctAnswer:
        "Առաջին տիեզերական արագությունը, որը նաև հայտնի է որպես ուղեծրային արագություն, նվազագույն արագությունն է, որն անհրաժեշտ է օբյեկտի համար երկնային մարմնի շուրջ կայուն ուղեծրի հասնելու համար: Այն նշանակալի է տիեզերական հետազոտության մեջ, քանի որ այն հնարավորություն է տալիս տիեզերանավերին պահպանել կայուն և շարունակական ներկայությունը տիեզերքում:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      question:
        "Ո՞ր տիեզերական զոնդն է հաջողությամբ վայրէջք կատարել Սատուրնի արբանյակի Տիտանի վրա և ի՞նչ կարևոր բացահայտումներ է նա արել:",
      incorrectAnswer: [
        "«Վոյաջեր» զոնդը հաջողությամբ վայրէջք կատարեց Սատուրնի արբանյակ Տիտանի վրա և հայտնաբերեց մեթանային լճեր և անձրևներ, մակերևույթի տարբեր առանձնահատկություններ, բարդ օրգանական մոլեկուլներ և արժեքավոր տվյալներ տվեց Տիտանի կլիմայի և եղանակային օրինաչափությունների վերաբերյալ:",
        "«Գալիլեո» զոնդը հաջողությամբ վայրէջք կատարեց Սատուրնի արբանյակ Տիտանի վրա և գտավ հնագույն կյանքի նոր ձևեր:",
        "«Սպիրիտ» մարսագնացը հաջողությամբ վայրէջք կատարեց Սատուրնի արբանյակի վրա և հայտնաբերեց ընդարձակ ստորգետնյա օվկիանոս:",
      ],
      correctAnswer:
        "«Հյուգենս» զոնդը բարեհաջող վայրէջք է կատարել Սատուրնի արբանյակ Տիտանի վրա: Այն հայտնաբերեց խիտ ազոտով հարուստ մթնոլորտ, մեթանային լճեր և անձրևներ, մակերևույթի տարբեր առանձնահատկություններ, բարդ օրգանական մոլեկուլներ և արժեքավոր տվյալներ տվեց Տիտանի կլիմայի և եղանակային օրինաչափությունների վերաբերյալ:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      question:
        "Որո՞նք են «Վոյաջեր» տիեզերանավի առաքելությունների հիմնական նպատակները:",
      incorrectAnswer: [
        "«Վոյաջեր» տիեզերանավի առաքելությունների հիմնական նպատակն էր գտնել հնագույն կյանքի ձևեր Սատուրնի արբանյակներից մեկում:",
        "«Վոյաջեր» տիեզերանավի առաքելությունների հիմնական նպատակներն էին Նեպտունի վրա կորած Ատլանտիս քաղաքի որոնումը:",
        "«Վոյաջեր» տիեզերանավերի առաքելությունների հիմնական նպատակն էր հայտնաբերել գաղտնի միջգալակտիկական պորտալ, որը թաքնված էր Սատուրնի օղակներում:",
      ],
      correctAnswer:
        "«Վոյաջեր» տիեզերանավերի առաքելությունների հիմնական նպատակներն էին ուսումնասիրել մեր արեգակնային համակարգի արտաքին մոլորակները և նրանց արբանյակները:",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
    {
      lesson: "Դաս 4. Տիեզերանավ և առաքելություններ",
      question:
        "Որո՞նք էին Մարսի վրա Curiosity մարսագնացի հիմնական նպատակները:",
      incorrectAnswer: [
        "Մարսի վրա Curiosity մարսագնացի հիմնական նպատակն էր փնտրել այլմոլորակային կյանքի ձևեր և կապեր հաստատել:",
        "Մարսի վրա Curiosity-ի հիմնական նպատակը փնտրել և բացահայտել մարսյան մասունքներ:",
        "Մարսի վրա Curiosity-ի հիմնական նպատակն էր փնտրել և գտնել Mars rover-ի թողած դրոշը։",
      ],
      correctAnswer:
        "Մարսի վրա Curiosity մարսագնացի հիմնական նպատակներն էին գնահատել մոլորակի նախկին կամ ներկա բնակելիությունը, ուսումնասիրել նրա երկրաբանությունը, ուսումնասիրել ջրի դերը և բացահայտել պոտենցիալ կենսահամակարգերը։",
      background: `${URL_IMAGES}/quiz.gif`,

      created_at: new Date().toISOString(),
    },
  ]);



await pg('satellite_questions').insert([
  {
    lesson: `1U հարցաշար`,
    background:`${URL_IMAGES}/quiz.gif`,
    question: `Ի՞նչ է նշանակում «1U»-ն արբանյակների համատեքստում:`,
    incorrectAnswer: [`«1U»-ը վերաբերում է CubeSats-ի չափման ստանդարտ միավորին, որը
    ներկայացնում է 10 մմ x 10 մմ x 10 մմ ծավալ:`,
    `«1U» նշանակում է «Մեկ տիեզերք», ինչը ենթադրում է, որ արբանյակն ունի
    բազմաթիվ չափումներ անցնելու և զուգահեռ տիեզերքներ ուսումնասիրելու
    ունակություն:`,
    `«1U» նշանակում է «Մեկ տիեզերք», ինչը ենթադրում է, որ արբանյակն ունի
    հստակ չափեր (10 սմ x 10 սմ x 10 սմ) և զուգահեռ տիեզերքներ
    ուսումնասիրելու ունակություն:`],
    correctAnswer: `«1U»-ը վերաբերում է CubeSats-ի չափման ստանդարտ միավորին, որը
    ներկայացնում է 10 սմ x 10 սմ x 10 սմ ծավալ:`,
    button: [ "Դուք հավաքեցիք ", "Արբանյակ","Առաջ", "Հետ"],

    created_at: new Date().toISOString(),
  },
  {
    lesson: `1U հարցաշար`,
    question: `Ի՞նչ նյութեր են սովորաբար օգտագործվում 1U արբանյակային կառույցների
    կառուցման մեջ:`,
    incorrectAnswer: [`1U CubeSat-ի արտաքին կառուցվածքը սովորաբար պատրաստված է
    տիտանից և այլ թեթև դիմացկուն նյութերից:`,
    `1U CubeSat-ի արտաքին կառուցվածքը սովորաբար պատրաստված է
    երկաթից և այլ ծանր նյութերից:`,
    `1U CubeSat-ի արտաքին կառուցվածքը սովորաբար պատրաստված է
    անագից և այլ ծանր նյութերից:`],
    correctAnswer: `1U CubeSat-ի արտաքին կառուցվածքը սովորաբար պատրաստված է
    ալյումինից կամ այլ թեթև դիմացկուն նյութերից:`,
    button: [ "Դուք հավաքեցիք ", "Արբանյակ","Առաջ", "Հետ"],

    created_at: new Date().toISOString(),
  },
  {
    lesson: `1U հարցաշար`,
    question: `Ո՞ր բաղադրիչներն են սովորաբար տեղակայված 1U արբանյակի կառուցվածքում:`,
    incorrectAnswer: [`1U արբանյակի կառուցվածքը սովորաբար պարունակում է միայն
    էլեկտրաէներգիայի ենթահամակարգը, կապի ենթահամակարգը և
    օգտակար բեռները:`,
    `1U արբանյակի կառուցվածքը սովորաբար պարունակում է միայն
    էլեկտրաէներգիայի ենթահամակարգը, դիրքորոշման և կառավարման
    ենթահամակարգը և օգտակար բեռները:`,
    `1U արբանյակի կառուցվածքը սովորաբար պարունակում է տվյալների
    մշակման ենթահամակարգեր, կապի ենթահամակարգեր, սենսորներ և
    օգտակար բեռներ:`],
    correctAnswer: `1U արբանյակի կառուցվածքը սովորաբար պարունակում է տվյալների
    մշակման ենթահամակարգ, էլեկտրաէներգիայի ենթահամակարգ,
    դիրքորոշման և կառավարման ենթահամակարգ, հաղորդակցման
    ենթահամակարգ, սենսորներ և օգտակար բեռներ:`,
    button: [ "Դուք հավաքեցիք ", "Արբանյակ","Առաջ", "Հետ"],

    created_at: new Date().toISOString(),
  },
  {
    lesson: `1U հարցաշար`,
    question: `Ո՞րն է օգտակար բեռը 1U Cubesat-ում:`,
    incorrectAnswer: [`1U Cubesat-ի օգտակար բեռը արբանյակի էներգիայի աղբյուրն է:`,
    `1U Cubesat-ում օգտակար բեռը արբանյակի արտաքին կառուցվածքն է կամ
    կմախքը:`,
    `1U Cubesat-ի օգտակար բեռը արբանյակը մանևրելու շարժիչ համակարգ է:`],
    correctAnswer: `1U Cubesat-ում օգտակար բեռը վերաբերում է արբանյակի կողմից
    իրականացվող հիմնական առաքելության սարքավորումներին կամ
    փորձին: Այն կարող է տարբեր լինել՝ կախված առաքելության հատուկ
    նպատակներից, ինչպիսիք են տեսախցիկները՝ պատկերման համար,
    տվյալների հավաքագրման սենսորները կամ ազդանշանների փոխանցման
    համար կապի սարքավորումները:`,
    button: [ "Դուք հավաքեցիք ", "Արբանյակ","Առաջ", "Հետ"],

    created_at: new Date().toISOString(),
  },
  {
    lesson: `1U հարցաշար`,
    question: `Բաժանման քանի՞ փուլ է անցնում հրթիռը մինչև ուղեծիր հասնելը:`,
    incorrectAnswer: [`Հրթիռը սովորաբար անցնում է բաժանման երեք փուլով մինչև ուղեծիր
    հասնելը:`,
    `Հրթիռը սովորաբար անցնում է բաժանման չորս փուլով մինչև ուղեծիր
    հասնելը:`,
    `Հրթիռը սովորաբար անցնում է բաժանման մեկ փուլով մինչև ուղեծիր
    հասնելը:`],
    correctAnswer: `Հրթիռը սովորաբար անցնում է բաժանման երկու փուլով մինչև ուղեծիր
    հասնելը:`,
    button: [ "Դուք հավաքեցիք ", "Արբանյակ","Առաջ", "Հետ"],

    created_at: new Date().toISOString(),
  },
  {
    lesson: `1U հարցաշար`,
    question: `Ո՞րն է Միջազգային տիեզերակայանից (ISS) 1U արբանյակների տեղակայման
    առավելությունը:`,
    incorrectAnswer: [`ISS-ից 1U արբանյակների տեղակայումը թույլ է տալիս ավելի արագ կապ
    հաստատել Երկրի հետ:`,
    `ISS-ից 1U արբանյակների տեղակայումը մեծացնում է արբանյակների
    պահեստավորման հզորությունը:`,
    `ISS-ից 1U արբանյակների տեղակայումը թույլ է տալիս ավելի երկար
    առաքելություն իրականացնել:`],
    correctAnswer: `Միջազգային տիեզերակայանից (ISS) 1U արբանյակներ տեղակայելու
    առավելությունն այն է, որ հնարավորություն է օգտագործել ISS-ի
    ստեղծված ենթակառուցվածքը և ռեսուրսները, ինչպիսին է ռոբոտային
    թեւը, արբանյակները տիեզերք անվտանգ և ճշգրիտ բաց թողնելու համար:`,
    background:`${URL_IMAGES}/giphy.gif`,
    button: [ "Դուք հավաքեցիք ", "Արբանյակ","Առաջ", "Հետ"],
    created_at: new Date().toISOString(),
  },
  {
    lesson: `1U հարցաշար`,
    question: `Ինչպե՞ս են 1U արբանյակները կապ հաստատում Միջազգային տիեզերակայանի
    (ISS) հետ:`,
    incorrectAnswer: [`1U արբանյակները կապ են հաստատում ISS-ի հետ՝ օգտագործելով
    օպտիկական լազերային կապի համակարգեր:`,
    `1U արբանյակները կապ են հաստատում ISS-ի հետ ֆիզիկական լարային
    կապերի միջոցով:`,
    `1U արբանյակները կապ են հաստատում ISS-ի հետ՝ օգտագործելով
    արբանյակային հեռախոսային ցանցերը:`],
    correctAnswer: `1U արբանյակները կապ են հաստատում Միջազգային տիեզերակայանի
    (ՄՏԿ) հետ՝ օգտագործելով ռադիոհաճախականության (ՌՀ) հաղորդակցման
    համակարգեր: Նրանք օգտագործում են հատուկ հաճախականություններ և
    արձանագրություններ՝ ISS-ի կամ ցամաքային կայանների հետ
    երկկողմանի կապ հաստատելու համար:`,
    background:`${URL_IMAGES}/giphy.gif`,
    button: [ "Դուք հավաքեցիք ", "Արբանյակ","Առաջ", "Հետ"],
    created_at: new Date().toISOString(),
  },
  {
    lesson: `1U հարցաշար`,
    question: `Ո՞ր ուղեծրում են գտնվում 1U արբանյակները:`,
    incorrectAnswer: [`1U արբանյակները սովորաբար տեղակայվում են միջին Երկրի ուղեծրում
    (MEO):`,
    `1U արբանյակները սովորաբար տեղակայվում են գեոստացիոնար
    ուղեծրում (GEO):`,
    `1U արբանյակները սովորաբար տեղակայվում են բևեռային ուղեծրում:`],
    correctAnswer: `1U արբանյակները սովորաբար տեղակայվում են ցածր Երկրի ուղեծրում
    (LEO):`,
    background:`${URL_IMAGES}/giphy.gif`,
    button: [ "Դուք հավաքեցիք ", "Արբանյակ","Առաջ", "Հետ"],
    created_at: new Date().toISOString(),
  },
  {
    lesson: `1U հարցաշար`,
    question: `Որքա՞ն է տևում 1U արբանյակային առաքելությունը:`,
    incorrectAnswer: [`1U արբանյակային առաքելության տևողությունը սովորաբար տևում է մի
    քանի օր:`,
    `1U արբանյակային առաքելության տևողությունը սովորաբար տևում է մի
    քանի ժամ:`,
    `1U արբանյակային առաքելության տևողությունը սովորաբար տևում է
    անորոշ ժամանակով:`],
    correctAnswer: `1U արբանյակային առաքելության տևողությունը կարող է տարբեր լինել,
    բայց այն սովորաբար տևում է մի քանի ամսից մինչև մի քանի տարի:`,
    background:`${URL_IMAGES}/giphy.gif`,
    button: [ "Դուք հավաքեցիք ", "Արբանյակ","Առաջ", "Հետ"],
    created_at: new Date().toISOString(),
  },
  {
    lesson: `1U հարցաշար`,
    question: `Ինչ նպատակով են օգտագործվում 1U արբանյակները:`,
    incorrectAnswer: [`1U արբանյակները շատ փոքր տիեզերանավ են, որոնք օգտագործվում են
    միջմոլորակային գաղութացման համար:`,
    `1U արբանյակները օգտագործվում են բացառապես միջգալակտիկական
    ճանապարհորդության համար:`,
    `1U արբանյակները օգտագործվում են ժամանակի ճամփորդության
    փորձերի համար:`],
    correctAnswer: `1U արբանյակները սովորաբար օգտագործվում են տարբեր նպատակներով,
    ինչպիսիք են Երկրի դիտումը, տեխնոլոգիաների ցուցադրումը, գիտական
    հետազոտությունը, հաղորդակցությունը և կրթական առաքելությունները:`,
    background:`${URL_IMAGES}/giphy.gif`,
    button: [ "Դուք հավաքեցիք ", "Արբանյակ","Առաջ", "Հետ"],
    created_at: new Date().toISOString(),
  },

])


  await pg('about').insert([
    {
      title: "Մեր Մասին",
      image: `${URL_IMAGES}/mission-top-image.png`,
      created_at: new Date().toISOString(),
    },
    {
      title: "Մեր թիմը",
      image: `${URL_IMAGES}/icon1.png`,
      text: "Space Minds-ում մենք հպարտանում ենք նվիրված մասնագետների մեր բացառիկ թիմով, ովքեր լավագույնն են իրենց գործում: Թույլ տվեք ձեզ ներկայացնել մեր թիմի հիմնական անդամներին:",
      more: "Ավելին",
      created_at: new Date().toISOString(),
    },
    {
      title: "Մեր նպատակը",
      image: `${URL_IMAGES}/icon2.png`,
      text: "Մեր արտադրանքը հնարավորություն կտա երեխաներին ուսումնասիրել տիեզերական ճարտարագիտությանն ու նորարարությունը, և նրանք կարող են ստեղծել սեփական ինժեներական սարքը:",
      more: "Ավելին",
      created_at: new Date().toISOString(),
    },
    {
      image: `${URL_IMAGES}/vv.png`,
      created_at: new Date().toISOString(),
    },
    {
      image: `${URL_IMAGES}/cubesat.png`,
      created_at: new Date().toISOString(),
    },
  ]);

  // await pg('cubesat_control').insert([
  //   {
  //     title: 'cubesat',
  //     url: 'cubesat',
  //     created_at: new Date().toISOString(),
  //   },
  // ]);

  // await pg('games').insert([
  //   {
  //     title: 'game',
  //     url: 'comming soon',
  //     created_at: new Date().toISOString(),
  //   },
  // ]);

  await pg("our_team").insert([
    {
      name: "Մհեր Մեհրաբյան",
      image: `${URL_IMAGES}/IMAGE2023-05-30152946.jpg`,
      text: "Ղեկավար - հիմնադիր",
      created_at: new Date().toISOString(),
    },
    {
      name: "Վիգեն Մեհրաբյան",
      image: `${URL_IMAGES}/Screenshot2023-06-01at12.39.22.png`,
      text: "Պրոյեկտի մենեջեր",
      created_at: new Date().toISOString(),
    },
    {
      name: "Վահե Սաքեյան",
      image: `${URL_IMAGES}/IMAGE2023-05-30152509.jpg`,
      text: "Համակարգի ինժեներ",
      created_at: new Date().toISOString(),
    },
    {
      name: "Նելլի Փափազյան",
      image: `${URL_IMAGES}/IMAGE2023-05-30160438.jpg`,
      text: "Աերոտիեզերական ինժեներ",
      created_at: new Date().toISOString(),
    },
    {
      name: "Կարեն Կարապետյան",
      image: `${URL_IMAGES}/Screenshot2023-06-01at12.45.02.png`,
      text: "Ծրագրային ապահովման ինժեներ",
      created_at: new Date().toISOString(),
    },
    {
      name: "Հրաչ Յարալյան",
      image: `${URL_IMAGES}/IMAGE2023-05-30153344.jpg`,
      text: "Ծրագրավորող",
      created_at: new Date().toISOString(),
    },
    {
      name: "Հովհաննես Սարդարյան",
      image: `${URL_IMAGES}/HovSar.png`,
      text: "Էլկտրո ինժեներ",
      created_at: new Date().toISOString(),
    },
    {
      name: "Սերոբ Խաչատրյան",
      image: `${URL_IMAGES}/IMAGE2023-05-30154252.jpg`,
      text: "PCB նախագծող",
      created_at: new Date().toISOString(),
    },
    {
      name: "Զոհրաբ Միրզոյան",
      image: `${URL_IMAGES}/IMAGE2023-05-30154806.jpg`,
      text: "3D անիմատոր",
      created_at: new Date().toISOString(),
    },
    {
      name: "Վազգեն Մամյան",
      image: `${URL_IMAGES}/IMAGE2023-05-31140824.jpg`,
      text: "Մարկետոլոգ",
      created_at: new Date().toISOString(),
    },
  ]);

  await pg("our_partners").insert([
    {
      title: "partner",
      image: `${URL_IMAGES}/xatuba.jpg`,
      text: "partner",
      created_at: new Date().toISOString(),
    },
    {
      title: "partner",
      image: `${URL_IMAGES}/xatuba.jpg`,
      text: "partner",
      created_at: new Date().toISOString(),
    },
  ]);
 
  await pg("satelite").insert([
    {
      title: '1U արբանյակ',
      background:`${URL_IMAGES}/giphy.gif`,
  
        text1: [
          `1U արբանյակը նանոարբանյակի մի տեսակ է, որը ունի խորանարդաձև տեսք։ «1U»
          նշումը ցույց է տալիս, որ արբանյակի չափը 1 միավոր է, յուրաքանչյուր միավորի
          չափերը՝ 10 սմ x 10 սմ x 10 սմ (կամ 4 դույմ):`,
  
          `CubeSats-ը, ներառյալ 1U արբանյակները, բնութագրվում են իրենց փոքր չափերով, թեթև
          կառուցվածքով և ցածր գնով: Եվ բավականին ճանաչում են ձեռք բերել վերջին
          տարիներին՝ շնորհիվ իրենց հասանելիության, արագ զարգացման ցիկլի և տիեզերական
          հետազոտության, գիտական հետազոտությունների, տեխնոլոգիաների ցուցադրման և
          կրթության ոլորտում կիրառությունների լայն շրջանակի:`,
  
          `1U արբանյակը ծառայում է որպես հիմնական միավոր CubeSat ստանդարտի
          շրջանակներում, որը թույլ է տալիս հեշտ ինտեգրվել և համատեղելի լինել այլ CubeSat
          չափերի հետ, ինչպիսիք են 2U (1U-ի կրկնակի չափը), 3U, 6U և նույնիսկ ավելի մեծ
          չափեր: Յուրաքանչյուր CubeSat չափս առաջարկում է տարբեր հնարավորություններ և
          կարողություններ՝ կախված օգտագործվող միավորների քանակից:`
  
        ],
        animationCubeSat1: `${URL_VIDEOS}/Space_Minds_1.mp4`,
  
        text2: [
          `1U արբանյակները կարող են համալրվել տարբեր ենթահամակարգերով, ինչպիսիք են
          տվյալների մշակման ենթահամակարգը, էլեկտրաէներգիայի ենթահամակարգ,
          դիրքորոշման և կառավարման ենթահամակարգ, հաղորդակցման ենթահամակարգ,
          սենսորները և օգտակար բեռները: Այս ենթահամակարգերը թույլ են տալիս արբանյակին
          կատարել հատուկ գործառույթներ, ինչպիսիք են Երկրի դիտարկումը, տվյալների
          հավաքագրումը, տեխնոլոգիաների փորձարկումը կամ կապի փորձերը:`,
  
          `Կարևոր է նշել, որ 1U CubeSat-ի ներքին կառուցվածքը կարող է տարբեր լինել՝ կախված
          առաքելության պահանջներից և ընտրված կոնկրետ բաղադրիչներից: Ահա որոշ
          բաղադրիչներ, որոնք սովորաբար հանդիպում են 1U արբանյակում.`
        ],
  
        margin_text1: [
          `● Կառուցվածք. 1U CubeSat-ի արտաքին կառուցվածքը սովորաբար պատրաստված է
          ալյումինից կամ այլ թեթև նյութերից: Այն ապահովում է կառուցվածքային
          ամբողջականություն և պաշտպանություն ներքին բաղադրիչների:`,
  
          `● Տվյալների մշակման ենթահամակարգ. Տվյալների մշակման ենթահամակարգը
          արբանյակի կամ տիեզերանավի անբաժանելի մասն է, որը պատասխանատու է
          արբանյակի սենսորների, գործիքների կամ օգտակար բեռի (Payload) կողմից
          հավաքագրված տվյալների մշակման և մշակման համար: Այն կենսական դեր է
          խաղում չմշակված տվյալները օգտագործելի տեղեկատվության վերածելու և
          դրանք համապատասխան նպատակակետ փոխանցելու գործում:
          Ներքին համակարգիչը ծառայում է որպես 1U արբանյակի կենտրոնական
          մշակման միավոր: Այն կառավարում է տվյալների մշակման առաջադրանքները,
          վերահսկում է տարբեր ենթահամակարգերը, կատարում է ծրագրային հրամաններ
          և կարգավորում է հաղորդակցությունը այլ համակարգերի հետ: Համակարգիչը
          կարող է բաղկացած լինել միկրոկառավարիչից կամ փոքր ներկառուցված
          համակարգից, որը կարող է գործարկել անհրաժեշտ ծրագրային ալգորիթմներ:`,
  
          `● Էլեկտրասնուցման ենթահամակարգ. արբանյակը ներառում է
          1U էլեկտրասնուցման համակարգ՝ էլեկտրաէներգիա ստեղծելու և բաշխելու համար:
          Այն սովորաբար ներառում է էլեկտրաէներգիայի արտադրության համար
          նախատեսված արևային մարտկոցներ, որոնք տեղադրված են CubeSat-ի
          արտաքին մակերեսների վրա և վերալիցքավորվող մարտկոցներ էներգիայի
          պահպանման համար: Էլեկտրաէներգիայի բաշխման սխեմաները ապահովում են,
          որ տարբեր ենթահամակարգեր ստանան անհրաժեշտ հզորությունը կամ
          էլեկտարէներգիա:`,
  
          `● Դիրքորոշման և կառավարման ենթահամակարգ. Սա արբանյակի կամ
          տիեզերանավի կարևոր ենթահամակարգ է, որը պատասխանատու է
          տիեզերանավի ցանկալի դիրքորոշման և պահպանման համար: Դիրքորոշման և
          կառավարման ենթահամակարգը ապահովում է արբանյակի ճիշտ կողմնորոշումը՝
          ուղղված ցանկալի ուղղությամբ և ապահովում է կայունությունը իր առաքելության
          ընթացքում:`,
  
          `● Կապի և Հաղորդակցման ենթահամակարգ. 1U CubeSat-ի հաղորդակցման
          ենթահամակարգը հնարավորություն է տալիս կապեր հաստատել վերգետնյա
          կայանների կամ այլ արբանյակների հետ: Այն սովորաբար ներառում է ալեհավաք՝
          ռադիոազդանշաններ փոխանցելու և ստանալու համար, հաղորդիչ՝ ազդանշանների
          մոդուլյացիայի և դեմոդուլյացիայի համար և կապի
          արձանագրություններ: Հաղորդակցման համակարգը թույլ է տալիս CubeSat-ին
          տվյալներ ուղարկել վերգետնյա կայան, ստանալ հրամաններ և հնարավոր է
          ներգրավվել այլ արբանյակների հետ տվյալների փոխանցման մեջ:`,
  
          `● Սենսորներ և օգտակար բեռ. 1U CubeSat-ը կարող է կրել տարբեր սենսորներ՝ իր
          միջավայրի մասին տվյալներ հավաքելու կամ հատուկ չափումներ կատարելու
          համար: Այս սենսորները կարող են ներառել տեսախցիկներ՝ պատկերման համար,
          սպեկտրոմետրեր՝ լույսը վերլուծելու համար, մագնիսաչափեր՝ մագնիսական
          դաշտերը չափելու համար, կամ շրջակա միջավայրի սենսորներ՝ ջերմաստիճանի,
          ճնշման կամ ճառագայթման մակարդակները վերահսկելու համար: Բացի այդ,
          CubeSat-ը կարող է տեղակայել օգտակար բեռ, որը ներկայացնում է առաքելության
          հիմնական նպատակը: Բեռը կարող է ներառել գիտական գործիքներ,
          տեխնոլոգիական ցուցադրություններ կամ փորձեր:`
  
        ],
        animationCubeSat2: `${URL_VIDEOS}/Space_Minds_2.mp4`,
        text3: [
          `Թռիչքարկում (Launch) դեպի տիեզերք.`,
          `1U փոքր արբանյաները պատրաստ լինելուն պես անցելով բոլոր թեստավորումները պատրաստվում
          է հրիթիռով ուղեծիր դուրս գալուն։
          Երբ արդեն CubeSat-ը պատրաստ է, դիսպենսերի մեջ է և ամենիչ կարգին է (ներառյալ
          եղանակային պայմաներ և այլ պատահարներ) սկսվում է թռիչքի հետհաշվարկը, հրթիռը
          հետհաշվարկով սկսում է թռիչքը, մեկնարկից հետո մի քանի մետր բարձրանալուց հետո
          հրթիռը ընդունում է համապասխան անկյունը ուղեծիր դուրս գալու համար սովորաբար
          մինչ ուղեծիր հասնելը հրթիռը բաժանվում երկու փուլով բաժանումից հետո հասնելով
          ուղեծրի համապասխան բարձրությանը համապատասխան անկյան տակ Օգտակար
          բեռը-ը (Payload) էլեկտրական ազդանշան է ուղարկում դիսպենսերին , այնուհետև
          բացվում է դուռը և CubeSat-ը բաց է թողնվում ուղեծիր։`,
  
          `CubeSats-ը, ներառյալ 1U արբանյակները, սովորաբար արձակվում են ավելի մեծ
          հրթիռների վրա որպես երկրորդական բեռներ: Առաջնային օգտակար բեռը սովորաբար
          ավելի մեծ արբանյակ է կամ գիտական գործիք, իսկ CubeSat-ները տեղավորվում են
          տեղակայման համակարգում կամ դիսպենսերում:`,
  
          'Ահա մի քանի մանրամասներ գործարկման գործընթացի վերաբերյալ.'
        ],
  
        margin_text2: [
          `● Ինտեգրում. թռիչքարկումից առաջ 1U CubeSat-ը ինտեգրված է տեղակայող կամ
          դիսպենսերային համակարգին: Տեղակայողը (Deployer) նախագծված է մի քանի
          CubeSat-ներ ապահով պահելու և համապատասխան ժամանակին դրանք տիեզերք
          բաց թողնելու համար:`,
  
          `● Տեղակայում. առաջնային օգտակար բեռ տիեզերք է ուղարկվում հրթիռով, և երբ
          այն հասնում է ցանկալի ուղեծրին, տեղակայող համակարգը բաց է թողնում
          CubeSats-ը: Դրան կարելի է հասնել տարբեր մեխանիզմների միջոցով, ինչպիսիք
          են զսպանակով բեռնված տեղակայումը, օդաճնշական արտանետումը կամ
          մեխանիկական բաժանման համակարգերը: CubeSats-ը կարող է տեղակայվել
          միաժամանակ կամ հաջորդաբար՝ կախված առաքելության պահանջներից:`,
  
          `● Գործարկման տարբերակներ. CubeSats-ը կարող է տեղակայվել տարբեր
          արձակման մեքենաներից, ներառյալ ուղեծրային հրթիռներից
          կամ մատակարարման տիեզերանավերից, որոնք մեկնում են
          Միջազգային տիեզերակայան (ISS): CubeSats-ի գործարկման հնարավորությունները վերջին
          տարիներին ավելացել են, երբ հասանելի են դարձել հատուկ CubeSat
          գործարկիչները:`
        ],
  
        text4: [
          `Տիեզերական կայանի հետ հաղորդակցություն.`,
          `1U արբանյակի և տիեզերական կայանի միջև, ինչպիսին է 
          Միջազգային տիեզերական կայանը (ISS), հաղորդակցությունը
          ձեռք է բերվում ռադիոհաճախականության կապերի միջոցով: Ահա մի քանի լրացուցիչ
          մանրամասներ հաղորդակցման գործընթացի վերաբերյալ.`
        ],
  
        margin_text3: [
          `● Հաճախականության
          տիրույթներ. CubeSats-ը հաղորդակցության համար
          օգտագործում է հատուկ հաճախականությունների գոտիներ, ինչպիսիք են UHF
          (Ուլտրա բարձր հաճախականության) կամ VHF (շատ բարձր հաճախականության)
          տիրույթները: Այս հաճախականության գոտիները հատկացված են տիեզերական
          հաղորդակցության համար և ունեն հատուկ կանոնակարգեր:`,
  
          `● Ստորգետնյա կայաններ. CubeSats-ը LEO-ում շփվում է Երկրի ցամաքային
          կայանների հետ: Ցամաքային կայանները հագեցած են մեծ ալեհավաքներով,
          ռադիոընդունիչներով և հաղորդիչներով՝ CubeSats-ի հետ կապ հաստատելու
          համար: Այս վերգետնյա կայանները կարող են շահագործվել կրթական
          հաստատությունների, մասնավոր ընկերությունների կամ տիեզերական
          գործակալությունների կողմից:`,
  
          `● ISS հաղորդակցություն. CubeSats-ը կարող է կապ հաստատել ISS-ի հետ
          Սիրողական ռադիո ծառայության միջոցով: Այս ծառայությունը թույլ է տալիս
          արտոնագրված սիրողական ռադիոօպերատորներին հաղորդակցվել ISS-ի և
          CubeSats-ի հետ՝ օգտագործելով հատուկ հաճախականություններ և
          արձանագրություններ: CubeSats-ը, որը տեղակայված է ISS-ից, կարող է օգտվել
          կայանի ենթակառուցվածքից, ներառյալ դրա ալեհավաքները և կապի
          սարքավորումները:`,
  
          `● Վերգետնյա կայաններ. CubeSats-ը փոխանցում է իրենց հավաքած կամ ստեղծած
          տվյալները վերգետնյա կայաններ կամ տիեզերակայան: Ստացված տվյալները
          հետագայում մշակվում և վերլուծվում են գիտական կամ գործառնական
          նպատակներով: CubeSats-ը սովորաբար տվյալները փոխանցում է փաթեթներով,
          որոնք ստացվում և հավաքվում են վերգետնյա կայանների կողմից՝ սկզբնական
          տեղեկատվությունը վերակառուցելու համար:`
        ],
  
        animationCubeSat3: `${URL_VIDEOS}/Space_Minds_3.mp4`,
  
        text5: [
          `Արբանյակն ուղեծրում.`,
          `1U արբանյակը սովորաբար գործում է Երկրի ցածր ուղեծրում
          (LEO), այս ուղեծրերը համեմատաբար մոտ են Երկրի մակերեսին, սովորաբար
          տատանվում են Երկրից մոտ 160 կմ (100 մղոն) մինչեւ 2000 կիլոմետր (1200 մղոն)
          բարձրության վրա:
          LEO-ն սովորաբար օգտագործվում է արբանյակային
          հաղորդակցության, Երկրի դիտարկման և տիեզերական առաքելությունների համար,
          ինչպիսիք են Միջազգային տիեզերական կայանը (ISS):`
        ],
        animationCubeSat4: `${URL_VIDEOS}/Space_Minds_4.mp4`,
  
        margin_text4: [
          `● Առաքելության տևողությունը. 1U արբանյակի առաքելության տևողությունը
          կարող է տարբեր լինել՝ կախված այնպիսի գործոններից, ինչպիսիք են դրա
          դիզայնը, էներգիայի մատակարարումը և նախատեսված նպատակները:
          Ընդհանրապես, 1U արբանյակները կարող են ուղեծրում մնալ ամիսներով մինչև
          մի քանի տարի։`
        ]
      
  
      
    }])
}

async function init() {
  try {
    const options =
      process.env.NODE_ENV === "production"
        ? knexConfigs.production
        : knexConfigs.development;
    const pg = knex(options);
    await seed(pg);
    console.log("Successfully inserted all data ... ");
    process.kill(process.pid);
  } catch (error) {
    console.error(error.message);
  }
}

init();
